addSetlist(
"しまさか",
"2025",
"【速報】しまさかでバースデーイベントやるってよwww >>9 Last Phrase", [
["ガチ恋者達に捧ぐバラッド ～キミが笑えば地球も回る～", "", "ガチコイシャタチニササグバラッドキミガワラエバチキュウモマワル"],
["シャララ", "", "シャララ"],
["溺愛", "", "デキアイ"],
["PAPER MOON", "", "ペーパームーン"],
["コールボーイ", "", "コールボーイ"],
["虎視眈々", "", "コシタンタン"],
["脳内シェイカー", "", "ノウナイシェイカー"],
["ワールズエンド・ダンスホール(rock arrange ver.)", "", "ワールズエンドダンスホールロックアレンジバージョン"],
["夜は眠れるかい？", "", "ヨルハネムレルカイ"],
["ムラサキ", "", "ムラサキ"],
["ジロティナブル", "", "ジロティナブル"],
["Datency", "", "デーテンシー"],
["乱×銃", "", "ランジュウ"],
["Pink", "", "ピンク"],
["ZEAL", "", "ジール"],
["独断", "", "ドクダン"],
["女々しくて", "", "メメシクテ"],
["CRAZY BUNNY!!", "", "クレイジーバニー"],
["ずっとずっと。", "", "ズットズット"],
["ラストフレーズ", "", "ラストフレーズ"],
["RED", "", "レッド"],
["愛してもいいかい？", "", "アイシテモイイカイ"],
["未完成ユートピア", "", "ミカンセイユートピア"],
]);


addSetlist(
"しまさか",
"2024",
"【速報】しまさかでバースデーイベントやるってよwww >>8 Missa", [
["ジロティナブル", "しまさか", "ジロティナブル"],
["ヒバナ", "しまさか", "ヒバナ"],
["It's...Our Life?", "しまさか", "イッツアワーライフ"],
["神っぽいな", "しまさか", "カミッポイナ"],
["ウィキアリティ", "しまさか", "ウィキアリティ"],
["ワールズエンド・ダンスホール", "しまさか", "ワールズエンドダンスホール"],
["イドラのサーカス", "しまさか", "イドラノサーカス"],
["ラストフレーズ", "しまさか", "ラストフレーズ"],
["モエチャッカファイア", "しまさか", "モエチャッカファイア"],
["プロポーズ", "しまさか", "プロポーズ"],
["未完成ユートピア", "しまさか", "ミカンセイユートピア"],
["二息歩行（Reloaded）", "しまさか", "フタイキホコウ リローデッド"],
["CRAZY BUNNY！！", "しまさか", "クレイジーバニー"],
["ダンサブリミア", "しまさか", "ダンサブリミア"],
["シャララ", "しまさか", "シャララ"],
["無駄≠無駄", "しまさか", "ムダムダ"],
["曇天", "しまさか", "ドンテン"],
["RED", "しまさか", "レッド"],
["My Sweet Prisoner", "しまさか", "マイスイートプリズナー"],
["Black Knight", "しまさか", "ブラックナイト"],
["乱×銃", "しまさか", "ランジュウ"],
]);


addSetlist(
"しまさか",
"2023",
"【速報】しまさかでバースデーイベントやるってよwww >>7 DeePrison", [
["My Sweet Prisoner", "しまさか", "マイスイートプリズナー"],
["罰ゲーム", "しまさか", "バツゲーム"],
["PLATONIC GIRL", "しまさか", "プラトニックガール"],
["レクイエム", "しまさか", "レクイエム"],
["え？あぁ、そう。", "しまさか", "エ アァ ソウ"],
["ワナビークインビー", "しまさか", "ワナビークインビー"],
["レッドホットクレイジーナイト", "しまさか", "レッドホットクレイジーナイト"],
["生き証人", "しまさか", "イキショウニン"],
["脱獄 -Rock Arrange ver.-", "しまさか", "ダツゴク ロックアレンジバージョン"],
["酔いどれ知らず", "しまさか", "ヨイドレシラズ"],
["ダーリン", "しまさか", "ダーリン"],
["乱×銃", "しまさか", "ランジュウ"],
["Magiない♡カリグラフィック", "しまさか", "マギナイカリグラフィック"],
["スーパーヒーロー", "しまさか", "スーパーヒーロー"],
["チェック・ナイト", "しまさか", "チェックナイト"],
["CRAZY BUNNY!!", "しまさか", "クレイジーバニー"],
["4 REAL IN ACTION !!!!", "しまさか", "フォーリアルインアクション"],
["RED", "しまさか", "レッド"],
["未完成ユートピア", "しまさか", "ミカンセイユートピア"],
["ラストフレーズ", "しまさか", "ラストフレーズ"],
]);


addSetlist(
"しまさか",
"2022",
"【速報】しまさかでバースデーイベントやるってよwww >>6 FAKEOUT", [
["RED", "しまさか", "レッド"],
["ロキ", "しまさか", "ロキ"],
["拝啓ドッペルゲンガー", "しまさか", "ハイケイドッペルゲンガー"],
["脱法ロック", "しまさか", "ダッポウロック"],
["シャンティ", "しまさか", "シャンティ"],
["ヒロイン", "志麻", "ヒロイン"],
["クリスマスソング", "となりの坂田。", "クリスマスソング"],
["レッドホットクレイジーナイト", "しまさか", "レッドホットクレイジーナイト"],
["PAPER MOON", "しまさか", "ペーパームーン"],
["未完成ユートピア", "しまさか", "ミカンセイユートピア"],
["エゴロック", "しまさか", "エゴロック"],
["CRAZY BUNNY！！", "しまさか", "クレイジーバニー"],
["二息歩行（Reloaded）", "しまさか", "フタイキホコウ リローデッド"],
["鼓動", "しまさか", "コドウ"],
["FIREFIRE", "しまさか", "ファイアファイア"],
["乱×銃", "しまさか", "ランジュウ"],
["スーパーヒーロー", "しまさか", "スーパーヒーロー"],
["ラストフレーズ", "しまさか", "ラストフレーズ"],
]);


addSetlist(
"しまさか",
"2021",
"【速報】しまさかでバースデーイベントやるってよwww >>5 Bloody Holy Night", [
["乱×銃", "しまさか", "ランジュウ"],
["PLATONIC GIRL", "しまさか", "プラトニックガール"],
["CRAZY BUNNY!!", "しまさか", "クレイジーバニー"],
["快刀乱麻!!", "しまさか", "カイトウランマ"],
["NO DRIVE, NO LIFE", "しまさか", "ノードライブノーライフ"],
["THE CROSSING SOUL", "しまさか", "ザクロッシングソウル"],
["夜は眠れるかい？", "しまさか", "ヨルハネムレルカイ"],
["It's...Our Life?", "しまさか", "イッツアワーライフ"],
["スーパーヒーロー", "しまさか", "スーパーヒーロー"],
["二息歩行(Reloaded)", "しまさか", "フタイキホコウ リローデッド"],
["notebook love", "しまさか", "ノートブックラブ"],
["エゴロック", "しまさか", "エゴロック"],
["テレキャスタービーボーイ", "しまさか", "テレキャスタービーボーイ"],
["未完成ユートピア", "しまさか", "ミカンセイユートピア"],
["Oxygen", "しまさか", "オキシジェン"],
["Black Knight", "しまさか", "ブラックナイト"],
["曇天", "しまさか", "ドンテン"],
["ラストフレーズ", "しまさか", "ラストフレーズ"],
]);

 /*完成*/


