const data = [];

/* ライブ1公演をまとめて追加する関数 */
function addSetlist(liveName, songs) {
  songs.forEach(item => {
    data.push({
      song: item[0],
      note: item[1],
      live: liveName
    });
  });
}

/* ===== サンプルデータ ===== */

addSetlist("浦島坂田船 Spring Tour 2024 -四春祭-", [
/* 完成 */,
["SAKURA FUBUKI",""],
["ミダリニハルイロ",""],
["貴方と云ふ花",""],
["恋色花火",""],
["グッド・バイ",""],
["花魁俺嵐コンフュージョン",""],
["アワ・ダンサー",""],
["SHININ'DAYS","志麻セン・日替わり"],
["Happy tap people","うらさか・日替わり",],
["チュルリラ・チュルリラ・ダッダッダ！","うらしま・日替わり"],
["マンティス▽クライシス","さかせん・日替わり"],
["大喝采","裏千家・日替わり"],
["My Sweet Prisoner","しまさか・日替わり"],
["祭唄",""],
["鈍色Wheels",""],
["シャドウ",""],
["だれかの心臓になれたなら","うらたぬき・日替わり"],
["ロスタイムメモリー","となりの坂田。・日替わり"],
["さよならメモリーズ","センラ・日替わり",],
["バレリーコ","志麻・日替わり"],
["人生リセットボタン","うらたぬき・日替わり"],
["世界寿命と最後の一日","となりの坂田。・日替わり"],
["朧月","センラ・日替わり",],
["ゴーストルール","志麻・日替わり"],
["Bling-Bang-Bang-Born",""],
["ゼンシンゼンレイ好きさ",""],
["花鳥風月",""],
["Pathfinders",""],
["花吹雪",""],
["完全燃焼～春祭り～",""],
["合戦",""],
["絶景",""],
["花や、花","東京公演のみ"],
]);


addSetlist("浦島坂田船 SUMMER TOUR 2024 Weddiing", [
/* 完成 */
["アダマントリング",""],
["アイドルっぽい曲を作った。",""],
["僕のシンデレラ",""],
["世界で一番好きな名前",""],
["SHOW MUST GO ON!!",""],
["Save Me",""],
["ホワイトプリンス",""],
["Mermaid","日替わり"],
["君まであと何メーター","日替わり"],
["フレテ",""],
["シックスセンス・ベル",""],
["幸せのレシピ",""],
["メリメリ","うらたぬき"],
["マグネティック","となりの坂田。"],
["妄想注意報","うらさか"],
["Killer Killer My Love","志麻"],
["FlashBack","センラ"],
["Treat You Better","志麻セン"],
["シャララ",""],
["むしろ Why?",""],
["生き証人","日替わり"],
["レッドホットクレイジーナイト","日替わり"],
["フレンドシップ",""],
["＋",""],
["ハイサイ守護礼",""],
["ヘウレーカ","日替わり"],
["SAILING!!!!! ","日替わり"],
["祭り唄","愛知１日目のみ"],
["明日へのBye Bye","愛知２日目のみ"],
]);


addSetlist("Happy Halloweeeen 浦島坂田幽霊船 さぁ手をとってshall we dance? 舞踏会はもう明日！？まだはえーよ！マスカレード！ぬっはー！仮面の下はｶﾒｪﾝｸﾞｽｩﾝ ｽｩﾝ…ｽｩﾝ…ｽｩﾝ…", [
/* 完成 */
["アイシナヨ",""],
["溺愛","日替わり"],
["フランマ","日替わり"],
["シャドウ","日替わり"],
["微笑、香り、君と僕を繋ぐ",""],
["Boohoo",""],
["月夜",""],
["ヒドイヒドラ","日替わり"],
["ワナビークインビー","日替わり"],
["Peacock Epoch","日替わり"],
["Beetle Battle",""],
["Secret Answer",""],
["GENTLEMEN'S NIGHT",""],
["グリムメイカー",""],
["No.17","志麻"],
["イイナリレーション","うらたぬき"],
["独断","となりの坂田。"],
["スペシャルパフェ","センラ"],
["ワガママOnly Mine",""],
["ハングリー・ゴースト",""],
["花魁俺嵐コンフュージョン","日替わり"],
["PIRATES A GOGO","日替わり"],
["むしろWhy?","日替わり"],
["ポーカーフェイク","日替わり"],
["明日へのBye Bye","日替わり"],
["獣王無尽","日替わり"],
["SPOOKY MAGICAL NIGHT",""],
["パイレーツオブ宇宙！",""],
["獣王無尽",""],
["ハロウ！ゴーストシップ",""],
["おーるでい・おーるにゃいと",""],
["シックスセンス・ベル",""],
["Piece Piece Piece",""],
["アダマントリング","東京３日目のみ"],
]);


addSetlist("浦島坂田船 Spring TOUR 2025 月", [
/* 完成 */
["月華",""],
["花鳥風月",""],
["百花繚乱",""],
["花吹雪","日替わり"],
["絶景","日替わり"],
["アワ・ダンサー","日替わり"],
["返り咲","日替わり"],
["花や、花",""],
["月夜",""],
["年に一夜の恋模様",""],
["Starry Heaven",""],
["祭唄",""],
["十五夜オツキサマ","うらたぬき・日替わり"],
["さよならグッバイ","志麻・日替わり"],
["Pudding","センラ・日替わり"],
["無駄≠無駄","となりの坂田。・日替わり"],
["ド屑","うらたぬき・日替わり"],
["イエスタデイはトゥモローを歌わない","志麻・日替わり"],
["曼珠沙華","センラ・日替わり"],
["I'm Your Tamer","となりの坂田。・日替わり"],
["たぬきのぽんぽこ祭り","うらたぬき・日替わり"],
["十六夜ナイトフィーバー","志麻・日替わり"],
["さよならウィステリア","センラ・日替わり"],
["記憶の水槽","となりの坂田。・日替わり"],
["透明","センラ・日替わり"],
["インビジブル","裏千家・日替わり"],
["ダンサブリミア","しまさか・日替わり"],
["モエチャッカファイア","うらしま・日替わり"],
["ビビデバ","さかせん・日替わり"],
["百花繚乱デンジャービーツ","うらさか・日替わり"],
["ギャラクシー","志麻セン・日替わり"],
["ハッピーエンドは笑うように",""],
["超毒的LOVE",""],
["Recipe",""],
["4 REAL IN ACTION!!!!","日替わり"],
["合戦","日替わり"],
["花魁俺嵐コンフュージョン","日替わり"],
["わいふぁい暴想ボーイ","日替わり"],
["わたしの一番かわいいところ",""],
["そらに、ひらり",""],
["アイシナヨ","日替わり"],
["ワガママOnly Mine","日替わり"],
["いーあるふぁんくらぶ","日替わり"],
["熱々ワッショイダンス",""],
["ハイサイ守護礼","沖縄公演のみ"],
]);


addSetlist("浦島坂田船 SUMMER TOUR 2025 WARN12G", [
/* 完成 */
["MINE MINE",""],
["YELLOW FINEST",""],
["GENTLEMEN’S NIGHT","日替わり"],
["ワナビークインビー","日替わり"],
["ヒバナ","日替わり"],
["拝啓ドッペルゲンガー","日替わり"],
["Beetle Battle",""],
["Trashy",""],
["シャララ","日替わり"],
["レッドホットクレイジーナイト","日替わり"],
["アンコール",""],
["宵座興",""],
["祝辞","となりの坂田。"],
["Secret KISS","センラ"],
["大人A-S-O-V","うらさか"],
["獣王無尽",""],
["U.S.S.S HOLIC",""],
["鈍色Wheels",""],
["言霊","志麻"],
["P!P!P!P!","うらたぬき"],
["Rat-a-tat","志麻セン"],
["被害妄想携帯女子（笑）",""],
["You miss me, I know!",""],
["Fortune!!","日替わり"],
["最強Drive!!","日替わり"],
["シンプルLOVE",""],
["Happiness",""],
["Peacock Epoch","東京２日目"],
["ハッピーエンドは笑うように","日替わり"],
["ホワイトプリンス","日替わり"],
["あざといんふるえんさー",""],
["I’m home again",""],
["月華",""],
["恋色花火",""],
["Shoutër","福岡２日目"],
]);



addSetlist("Happy Halloweeeen 浦島坂田幽霊船 ～え！？くぅｯｯ///そっ♡(腰に手をぽふっ)shh...STRONG...俺の弾丸をﾊﾞｷｭうーﾝ♡ﾎｯ､もう地獄はサッタンDEATHね～", [
/*完成*/
["KISS THE BULLET",""],
["HORRORISM",""],
["Bad Monster",""],
["駆け上がるボルテージ",""],
["グリムメイカー",""],
["ストリーミングハート","日替わり"],
["ゴーストルール","日替わり"],
["シックスセンス・ベル",""],
["悪魔の踊り方",""],
["Exorcise",""],
["最強ライバル","日替わり"],
["ARK","日替わり"],
["おーるでい・おーるにゃいと",""],
["秘密リミッター","センラ・日替わり"],
["モニタリング","志麻・日替わり"],
["サディー","うらたぬき・日替わり"],
["絶え間なく藍色","となりの坂田。・日替わり"],
["Lie or Truth","センラ・日替わり"],
["DA DA DICE","志麻・日替わり"],
["プロポーズ","うらたぬき・日替わり"],
["MASK","となりの坂田。・日替わり"],
["MINE MINE",""],
["君色々移り -トリビュートver.-",""],
["ばく",""],
["シンデレラステップ","日替わり"],
["明日へのByeBye","日替わり"],
["Q for U",""],
["フライングゲット",""],
["ハロウ！ゴーストシップ",""],
["今日から俺たちゴーストバスターズ",""],
["ドラマティックノエル","東京２日目"],
["フレテ",""],
]);



/* ===== 検索機能 ===== */

document.getElementById("searchBox").addEventListener("keypress", function(event) {
  if (event.key === "Enter") {
    searchSong();
  }
});

function searchSong() {
  const keyword = document.getElementById("searchBox").value.trim();
  const result = document.getElementById("result");
  result.innerHTML = "";
  const filtered = data.filter(item =>
    item.song.includes(keyword)
  );

  if (filtered.length === 0) {
    result.innerHTML = "<li>見つかりませんでした</li>";
    return;
  }

  filtered.forEach(item => {
    const li = document.createElement("li");
    if (item.note === "") {
      li.textContent = item.live;
    } else {
      li.textContent = item.live + "（" + item.note + "）";
    }
 result.appendChild(li);
  });
}