const data = [];

function addSetlist(year, liveName, songs) {
  songs.forEach(item => {
    data.push({
      song: item[0],
      note: item[1],
      alias: item[2] || "",
      live: liveName,
      year: year
    });
  });
}



/* ===== サンプルデータ ===== */

addSetlist(
  "2016",
  "浦島坂田船 SUMMER TOUR 2016　-CRUISE PARTY-", [
["Pathfinders","","パスファインダーズ"],
["アイドルっぽい曲を作った。","","アイドルッポイキョクヲツクッタ"],
["Dreamer","","ドリーマー"],
["Mermaid","","マーメイド"],
["スーパーヒーロー","となりの坂田。","スーパーヒーロー"],
["シアワセは台本の外から","うらたぬき","シアワセハダイホンノソトカラ"],
["虎視眈々","","コシタンタン"],
["ポワゾンKISS","","ポワゾンキス"],
["恋色花火","","コイイロハナビ"],
["Shoutër","","シャウター"],
["最強ライバル","日替わり","サイキョウライバル"],
["しわ","日替わり","シワ"],
["バレリーコ","うらさか","バレリーコ"],
["おこちゃま戦争","志麻セン","オコチャマセンソウ"],
["notebook love","志麻","ノートブックラブ"],
["色恋","センラ","イロコイ"],
["このふざけた素晴らしき世界は、僕の為にある","日替わり","コノフザケタスバラシキセカイハボクノタメニアル"],
["千本桜","日替わり","センボンザクラ"],
["咲かせよ乙女、喰らえよ男児","日替わり","サカセヨオトメクラエヨダンジ"],
["アイのシナリオ","日替わり","アイノシナリオ"],
["member","日替わり","メンバー"],
["アスノヨゾラ哨戒班","日替わり","アスノヨゾラショウカイハン"],
["言葉のいらない約束","日替わり","コトバノイラナイヤクソク"],
["厨病激発ボーイ","日替わり","チュウビョウゲキハツボーイ"],
["ゴーストルール","うらさか・愛知公演のみ","ゴーストルール"],
["はなまるぴっぴはよいこだけ","志麻セン・愛知公演のみ","ハナマルピッピハヨイコダケ"],
["Fire◎Flower","日替わり","ファイアフラワー"],
["Blessing","日替わり","ブレッシング"],
]);

addSetlist(
  "2016",
  "浦島坂田船 SUMMER TOUR 2016 -CRUISE LIVE-", [   
["Pathfinders", "", "パスファインダーズ"],
["アイドルっぽい曲を作った。", "", "アイドルッポイキョクヲツクッタ"],
["Dreamer", "", "ドリーマー"],
["最強ライバル", "", "サイキョウライバル"],
["Mermaid", "", "マーメイド"],
["しわ", "", "シワ"],
["notebook love", "志麻", "ノートブックラブ"],
["色恋", "センラ", "イロコイ"],
["曇天", "志麻セン", "ドンテン"],
["スーパーヒーロー", "となりの坂田。", "スーパーヒーロー"],
["バレリーコ", "うらさか", "バレリーコ"],
["シアワセは台本の外から", "", "シアワセハダイホンノソトカラ"],
["虎視眈々", "", "コシタンタン"],
["海賊船～心の奪い手～", "", "カイゾクセンココロノウバイテ"],
["千本桜", "", "センボンザクラ"],
["ポワゾンKISS", "", "ポワゾンキス"],
["Blessing", "", "ブレッシング"],
["Fire◎Flower", "", "ファイアーフラワー"],
["I'm Home Again", "", "アイムホームアゲイン"],
["Calc.", "†Darkness phantom chains†", "カルク"],
["恋色花火", "", "コイイロハナビ"],
["Shoutër", "", "シャウター"],
]);

addSetlist(
  "2017",
  "浦島坂田船 SPRING TOUR 2017 -春の宴-", [
["海賊船～心の奪い手～", "", "カイゾクセンココロノウバイテ"],
["千本桜", "", "センボンザクラ"],
["虎視眈々", "", "コシタンタン"],
["ゴーストルール", "", "ゴーストルール"],
["エイリアンエイリアン", "", "エイリアンエイリアン"],
["フラジール", "さかせん", "フラジール"],
["ダチュラと林檎", "センラ", "ダチュラトリンゴ"],
["きみへ", "となりの坂田。", "キミヘ"],
["ドナーソング", "志麻", "ドナーソング"],
["ダンスロボットダンス", "うらたぬき", "ダンスロボットダンス"],
["脱獄", "うらしま", "ダツゴク"],
["Pathfinders", "", "パスファインダーズ"],
["アイドルっぽい曲を作った。", "", "アイドルッポイキョクヲツクッタ"],
["脱法ロック", "", "ダッポウロック"],
["Dreamer", "", "ドリーマー"],
["君まであと何メーター", "", "キミマデアトナンメーター"],
["太陽系デスコ", "", "タイヨウケイデスコ"],
["Shoutër", "", "シャウター"],
]);

addSetlist(
  "2017",
  "浦島坂田船 SUMMER TOUR 2017 ～THE FINAL～", [
["Pathfinders", "", "パスファインダーズ"],
["Carry Forward", "", "キャリーフォワード"],
["最強ライバル", "", "サイキョウライバル"],
["厨病激発ボーイ", "", "チュウビョウゲキハツボーイ"],
["太陽系デスコ", "", "タイヨウケイデスコ"],
["Reach", "うらたぬき", "リーチ"],
["NO DRIVE, NO LIFE", "となりの坂田。", "ノードライブノーライフ"],
["プリンセスに口づけを", "うらさか", "プリンセスニクチヅケヲ"],
["slumber number", "センラ", "スランバーナンバー"],
["#嘲笑ポラロイド", "志麻セン", "チョウショウポラロイド"],
["recoup", "志麻", "リクープ"],
["ロメオ", "", "ロメオ"],
["ポワゾンKISS", "", "ポワゾンキス"],
["花鳥風月", "", "カチョウフウゲツ"],
["千本桜-guitar rock arrangement ver.-", "", "センボンザクラギターロックアレンジメント"],
["恋色花火", "", "コイイロハナビ"],
["君まであと何メーター", "", "キミマデアトナンメーター"],
["SHOW MUST GO ON!!", "", "ショウマストゴーオン"],
["Sailor's High", "", "セイラーズハイ"],
["Dreamer", "", "ドリーマー"],
["Mermaid", "", "マーメイド"],
["Shoutër", "", "シャウター"],
]);




addSetlist(
  "2017",
  "Happy Halloweeeen 浦島坂田幽霊船 ～コスプレしてLOVE（恋）♥～", [
/*完成*/
["Mrs.Pumpkinの滑稽な夢", "", "ミセスパンプキンノコッケイナユメ"],
["Happy Halloween", "", "ハッピーハロウィン"],
["ゴーストルール", "", "ゴーストルール"],
["拝啓ドッペルゲンガー", "", "ハイケイドッペルゲンガー"],
["ハロウ！ゴーストシップ", "", "ハロウゴーストシップ"],
["彗星ハネムーン", "うらたぬき", "スイセイハネムーン"],
["可愛くなりたい", "となりの坂田。", "カワイクナリタイ"],
["すきなことだけでいいです", "うらさか", "スキナコトダケデイイデス"],
["ヒバナ", "志麻", "ヒバナ"],
["フィクサー", "センラ", "フィクサー"],
["#嘲笑ポラロイド", "志麻セン", "アザワライポラロイド"],
["Shoutër", "", "シャウター"],
["Sailor's High", "", "セイラーズハイ"],
["花鳥風月", "", "カチョウフウゲツ"],
["千本桜-guitar rock arrangement ver.-", "", "センボンザクラギターロックアレンジメント"],
["SHOW MUST GO ON!!", "", "ショウマストゴーオン"],
]);



addSetlist(
  "2018",
  "浦島坂田船 Spring Tour 2018 ～桜吹雪で乱de舞！～", [
["百花繚乱", "", "ヒャッカリョウラン"],
["千本桜-guitar rock arrangement ver.-", "", "センボンザクラギターロックアレンジメント"],
["チュルリラ・チュルリラ・ダッダッダ！", "", "チュルリラチュルリラダッダッダ"],
["太陽系デスコ", "", "タイヨウケイデスコ"],
["ターミナル", "センラ", "ターミナル"],
["#嘲笑ポラロイド", "志麻セン", "アザワライポラロイド"],
["カメリア・コンプレックス", "志麻", "カメリアコンプレックス"],
["お気に召すまま", "となりの坂田。", "オキニメスママ"],
["ノンファンタジー", "うらさか", "ノンファンタジー"],
["テオ", "うらたぬき", "テオ"],
["海賊船～心の奪い手～", "", "カイゾクセンココロノウバイテ"],
["花鳥風月", "", "カチョウフウゲツ"],
["Carry Forward", "", "キャリーフォワード"],
["彗星ハネムーン", "", "スイセイハネムーン"],
["ハロウ！ゴーストシップ", "", "ハロウゴーストシップ"],
["Shoutër", "", "シャウター"],
["SHOW MUST GO ON!!", "", "ショウマストゴーオン"],
["年に一夜の恋模様", "", "ネンニヒトヨノコイモヨウ"],
["Mermaid", "", "マーメイド"],
["そらに、ひらり", "", "ソラニヒラリ"],
]);

addSetlist(
  "2018",
  "SUMMER TOUR 2018～俺SUMMERと、宇CHU♡旅行♡～ DJ Edition", [
    ["Starry Cruise","","スターリークルーズ"],
["Peacock Epoch","","ピーコックエポック"],
["ブリキノダンス","","ブリキノダンス"],
["明星ギャラクティカ","","ミョウジョウギャラクティカ"],
["太陽系デスコ","","タイヨウケイデスコ"],
["スクールボーイ","となりの坂田。","スクールボーイ"],
["Life goes on","うらたぬき","ライフゴーズオン"],
["spill","志麻","スピル"],
["ギャラクシー","志麻セン","ギャラクシー"],
["ユメミドリ","うらさか","ユメミドリ"],
["Nectar","さかせん","ネクター"],
["Make a pass","センラ","メイクアパス"],
["ロキ","しまさか","ロキ"],
["メリーバッドエンド","うらしま","メリーバッドエンド"],
["拝啓ドッペルゲンガー","裏千家","ハイケイドッペルゲンガー"],
["わいふぁい暴想ボーイ","","ワイファイボウソウボーイ"],
["花鳥風月","","カチョウフウゲツ"],
["SHOW MUST GO ON!!","","ショウマストゴーオン"],
["年に一夜の恋模様","","トシニヒトヨノコイモヨウ"],
["恋色花火","","コイイロハナビ"],
["Shoutër","","シャウター"],
]);

    
addSetlist(
  "2018",
  "浦島坂田船 SUMMER TOUR 2018 ～THE FINAL～", [
["Starry Cruise", "", "スターリークルーズ"],
["明星ギャラクティカ", "", "ミョウジョウギャラクティカ"],
["わいふぁい暴想ボーイ", "", "ワイファイボウソウボーイ"],
["ロキ", "", "ロキ"],
["太陽系デスコ", "", "タイヨウケイデスコ"],
["スクールボーイ", "となりの坂田。", "スクールボーイ"],
["ユメミドリ", "うらさか", "ユメミドリ"],
["Life goes on", "うらたぬき", "ライフゴーズオン"],
["spill", "志麻", "スピル"],
["Make a pass", "センラ", "メイクアパス"],
["ギャラクシー", "志麻セン", "ギャラクシー"],
["Peacock Epoch", "", "ピーコックエポック"],
["花鳥風月", "", "カチョウフウゲツ"],
["ロメオ", "", "ロメオ"],
["Sailor's High", "", "セイラーズハイ"],
["SHOW MUST GO ON!!", "", "ショウマストゴーオン"],
["secret base ～君がくれたもの～", "", "シークレットベースキミガクレタモノ"],
["年に一夜の恋模様", "", "ネンニヒトヨノコイモヨウ"],
["千本桜-guitar rock arrangement ver.-", "", "センボンザクラギターロックアレンジメントバージョン"],
["Shoutër", "", "シャウター"],
["SAILING!!!!!", "", "セイリング"],
]);


addSetlist(
  "2018",
  "Happy Halloweeeen 浦島坂田幽霊船 ～吸魂（求婚）パーティ！？ちょっと魔って♥もしかして僕にヨーカイ？～", [
["グリムメイカー", "", "グリムメイカー"],
["ハロウ！ゴーストシップ", "", "ハロウゴーストシップ"],
["Happy Halloween", "", "ハッピーハロウィン"],
["Mrs.Pumpkinの滑稽な夢", "", "ミセスパンプキンノコッケイナユメ"],
["ロメオ", "", "ロメオ"],
["千日紅", "志麻", "センニチコウ"],
["#嘲笑ポラロイド", "志麻セン", "チョウショウポラロイド"],
["スパイラル", "センラ", "スパイラル"],
["私、アイドル宣言", "となりの坂田。", "ワタシアイドルセンゲン"],
["夢ファンファーレ", "うらさか", "ユメファンファーレ"],
["Pink", "うらたぬき", "ピンク"],
["Shoutër", "", "シャウター"],
["年に一夜の恋模様", "", "ネンニヒトヨノコイモヨウ"],
["最強ライバル", "", "サイキョウライバル"],
["太陽系デスコ", "", "タイヨウケイデスコ"],
["わいふぁい暴想ボーイ", "", "ワイファイボウソウボーイ"],
["Peacock Epoch", "", "ピーコックエポック"],
["花鳥風月", "", "カチョウフウゲツ"],
["Dreamer", "", "ドリーマー"],
["千本桜-guitar rock arrangement ver.-", "", "センボンザクラギターロックアレンジメント"],
["厨病激発ボーイ", "", "チュウビョウゲキハツボーイ"],
["SAILING!!!!!", "", "セイリング"],
]);





addSetlist(
  "2019",
  "浦島坂田船 Spring Tour 2019 -斬（ZAN）-", [
["花鳥風月", "", "カチョウフウゲツ"],
["千本桜-guitar rock arrangement ver.-", "", "センボンザクラギターロックアレンジメント"],
["虎視眈々", "", "コシタンタン"],
["百花繚乱", "", "ヒャッカリョウラン"],
["吉原ラメント", "", "ヨシワララメント"],
["やっぱ最強！", "うらさか", "ヤッパサイキョウ"],
["ジグソーパズル", "志麻セン", "ジグソーパズル"],
["誠 -Live for Justice-", "", "マコトライブフォージャスティス"],
["スパイラル", "センラ", "スパイラル"],
["セクトの誅罰", "うらたぬき", "セクトノチュウバツ"],
["ボードゲームライフ", "志麻", "ボードゲームライフ"],
["ねぇ、どろどろさん", "となりの坂田。", "ネェドロドロサン"],
["神のまにまに", "", "カミノマニマニ"],
["小さなライオン", "", "チイサナライオン"],
["Sailor's High", "", "セイラーズハイ"],
["わいふぁい暴想ボーイ", "", "ワイファイボウソウボーイ"],
["Peacock Epoch", "", "ピーコックエポック"],
["合戦", "", "カッセン"],
["そらに、ひらり", "", "ソラニヒラリ"],
["Shoutër", "", "シャウター"],
["SAILING!!!!!", "", "セイリング"],
]);



addSetlist(
  "2019",
  "浦島坂田船 SUMMER TOUR 2019 -浦島theカジノ船　俺たち愛＄、今夜お前とBETイン-", [
["ポーカーフェイク", "", "ポーカーフェイク"],
["ポワゾンKISS", "", "ポワゾンキス"],
["フィクサー", "", "フィクサー"],
["花鳥風月", "", "カチョウフウゲツ"],
["Peacock Epoch", "", "ピーコックエポック"],
["CRAZY BUNNY!!", "志麻", "クレイジーバニー"],
["決戦前夜", "志麻セン", "ケッセンゼンヤ"],
["Freja", "センラ", "フレイヤ"],
["未完成ユートピア", "となりの坂田。", "ミカンセイユートピア"],
["Trip-Trap, Love Trap!!", "うらさか", "トリップトラップラブラップ"],
["No.1 Girl", "うらたぬき", "ナンバーワンガール"],
["Game Changer", "", "ゲームチェンジャー"],
["Beetle Battle", "", "ビートルバトル"],
["明日へのBye Bye", "", "アシタヘノバイバイ"],
["ARK", "", "アーク"],
["Fortune!!", "", "フォーチュン"],
["シンプルLOVE", "", "シンプルラブ"],
["Starry Cruise", "メドレー", "スターリークルーズ"],
["明星ギャラクティカ", "メドレー", "ミョウジョウギャラクティカ"],
["Reach", "うらたぬき・メドレー", "リーチ"],
["spill", "志麻・メドレー", "スピル"],
["NO DRIVE, NO LIFE", "となりの坂田。・メドレー", "ノードライブノーライフ"],
["色恋", "センラ・メドレー", "イロコイ"],
["I'm Home Again", "メドレー", "アイムホームアゲイン"],
["SHOW MUST GO ON!!", "メドレー", "ショウマストゴーオン"],
["Shoutër", "メドレー", "シャウター"],
    ["カレンダーリマインダー", "", "カレンダーリマインダー"],
["合戦", "", "カッセン"],
["花吹雪", "", "ハナフブキ"],
["恋色花火", "", "コイイロハナビ"],
["ROULETTE", "", "ルーレット"],
["わいふぁい暴想ボーイ", "", "ワイファイボウソウボーイ"],
["アワ・ダンサー", "", "アワダンサー"],
["SAILING!!!!!", "", "セイリング"],
]);



addSetlist(
  "2019",
  "Happy Halloweeeen 浦島坂田幽霊船　～ようこそ令和元年 やっぱり霊はあかんねん憑依Go!～", [
["HORRORISM", "", "ホラリズム"],
["グリムメイカー", "", "グリムメイカー"],
["ゴーストルール", "", "ゴーストルール"],
["拝啓ドッペルゲンガー", "", "ハイケイドッペルゲンガー"],
["Mrs.Pumpkinの滑稽な夢", "", "ミセスパンプキンノコッケイナユメ"],
["Happy Halloween", "", "ハッピーハロウィン"],
["ハロウ！ゴーストシップ", "", "ハロウゴーストシップ"],
["Trip-Trap, Love Trap!!", "志麻セン", "トリップトラップラブラップ"],
["決戦前夜", "うらさか", "ケッセンゼンヤ"],
["ハングリー・ゴースト", "", "ハングリーゴースト"],
["Starry Cruise", "", "スターリークルーズ"],
["Fortune!!", "", "フォーチュン"],
["ARK", "", "アーク"],
["ビターチョコデコレーション", "となりの坂田。", "ビターチョコデコレーション"],
["最適解", "志麻", "サイテキカイ"],
["コールボーイ", "センラ", "コールボーイ"],
["誘惑", "うらたぬき", "ユウワク"],
["Beetle Battle", "", "ビートルバトル"],
["ポーカーフェイク", "", "ポーカーフェイク"],
["花吹雪", "", "ハナフブキ"],
["千本桜-guitar rock arrangement ver.-", "", "センボンザクラギターロックアレンジメントバージョン"],
["Snow melody", "", "スノーメロディー"],
["カレンダーリマインダー", "", "カレンダーリマインダー"],
["Shoutër", "", "シャウター"],
["明日へのBye Bye", "", "アシタヘノバイバイ"],
]);





addSetlist(
  "2020",
  "浦島坂田船！Live&Live～RAINBOW～", [
/*完成*/
["YELLOW FINEST", "", "イエローファイネスト"],
["青く塗り替えろ!", "", "アオクヌリカエロ"],
["最強Drive!!", "", "サイキョウドライブ"],
["レッドホットクレイジーナイト", "", "レッドホットクレイジーナイト"],
["ココ マドモアゼル", "", "ココマドモアゼル"],
["GET UP", "うらたぬき", "ゲットアップ"],
["紫雲の翼", "志麻", "シウンノツバサ"],
["迷図", "となりの坂田。", "メイズ"],
["Sweet Magic", "センラ", "スイートマジック"],
["VS", "うらさか", "ブイエス"],
["ファイティンサマーカーニバル", "志麻セン", "ファイティンサマーカーニバル"],
["ポーカーフェイク", "", "ポーカーフェイク"],
["微笑、香り、君と僕を繋ぐ", "", "ビショウカオリキミトボクヲツナグ"],
["Peacock Epoch", "", "ピーコックエポック"],
["ホエールホール", "", "ホエールホール"],
["花や、花", "", "ハナヤハナ"],
["Shoutër", "", "シャウター"],
["RAINBOW", "", "レインボー"],
]);



addSetlist(
  "2020",
  "浦島坂田船！Live&Live～CREW'S BEST～", [
/*完成*/
["Shoutër", "", "シャウター"],
["花鳥風月", "", "カチョウフウゲツ"],
["海賊船～心の奪い手～", "", "カイゾクセンココロノウバイテ"],
["Mermaid", "", "マーメイド"],
["シアワセは台本の外から", "うらたぬき", "シアワセハダイホンノソトカラ"],
["CRAZY BUNNY!!", "志麻", "クレイジーバニー"],
["スーパーヒーロー", "となりの坂田。", "スーパーヒーロー"],
["色恋", "センラ", "イロコイ"],
["Snow melody", "", "スノーメロディー"],
["花魁俺嵐コンフュージョン", "", "オイランオレランコンフュージョン"],
["Beetle Battle", "", "ビートルバトル"],
["年に一夜の恋模様", "メドレー", "トシニヒトヨノコイモヨウ"],
["アイドルっぽい曲を作った。", "メドレー", "アイドルッポイキョクヲツクッタ"],
["ベノム", "メドレー", "ベノム"],
["ハロウ！ゴーストシップ", "メドレー", "ハロウゴーストシップ"],
["ARK", "メドレー", "アーク"],
["Sailor's High", "メドレー", "セイラーズハイ"],
["Dreamer", "メドレー", "ドリーマー"],
["千本桜-guitar rock arrangement ver.-", "メドレー", "センボンザクラギターロックアレンジメントバージョン"],
["君まであと何メーター", "メドレー", "キミマデアトナンメーター"],
["最強ライバル", "メドレー", "サイキョウライバル"],
["花や、花", "", "ハナヤハナ"],
["Peacock Epoch", "", "ピーコックエポック"],
["SAILING!!!!!", "", "セイリング"],
["RAINBOW", "", "レインボー"],
]);




addSetlist(
  "2021",
  "浦島坂田船 Spring Tour 2021 花（HANA）〜桜花再凛〜", [
["返り咲", "", "カエリザキ"],
["花鳥風月", "", "カチョウフウゲツ"],
["花魁俺嵐コンフュージョン", "", "オイランオレランコンフュージョン"],
["千本桜-guitar rock arrangement ver.-", "", "センボンザクラギターロックアレンジメントバージョン"],
["Peacock Epoch", "", "ピーコックエポック"],
["ホエールホール", "", "ホエールホール"],
["Boohoo", "", "ブーフー"],
["ダークサイドファンタジー", "うらさか", "ダークサイドファンタジー"],
["極楽浄土", "志麻セン", "ゴクラクジョウド"],
["飲めや 歌えや 踊れや 騒げ", "", "ノメヤウタエヤオドレヤサワゲ"],
["スカーレ", "うらたぬき", "スカーレ"],
["ダスティピンク", "志麻", "ダスティピンク"],
["I'm Your Tamer", "となりの坂田。", "アイムユアテイマー"],
["脳内シェイカー", "センラ", "ノウナイシェイカー"],
["SWEET TASTE PRESENT", "", "スイートテイストプレゼント"],
["グッド・バイ", "", "グッドバイ"],
["花吹雪", "", "ハナフブキ"],
["完全燃焼～春祭り～", "", "カンゼンネンショウハルマツリ"],
["花や、花", "", "ハナヤハナ"],
["合戦", "", "カッセン"],
["そらに、ひらり", "", "ソラニヒラリ"],
]);


addSetlist(
  "2021",
  "浦島坂田船 SUMMER TOUR 2021 ～甘い∞(はち)密のような♡(恋)をしない？キミの放課後はボクのモノ♡無限大の♡(LOVE)STARTぉ☆～", [
    /*完成*/
["世界で一番好きな名前", "", "セカイデイチバンスキナナマエ"],
["Save Me", "", "セーブミー"],
["最強Drive!!", "", "サイキョウドライブ"],
["SHOW MUST GO ON!!", "", "ショウマストゴーオン"],
["Dreamer", "", "ドリーマー"],
["Tokyo Deadman's Wonderland", "志麻", "トーキョーデッドマンズワンダーランド"],
["荒波", "となりの坂田。", "アラナミ"],
["Sugary", "センラ", "シュガリー"],
["Colors", "うらたぬき", "カラーズ"],
["青空ピカソ", "志麻セン", "アオゾラピカソ"],
["生涯ライバル", "うらさか", "ショウガイライバル"],
["SWEET TASTE PRESENT", "", "スイートテイストプレゼント"],
["明日へのBye Bye", "", "アシタヘノバイバイ"],
["年に一夜の恋模様", "", "トシニヒトヨノコイモヨウ"],
["シザーナイフ", "", "シザーナイフ"],
["フランマ", "", "フランマ"],
["月夜", "", "ツキヨ"],
["最強ライバル", "日替わり", "サイキョウライバル"],
     ["わいふぁい暴想ボーイ","日替わり","ワイファイボウソウボーイ"],
     ["Boohoo", "日替わり", "ブーフー"],
["Shoutër", "", "シャウター"],
["PIRATES A GO GO", "", "パイレーツアゴーゴー"],
["ワナビークインビー", "", "ワナビークインビー"],
    ["君まであと何メーター", "日替わり", "キミマデアトナンメーター"],
    ["Mermaid", "日替わり", "マーメイド"],
     ["ARK", "日替わり", "アーク"],
    ["Starry Heaven","日替わり","スターリーヘブン"],
["ROULETTE", "千葉公演のみ", "ルーレット"],
["シンデレラステップ", "", "シンデレラステップ"],
["Sailor’s High", "日替わり", "セイラーズハイ"],
    ["Pathfinders", "日替わり", "パスファインダーズ"],
     ["Carry Forward", "", "キャリーフォワード"],
["恋色花火", "", "コイイロハナビ"],
["SAILING!!!!!", "千葉公演のみ", "セイリング"],
    ["プレゼント", "大阪追加公演・千葉公演のみ", "プレゼント"],
    ["ナイトメリーハッピネス","大阪追加公演のみ","ナイトメリーハッピネス"],
]);




addSetlist(
  "2021",
  "Happy Halloweeeen 浦島坂田幽霊船　～本気か！MAGIC！マジカルミラクル！きゅるるるるん☆彡　お菓子くなっちゃう♡もうっ//♡　やメテオー！CHU♡ﾄﾞｰﾝ！～", [
/*完成*/
["Bad Monster", "", "バッドモンスター"],
["HORRORISM", "", "ホラリズム"],
["ヴァンパイア", "", "ヴァンパイア"],
["Happy Halloween", "", "ハッピーハロウィン"],
["ハングリー・ゴースト", "", "ハングリーゴースト"],
["PIRATES A GO GO", "", "パイレーツアゴーゴー"],
["Ring", "", "リング"],
["グリムメイカー", "", "グリムメイカー"],
["ハロウ！ゴーストシップ", "", "ハロウゴーストシップ"],
["SPOOKY MAGICAL NIGHT", "", "スプーキーマジカルナイト"],
["realizer", "", "リアライザー"],
["カモフラ", "", "カモフラ"],
["KING", "", "キング"],
["Beetle Battle", "", "ビートルバトル"],
["キュートなカノジョ", "となりの坂田。", "キュートナカノジョ"],
["ボッカデラベリタ", "うらたぬき", "ボッカデラベリタ"],
["爆笑", "センラ", "バクショウ"],
["Oxygen", "志麻", "オキシジェン"],
["生涯ライバル", "", "ショウガイライバル"],
["青空ピカソ", "", "アオゾラピカソ"],
["フランマ", "", "フランマ"],
["ワナビークインビー", "", "ワナビークインビー"],
["最強Drive!!", "", "サイキョウドライブ"],
["SAILING!!!!!", "", "セイリング"],
]);




addSetlist(
  "2022",
  "浦島坂田船 Spring Tour 2022 ～令和浪漫～", [
        /*完成*/
["燦然賛歌", "", "サンゼンサンカ"],
["グッド・バイ", "", "グッドバイ"],
["吉原ラメント", "", "ヨシワララメント"],
["花魁俺嵐コンフュージョン", "", "オイランオレランコンフュージョン"],
["花鳥風月", "", "カチョウフウゲツ"],
["オルターエゴ", "志麻セン", "オルターエゴ"],
["爆笑", "うらさか", "バクショウ"],
["誠-Live for Justice-", "", "マコトライブフォージャスティス"],
["極楽浄土", "", "ゴクラクジョウド"],
["貴方と云ふ花", "", "アナタトイウハナ"],
["ベビーデーズ", "さかせん", "ベビーデーズ"],
["アニマル", "裏千家", "アニマル"],
["チェック・ナイト", "となりの坂田。", "チェックナイト"],
["Burn it down", "うらしま", "バーンイットダウン"],
["レーヴ", "志麻", "レーヴ"],
["パンペルデュ", "センラ", "パンペルデュ"],
["二息歩行(Reloaded)", "しまさか", "フタイキホコウリローデッド"],
["恋のMAGIC", "うらたぬき", "コイノマジック"],
["シンデレラステップ", "横浜公演のみ", "シンデレラステップ"],
["マジカル・ショコラティエ", "", "マジカルショコラティエ"],
["生涯ライバル", "日替わり", "ショウガイライバル"],
    ["パンダヒーロー", "日替わり", "パンダヒーロー"],
    ["わいふぁい暴想ボーイ","日替わり","ワイファイボウソウボーイ"],
["ワナビークインビー", "横浜公演のみ", "ワナビークインビー"],
["アワ・ダンサー", "", "アワダンサー"],
["realizer", "", "リアライザー"],
["Peacock Epoch", "", "ピーコックエポック"],
["花や、花", "", "ハナヤハナ"],
]);

addSetlist(
  "2022",
  "浦島坂田船 SUMMER TOUR 2022 Toni9ht", [
    /*完成*/
["Piece Piece Piece", "", "ピースピースピース"],
["ポーカーフェイク", "", "ポーカーフェイク"],
["シャララ", "", "シャララ"],
["夜咄ディセイブ", "", "ヨバナシディセイブ"],
["レッドホットクレイジーナイト", "", "レッドホットクレイジーナイト"],
["Starry Cruise", "", "スターリークルーズ"],
["マダ", "うらたぬき", "マダ"],
["ゆめのものまね", "となりの坂田。", "ユメノモノマネ"],
["どっちつかずLOVERS", "うらさか", "ドッチツカズラバーズ"],
["月夜", "", "ツキヨ"],
["ヨニゲーム", "", "ヨニゲーム"],
["ヒドイヒドラ", "", "ヒドイヒドラ"],
["ホエールホール", "", "ホエールホール"],
["十六夜ナイトフィーバー", "志麻", "イザヨイナイトフィーバー"],
["DREAM BABY", "センラ", "ドリームベイビー"],
["Ride The Night", "志麻セン", "ライドザナイト"],
["年に一夜の恋模様", "", "トシニヒトヨノコイモヨウ"],
["流れ星なんていらない", "", "ナガレボシナンテイラナイ"],
["アンコール", "", "アンコール"],
["マジカル・ショコラティエ", "日替わり", "マジカルショコラティエ"],
    ["SWEET TASTE PRESENT", "日替わり", "スイートテイストプレゼント"],
["溺愛", "", "デキアイ"],
["鈍色Wheels", "", "ニビイロホイールズ"],
["僕のシンデレラ", "", "ボクノシンデレラ"],
["本能全開ソレソレソレ!", "", "ホンノウゼンカイソレソレソレ"],
["Shoutër", "", "シャウター"],
["Q for U", "静岡公演のみ", "キューフォーユー"],
    ["SAILING!!!!!", "静岡公演のみ", "セイリング"],
]);

addSetlist(
  "2022",
  "Happy Halloweeeen 浦島坂田幽霊船 Ψ悪魔執事Ψ あなたが飽くまで仕えます♡ワタクシかなり使えます♡ちゃんとしni9htお仕置きデビか～？？？？", [
["ジャックオーランタン", "", "ジャックオーランタン"],
["カモフラ", "", "カモフラ"],
["グリムメイカー", "", "グリムメイカー"],
["SPOOKY MAGICAL NIGHT", "", "スプーキーマジカルナイト"],
["ハングリー・ゴースト", "", "ハングリーゴースト"],
["ワナビークインビー", "", "ワナビークインビー"],
["Boohoo", "", "ブーフー"],
["微笑、香り、君と僕を繋ぐ", "", "ビショウカオリキミトボクヲツナグ"],
["シャララ", "", "シャララ"],
["ゾンビ", "", "ゾンビ"],
["Bad Monster", "", "バッドモンスター"],
["Game Changer", "", "ゲームチェンジャー"],
["本能全開ソレソレソレ!", "", "ホンノウゼンカイソレソレソレ"],
["ファムファタル", "センラ", "ファムファタル"],
["Magi ない♡カリグラフィック", "志麻", "マジナイカリグラフィック"],
["キャットラビング", "となりの坂田。", "キャットラビング"],
["ダーリンダンス", "うらたぬき", "ダーリンダンス"],
["ヒドイヒドラ", "", "ヒドイヒドラ"],
["SWEET TASTE PRESENT", "", "スイートテイストプレゼント"],
["ベノム", "", "ベノム"],
["Save Me", "", "セーブミー"],
["Q for U", "", "キューフォーユー"],
["花吹雪", "", "ハナフブキ"],
["ハロウ!ゴーストシップ", "", "ハロウゴーストシップ"],
["PIRATES A GO GO", "", "パイレーツアゴーゴー"],
["Piece Piece Piece", "", "ピースピースピース"],
]);






addSetlist(
  "2023",
  "浦島坂田船 Spring Tour 2023 彩 -sai-", [
/*完成*/
["絶景", "", "ゼッケイ"],
["燦然賛歌", "", "サンゼンサンカ"],
["フランマ", "", "フランマ"],
["青く塗り替えろ!", "", "アオクヌリカエロ"],
["花魁俺嵐コンフュージョン", "", "オイラオランコンフュージョン"],
["アワダンサー", "", "アワダンサー"],
["合戦", "", "カッセン"],
["共鳴コントラスト", "", "キョウメイコントラスト"],
["ミダリニハルイロ", "", "ミダリニハルイロ"],
["返り咲", "", "カエリザキ"],
["Delicious", "裏千家・日替わり", "デリシャス"],
["RED", "しまさか・日替わり", "レッド"],
["マウントリタガール", "うらしま・日替わり", "マウントリタガール"],
["絶頂賛歌", "さかせん・日替わり", "ゼッチョウサンカ"],
["SWEET", "志麻セン・日替わり", "スイート"],
["百花繚乱デンジャービーツ", "うらさか・日替わり", "ヒャッカリョウランデンジャービーツ"],
["Ring", "", "リング"],
["プレゼント", "", "プレゼント"],
["飲めや、歌えや、踊れや、騒げ", "", "ノメヤウタエヤオドレヤサワゲ"],
["ドラマチックノエル", "", "ドラマチックノエル"],
["10 Carats chocolate", "", "テンカラッツチョコレート"],
["Beatle Battle", "", "ビートルバトル"],
["そらにひらり", "", "ソラニヒラリ"],
["千本桜-guitar rock arrangement ver.-", "", "センボンザクラ"],
["Rainbow", "", "レインボー"],
]);

addSetlist(
  "2023",
  "浦島坂田船 10th Anniversary 〜Memorial Live〜", [
/*完成*/
["Carry Forward","","キャリーフォワード"],
["アイドルっぽい曲を作った。","","アイドルッポイキョクヲツクッタ"],
["Dreamer","","ドリーマー"],
["花鳥風月","","カチョウフウゲツ"],
["海賊船〜心の奪い手〜","","カイゾクセンココロノウバイテ"],
["最強ライバル","","サイキョウライバル"],
["千本桜-guitar rock arrangement ver.-","","センボンザクラギターロックアレンジメントバージョン"],
["Beetle Battle","","ビートルバトル"],
["スーパーヒーロー","となりの坂田。","スーパーヒーロー"],
["シアワセは台本の外から","うらたぬき","シアワセハダイホンノソトカラ"],
["Trip-Trap, Love Trap!!","うらさか","トリップトラップラブラップ"],
["脳内シェイカー","センラ","ノウナイシェイカー"],
["CRAZY BUNNY!!","志麻","クレイジーバニー"],
["#嘲笑ポラロイド","志麻セン","チョウショウポラロイド"],
["花吹雪","","ハナフブキ"],
["ARK","","アーク"],
["Sailor’s High","","セイラーズハイ"],
["わいふぁい暴想ボーイ","","ワイファイボウソウボーイ"],
["Pathfinders","メドレー","パスファインダーズ"],
["ポーカーフェイク","メドレー","ポーカーフェイク"],
["ハロウ！ゴーストシップ","メドレー","ハロウゴーストシップ"],
["花魁俺嵐コンフュージョン","メドレー","オイランオレランコンフュージョン"],
["明日へのByeBye","メドレー","アシタヘノバイバイ"],
["Snow melody","メドレー","スノーメロディー"],
["世界で一番好きな名前","メドレー","セカイデイチバンスキナナマエ"],
["Fire◎Flower","メドレー","ファイアフラワー"],
["年に一夜の恋模様","メドレー","トシニヒトヨノコイモヨウ"],
["SHOW MUST GO ON!!","メドレー","ショウマストゴーオン"],
["そらに、ひらり","","ソラニヒラリ"],
["花や、花","","ハナヤハナ"],
["恋色花火","","コイイロハナビ"],
["君まであと何メーター","","キミマデアトナンメーター"],
["Mermaid","","マーメイド"],
["Shoutër","","シャウター"],
["Peacock Epoch","","ピーコックエポック"],
["SAILING!!!!!","","セイリング"],
]);






addSetlist(
  "2023",
  "浦島坂田船 SUMMER TOUR 2023 Plusss", [
/*完成*/
["＋","","プラス"],
["Q for U","日替わり","キューフォーユー"],
["SWEET TASTE PRESENT","日替わり","スイートテイストプレゼント"],
["世界で一番好きな名前","","セカイデイチバンスキナナマエ"],
["千本桜-guitar rock arrangement ver.-","日替わり","センボンザクラギターロックアレンジメントバージョン"],
["絶景","日替わり","ゼッケイ"],
["SHINY","日替わり","シャイニー"],
["realizer","日替わり","リアライザー"],
["明日へのBye Bye","","アシタヘノバイバイ"],
["シャドウ","","シャドウ"],
["シンデレラステップ","日替わり","シンデレラステップ"],
["獣王無尽","","ジュウオウムジン"],
["不可逆性シンクロニシティ","うらたぬき","フカギャクセイシンクロニシティ"],
["I think","センラ","アイシンク"],
["cigar≠kiss","志麻","シガーキス"],
["共鳴Tune!","となりの坂田。","キョウメイチューン"],
["We can fly away, NEW SKY!","うらさか","ウィーキャンフライアウェイニュースカイ"],
["bloom","志麻セン","ブルーム"],
["Peacock Epoch","","ピーコックエポック"],
["Crossroads","","クロスローズ"],
["シャララ","","シャララ"],
["生き証人","","イキショウニン"],
["アイドル","","アイドル"],
["Piece Piece Piece","","ピースピースピース"],
["SUNNY","","サニー"],
["最強Drive!!","","サイキョウドライブ"],
["Carry Forward","","キャリーフォワード"],
["VOYAGE","","ボヤージュ"],
["Shoutër","","シャウター"],
["LoveLoveLove","","ラブラブラブエル"],
["ヘウレーカ","静岡のみ","ヘウレーカ"],
]);



addSetlist(
  "2023",
  "Happy Halloweeeen 浦島坂田幽霊船　～キャッ！とめられないの!?いたずらしニャイで♡でもご主人タマがすこすこすこてぃっしゅHOLD♡～", [
/*完成*/
["おーるでい・おーるにゃいと","","オールデイオールニャイト"],
["カモフラ","","カモフラ"],
["ハングリー・ゴースト","","ハングリーゴースト"],
["カレンダーリマインダー","","カレンダーリマインダー"],
["シンプルLOVE","","シンプルラブ"],
["プレゼント","","プレゼント"],
["獣王無尽","","ジュウオウムジン"],
["すーぱーぬこになりたい","","スーパーヌコニナリタイ"],
["マジカル・ショコラティエ","","マジカルショコラティエ"],
["可愛くてごめん","","カワイクテゴメン"],
["わいふぁい暴想ボーイ","","ワイファイボウソウボーイ"],
["ジャックオーランタン","","ジャックオーランタン"],
["うらたねこ♀","うらたぬき","ウラタネコ"],
["回る空うさぎ","となりの坂田。","マワルソラウサギ"],
["NIGHT SCREAMER","センラ","ナイトスクリーマー"],
["イエスタデイはトゥモローを歌わない","志麻","イエスタデイハトゥモローヲウタワナイ"],
["Beetle Battle","","ビートルバトル"],
["百花繚乱デンジャービーツ","","ヒャッカリョウランデンジャービーツ"],
["SWEET","","スウィート"],
["PIRATES A GO GO","","パイレーツアゴーゴー"],
["生き証人","","イキショウニン"],
["本能全開ソレソレソレ!","","ホンノウゼンカイソレソレソレ"],
["ハロウ！ゴーストシップ","","ハロウゴーストシップ"],
["ナイトメリーハッピネス","","ナイトメリーハッピネス"],
["ヘウレーカ","","ヘウレーカ"],
]);


addSetlist(
  "2024",
  "USSS SOLO FESTIVAL 2024 -ソロフェス-", [
/*未完成*/

["たぬきのぽんぽこ祭り", "うらたぬき", "タヌキノポンポコマツリ"],
["ハイヒールプリンセス", "うらたぬき", "ハイヒールプリンセス"],
["恋のMAGIC", "うらたぬき", "コイノマジック"],
["全愛不問コスモナニカ", "うらたぬき", "ゼンアイフモンコスモナニカ"],
["愚かなオルカ", "うらたぬき", "オロカナオルカ"],
["セクトの誅罰", "うらたぬき", "セクトノチュウバツ"],
["pink", "うらたぬき", "ピンク"],
["ダンスロボットダンス", "うらたぬき", "ダンスロボットダンス"],
["テオ", "うらたぬき", "テオ"],

["リビングハート", "となりの坂田。", "リビングハート"],
["共鳴 Tune", "となりの坂田。", "キョウメイチューン"],
["迷図", "となりの坂田。", "メイズ"],
["ラヴィ", "となりの坂田。", "ラヴィ"],
["スーパーヒーロー", "となりの坂田。", "スーパーヒーロー"],
["無駄‡無駄", "となりの坂田。", "ムダムダ"],
["未完成ユートピア", "となりの坂田。", "ミカンセイユートピア"],
["ゆめのものまね", "となりの坂田。", "ユメノモノマネ"],

["Freja", "センラ", "フレイヤ"],
["sweet magic", "センラ", "スイートマジック"],
["スパイラル", "センラ", "スパイラル"],
["色恋", "センラ", "イロコイ"],
["スペシャルパフェ", "センラ", "スペシャルパフェ"],
["脳内シェイカー", "センラ", "ノウナイシェイカー"],
["ホシアイ", "センラ", "ホシアイ"],
["Make a pass", "センラ", "メイクアパス"],

["イエスタディはトゥモローを歌わない", "志麻", "イェスタディハトゥモローヲウタワナイ"],
["violet thunder", "志麻", "バイオレットサンダー"],
["Oxygen", "志麻", "オキシジェン"],
["ダスティピンク", "志麻", "ダスティピンク"],
["ロストワンの号哭", "志麻", "ロストワンノゴウコク"],
["敗北の少年", "志麻", "ハイボクノショウネン"],
["Magiない♥カリグラフィック", "志麻", "マギナイカリグラフィック"],
["CRAZY BUNNY!!", "志麻", "クレイジーバニー"],

["Peacock epoch", "", "ピーコックエポック"],
["おーるでい・おーるにゃいと", "", "オールデイオールニャイト"],
["snow melody", "", "スノーメロディ"],
["フレンドシップ", "", "フレンドシップ"],
["太陽系デスコ", "", "タイヨウケイデスコ"],
["SAILING!!!!!", "", "セーリング"],
]);




addSetlist(
  "2024",
  "浦島坂田船 Spring Tour 2024 -四春祭-", [
/* 完成 */
["SAKURA FUBUKI","","サクラフブキ"],
["ミダリニハルイロ","","ミダリニハルイロ"],
["貴方と云ふ花","","アナタトイウハナ"],
["恋色花火","","コイイロハナビ"],
["グッド・バイ","","グッドバイ"],
["花魁俺嵐コンフュージョン","","オイランオレランコンフュージョン"],
["アワ・ダンサー","","アワダンサー"],
["SHININ'DAYS","志麻セン・日替わり","シャイニングデイズ"],
["Happy tap people","うらさか・日替わり","ハッピータップピーポー"],
["チュルリラ・チュルリラ・ダッダッダ！","うらしま・日替わり","チュルリラチュルリラダッダッダ"],
["マンティス▽クライシス","さかせん・日替わり","マンティスクライシス"],
["大喝采","裏千家・日替わり","ダイカッサイ"],
["My Sweet Prisoner","しまさか・日替わり","マイスウィートプリズナー"],
["祭唄","","マツリウタ"],
["鈍色Wheels","","ニビイロホイールズ"],
["シャドウ","","シャドウ"],
["だれかの心臓になれたなら","うらたぬき・日替わり","ダレカノシンゾウニナレタナラ"],
["ロスタイムメモリー","となりの坂田。・日替わり","ロスタイムメモリー"],
["さよならメモリーズ","センラ・日替わり","サヨナラメモリーズ"],
["バレリーコ","志麻・日替わり","バレリーコ"],
["人生リセットボタン","うらたぬき・日替わり","ジンセイリセットボタン"],
["世界寿命と最後の一日","となりの坂田。・日替わり","セカイジュミョウトサイゴノイチニチ"],
["朧月","センラ・日替わり","オボロヅキ"],
["ゴーストルール","志麻・日替わり","ゴーストルール"],
["Bling-Bang-Bang-Born","","ブリンバンバンボーン"],
["ゼンシンゼンレイ好きさ","","ゼンシンゼンレイスキサ"],
["花鳥風月","","カチョウフウゲツ"],
["Pathfinders","","パスファインダーズ"],
["花吹雪","","ハナフブキ"],
["完全燃焼～春祭り～","","カンゼンネンショウハルマツリ"],
["合戦","","カッセン"],
["絶景","","ゼッケイ"],
["花や、花","東京公演のみ","ハナヤハナ"],
]);


addSetlist(
  "2024",
  "浦島坂田船 SUMMER TOUR 2024 Weddiing", [
/* 完成 */
["アダマントリング","","アダマントリング"],
["アイドルっぽい曲を作った。","","アイドルッポイキョクヲツクッタ"],
["僕のシンデレラ","","ボクノシンデレラ"],
["世界で一番好きな名前","","セカイデイチバンスキナナマエ"],
["SHOW MUST GO ON!!","","ショウマストゴーオン"],
["Save Me","","セーブミー"],
["ホワイトプリンス","","ホワイトプリンス"],
["Mermaid","日替わり","マーメイド"],
["君まであと何メーター","日替わり","キミマデアトナンメーター"],
["フレテ","","フレテ"],
["シックスセンス・ベル","","シックスセンスベル"],
["幸せのレシピ","","シアワセノレシピ"],
["メリメリ","うらたぬき","メリメリ"],
["マグネティック","となりの坂田。","マグネティック"],
["妄想注意報","うらさか","モウソウチュウイホウ"],
["Killer Killer My Love","志麻","キラーキラーマイラブ"],
["FlashBack","センラ","フラッシュバック"],
["Treat You Better","志麻セン","トリートユーベター"],
["シャララ","","シャララ"],
["むしろ Why?","","ムシロホワイ"],
["生き証人","日替わり","イキショウニン"],
["レッドホットクレイジーナイト","日替わり","レッドホットクレイジーナイト"],
["フレンドシップ","","フレンドシップ"],
["＋","","プラス"],
["ハイサイ守護礼","","ハイサイシュゴレイ"],
["ヘウレーカ","日替わり","ヘウレーカ"],
["SAILING!!!!! ","日替わり","セイリング"],
["祭り唄","愛知１日目のみ","マツリウタ"],
["明日へのBye Bye","愛知２日目のみ","アシタヘノバイバイ"],
]);


addSetlist(
  "2024",
  "Happy Halloweeeen 浦島坂田幽霊船 さぁ手をとってshall we dance? 舞踏会はもう明日！？まだはえーよ！マスカレード！ぬっはー！仮面の下はｶﾒｪﾝｸﾞｽｩﾝ ｽｩﾝ…ｽｩﾝ…ｽｩﾝ…", [
/* 完成 */
["アイシナヨ","","アイシナヨ"],
["溺愛","日替わり","デキアイ"],
["フランマ","日替わり","フランマ"],
["シャドウ","日替わり","シャドウ"],
["微笑、香り、君と僕を繋ぐ","","ビショウカオリキミトボクヲツナグ"],
["Boohoo","","ブーフー"],
["月夜","","ツキヨ"],
["ヒドイヒドラ","日替わり","ヒドイヒドラ"],
["ワナビークインビー","日替わり","ワナビークインビー"],
["Peacock Epoch","日替わり","ピーコックエポック"],
["Beetle Battle","","ビートルバトル"],
["Secret Answer","","シークレットアンサー"],
["GENTLEMEN'S NIGHT","","ジェントルメンズナイト"],
["グリムメイカー","","グリムメイカー"],
["No.17","志麻","ナンバーセブンティーン"],
["イイナリレーション","うらたぬき","イイナリレーション"],
["独断","となりの坂田。","ドクダン"],
["スペシャルパフェ","センラ","スペシャルパフェ"],
["ワガママOnly Mine","","ワガママオンリーマイン"],
["ハングリー・ゴースト","","ハングリーゴースト"],
["花魁俺嵐コンフュージョン","日替わり","オイランオレランコンフュージョン"],
["PIRATES A GOGO","日替わり","パイレーツアゴーゴー"],
["むしろWhy?","日替わり","ムシロホワイ"],
["ポーカーフェイク","日替わり","ポーカーフェイク"],
["明日へのBye Bye","日替わり","アシタヘノバイバイ"],
["獣王無尽","日替わり","ジュウオウムジン"],
["SPOOKY MAGICAL NIGHT","","スプーキーマジカルナイト"],
["パイレーツオブ宇宙！","","パイレーツオブウチュウ"],
["獣王無尽","","ジュウオウムジン"],
["ハロウ！ゴーストシップ","","ハロウゴーストシップ"],
["おーるでい・おーるにゃいと","","オールデイオールニャイト"],
["シックスセンス・ベル","","シックスセンスベル"],
["Piece Piece Piece","","ピースピースピース"],
["アダマントリング","東京３日目のみ","アダマントリング"],
]);


addSetlist(
 "2024",
 "浦島坂田船の大忘年会", [
/* 完成 */
   ["Snow melody","","スノーメロディー"],
["SWEET TASTE PRESENT","","スイートテイストプレゼント"],
["カレンダーリマインダー", "", "カレンダーリマインダー"],
   ["ワガママOnly Mine","","ワガママオンリーマイン"],
   ["Shoutër", "日替わり", "シャウター"],
["Starry Cruise", "日替わり", "スターリークルーズ"],
   ["Dreamer","日替わり","ドリーマー"],
   ["アダマントリング","日替わり","アダマントリング"],
   ["Rainbow", "日替わり", "レインボー"],
    ["Carry Forward", "日替わり", "キャリーフォワード"],
   ["Sailor’s High","日替わり","セイラーズハイ"],
["Pathfinders","日替わり","パスファインダーズ"],
["スーパーヒーロー","うらしまさか。","スーパーヒーロー"],
["シアワセは台本の外から","しまさかせん","シアワセハダイホンノソトカラ"],
   ["脳内シェイカー","うらしまさか","ノウナイシェイカー"],
["CRAZY BUNNY!!","うらさかせん","クレイジーバニー"],
]);




addSetlist(
  "2025",
  "浦島坂田船～歌ってみた祭り！～", [
/*完成*/
["太陽系デスコ", "", "タイヨウケイデスコ"],
["ロミオシンデレラ", "うらたぬき", "ロミオシンデレラ"],
["magnet", "しまさか", "マグネット"],
["エンヴィーキャットウォーク", "センラ・日替わり", "エンヴィーキャットウォーク"],
["林檎売りの泡沫少女", "となりの坂田。・日替わり", "リンゴウリノウタカタショウジョ"],
["独りんぼエンヴィー", "志麻", "ヒトリンボエンヴィー"],
["アイのシナリオ", "", "アイノシナリオ"],
["ベノム", "", "ベノム"],
["Calc.", "日替わり", "カルク"],
["サリシノハラ", "となりの坂田。", "サリシノハラ"],
["心做し", "うらたぬき・日替わり", "ココロナシ"],
["夕立のりぼん", "センラ", "ユウダチノリボン"],
["命に嫌われている。", "志麻・日替わり", "イノチニキラワレテイル"],
["ウミユリ海底譚", "さかせん", "ウミユリカイテイタン"],
["天ノ弱", "うらしま", "アマノジャク"],
["メルト", "日替わり", "メルト"],
["チャンカパーナ", "", "チャンカパーナ"],
["シャルル", "志麻", "シャルル"],
["恋愛裁判", "センラ", "レンアイサイバン"],
["SNOBBISM", "となりの坂田。", "スノビズム"],
["ローリンガール", "うらたぬき", "ローリンガール"],
["リンカーネイション", "裏千家", "リンカーネイション"],
["極楽浄土", "志麻セン", "ゴクラクジョウド"],
["脳漿炸裂ガール", "うらさか", "ノウショウサクレツガール"],
["ヤキモチの答え", "日替わり", "ヤキモチノコタエ"],
["厨病激発ボーイ", "", "チュウビョウゲキハツボーイ"],
["Fire◎Flower", "日替わり", "ファイアーフラワー"],
["Blessing", "", "ブレッシング"],
["しわ", "日替わり", "シワ"],
["Just Be Friends - piano.ver -", "となりの坂田。・日替わり", "ジャストビー フレンズ ピアノバージョン"],
["ピエロ", "うらたぬき・日替わり", "ピエロ"],
["初めての恋が終わる時", "センラ・日替わり", "ハジメテノコイガオワルトキ"],
["ロキ", "日替わり", "ロキ"],
["HEAVEN", "志麻・日替わり", "ヘブン"],
["地球最後の告白を", "日替わり", "チキュウサイゴノコクハクヲ"],
["カゲロウデイズ", "日替わり", "カゲロウデイズ"],
]);


addSetlist(
  "2025",
  "浦島坂田船 Spring TOUR 2025 月", [
/* 完成 */
["月華","","ユエファ"],
["花鳥風月","","カチョウフウゲツ"],
["百花繚乱","","ヒャッカリョウラン"],
["花吹雪","日替わり","ハナフブキ"],
["絶景","日替わり","ゼッケイ"],
["アワ・ダンサー","日替わり","アワダンサー"],
["返り咲","日替わり","カエリザキ"],
["花や、花","","ハナヤハナ"],
["月夜","","ツキヨ"],
["年に一夜の恋模様","","トシニヒトヨノコイモヨウ"],
["Starry Heaven","","スターリーヘブン"],
["祭唄","","マツリウタ"],
["十五夜オツキサマ","うらたぬき・日替わり","ジュウゴヤオツキサマ"],
["さよならグッバイ","志麻・日替わり","サヨナラグッバイ"],
["Pudding","センラ・日替わり","プディング"],
["無駄≠無駄","となりの坂田。・日替わり","ムダムダ"],
["ド屑","うらたぬき・日替わり","ドクズ"],
["イエスタデイはトゥモローを歌わない","志麻・日替わり","イエスタデイハトゥモローヲウタワナイ"],
["曼珠沙華","センラ・日替わり","マンジュシャゲ"],
["I'm Your Tamer","となりの坂田。・日替わり","アイムユアテイマー"],
["たぬきのぽんぽこ祭り","うらたぬき・日替わり","タヌキノポンポコマツリ"],
["十六夜ナイトフィーバー","志麻・日替わり","イザヨイナイトフィーバー"],
["さよならウィステリア","センラ・日替わり","サヨナラウィステリア"],
["記憶の水槽","となりの坂田。・日替わり","キオクノスイソウ"],
["透明","センラ・日替わり","トウメイ"],
["インビジブル","裏千家・日替わり","インビジブル"],
["ダンサブリミア","しまさか・日替わり","ダンサブリミア"],
["モエチャッカファイア","うらしま・日替わり","モエチャッカファイア"],
["ビビデバ","さかせん・日替わり","ビビデバ"],
["百花繚乱デンジャービーツ","うらさか・日替わり","ヒャッカリョウランデンジャービーツ"],
["ギャラクシー","志麻セン・日替わり","ギャラクシー"],
["ハッピーエンドは笑うように","","ハッピーエンドハワラウヨウニ"],
["超毒的LOVE","","チョウドクテキラブ"],
["Recipe","","レシピ"],
["4 REAL IN ACTION!!!!","日替わり","フォーリアルインアクション"],
["合戦","日替わり","カッセン"],
["花魁俺嵐コンフュージョン","日替わり","オイランオレランコンフュージョン"],
["わいふぁい暴想ボーイ","日替わり","ワイファイボウソウボーイ"],
["わたしの一番かわいいところ","","ワタシノイチバンカワイイトコロ"],
["そらに、ひらり","","ソラニヒラリ"],
["アイシナヨ","日替わり","アイシナヨ"],
["ワガママOnly Mine","日替わり","ワガママオンリーマイン"],
["いーあるふぁんくらぶ","日替わり","イーアルファンクラブ"],
["熱々ワッショイダンス","","アツアツワッショイダンス"],
["ハイサイ守護礼","沖縄公演のみ","ハイサイシュゴレイ"],
]);


addSetlist(
  "2025",
  "浦島坂田船 SUMMER TOUR 2025 WARN12G", [
/* 完成 */
["MINE MINE","","マインマイン"],
["YELLOW FINEST","","イエローファイネスト"],
["GENTLEMEN’S NIGHT","日替わり","ジェントルメンズナイト"],
["ワナビークインビー","日替わり","ワナビークインビー"],
["ヒバナ","日替わり","ヒバナ"],
["拝啓ドッペルゲンガー","日替わり","ハイケイドッペルゲンガー"],
["Beetle Battle","","ビートルバトル"],
["Trashy","","トラシー"],
["シャララ","日替わり","シャララ"],
["レッドホットクレイジーナイト","日替わり","レッドホットクレイジーナイト"],
["アンコール","","アンコール"],
["宵座興","","ヨイザキョウ"],
["祝辞","となりの坂田。","シュクジ"],
["Secret KISS","センラ","シークレットキス"],
["大人A-S-O-V","うらさか","オトナアソブ"],
["獣王無尽","","ジュウオウムジン"],
["U.S.S.S HOLIC","","ユーエスエスエスホリック"],
["鈍色Wheels","","ニビイロホイールズ"],
["言霊","志麻","コトダマ"],
["P!P!P!P!","うらたぬき","ピーピーピーピー"],
["Rat-a-tat","志麻セン","ラッタッタ"],
["被害妄想携帯女子（笑）","","ヒガイモウソウケイタイジョシ"],
["You miss me, I know!","","ユーミスミーアイノウ"],
["Fortune!!","日替わり","フォーチュン"],
["最強Drive!!","日替わり","サイキョウドライブ"],
["シンプルLOVE","","シンプルラブ"],
["Happiness","","ハピネス"],
["Peacock Epoch","東京２日目","ピーコックエポック"],
["ハッピーエンドは笑うように","日替わり","ハッピーエンドハワラウヨウニ"],
["ホワイトプリンス","日替わり","ホワイトプリンス"],
["あざといんふるえんさー","","アザトインフルエンサー"],
["I’m home again","","アイムホームアゲイン"],
["月華","","ゲッカ"],
["恋色花火","","コイイロハナビ"],
["Shoutër","福岡２日目","シャウター"],
]);



addSetlist(
  "2025",
  "Happy Halloweeeen 浦島坂田幽霊船 ～え！？くぅｯｯ///そっ♡(腰に手をぽふっ)shh...STRONG...俺の弾丸をﾊﾞｷｭうーﾝ♡ﾎｯ､もう地獄はサッタンDEATHね～", [
/*完成*/
["KISS THE BULLET","","キスザバレット"],
["HORRORISM","","ホラリズム"],
["Bad Monster","","バッドモンスター"],
["駆け上がるボルテージ","","カケアガルボルテージ"],
["グリムメイカー","","グリムメイカー"],
["ストリーミングハート","日替わり","ストリーミングハート"],
["ゴーストルール","日替わり","ゴーストルール"],
["シックスセンス・ベル","","シックスセンスベル"],
["悪魔の踊り方","","アクマノオドリカタ"],
["Exorcise","","エクソサイズ"],
["最強ライバル","日替わり","サイキョウライバル"],
["ARK","日替わり","アーク"],
["おーるでい・おーるにゃいと","","オールデイオールニャイト"],
["秘密リミッター","センラ・日替わり","ヒミツリミッター"],
["モニタリング","志麻・日替わり","モニタリング"],
["サディー","うらたぬき・日替わり","サディー"],
["絶え間なく藍色","となりの坂田。・日替わり","タエマナクアイイロ"],
["Lie or Truth","センラ・日替わり","ライオアトゥルース"],
["DA DA DICE","志麻・日替わり","ダダダイス"],
["プロポーズ","うらたぬき・日替わり","プロポーズ"],
["MASK","となりの坂田。・日替わり","マスク"],
["MINE MINE","","マインマイン"],
["君色々移り -トリビュートver.-","","キミイロイロウツリトリビュートバージョン"],
["ばく","","バク"],
["シンデレラステップ","日替わり","シンデレラステップ"],
["明日へのByeBye","日替わり","アシタヘノバイバイ"],
["Q for U","","キューフォーユー"],
["フライングゲット","","フライングゲット"],
["ハロウ！ゴーストシップ","","ハロウゴーストシップ"],
["今日から俺たちゴーストバスターズ","","キョウカラオレタチゴーストバスターズ"],
["ドラマティックノエル","東京２日目","ドラマティックノエル"],
["フレテ","","フレテ"],
]);




addSetlist(
  "2026",
  "浦島坂田船 Spring Tour 2026 ～夜叉～", [
/*完成*/
["輪々春廻", "", "リンリンシュンカイ"],
["返り咲", "", "カエリザキ"],
["Trashy", "", "トラシー"],
["吉原ラメント", "", "ヨシワララメント"],
["天樂 -guitar rock arrangement ver-", "日替わり", "テンガクギターロックアレンジメントバージョン"],
["シザーナイフ", "日替わり", "シザーナイフ"],
["宵", "", "ヨイ"],
["Ring", "", "リング"],
["KISS THE BULLET", "", "キスザバレット"],
["花魁俺嵐コンフュージョン", "", "オイランオレランコンフュージョン"],
["薄紅", "", "ウスベニ"],
["ダブルフェイス", "", "ダブルフェイス"],
["金曜日のおはよう", "", "キンヨウビノオハヨウ"],
["好き！雪！本気マジック", "", "スキユキホンキマジック"],
["恋々遊々", "志麻・日替わり", "レンレンユウユウ"],
["カメリア・コンプレックス", "志麻・日替わり", "カメリアコンプレックス"],
["おどりゃんせ", "うらさか・日替わり", "オドリャンセ"],
["夢中Chu☆パンダ", "うらたぬき・日替わり", "ムチュウチュウパンダ"],
["このふざけた素晴らしき世界は、僕の為にある", "うらたぬき・日替わり", "コノフザケタスバラシキセカイハボクノタメニアル"],
["ねぇ、どろどろさん", "となりの坂田。・日替わり", "ネェドロドロサン"],
["ニビイロドロウレ", "となりの坂田。・日替わり", "ニビイロドロウレ"],
["アリアドネ", "センラ・日替わり", "アリアドネ"],
["愛して？ ～love me do～", "センラ・日替わり", "アイシテラブミードゥー"],
["リコレクションエンドロウル", "裏千家・日替わり", "リコレクションエンドロウル"],
["ガチ恋者達に捧ぐバラッド〜キミが笑えば地球も回る〜", "しまさか・日替わり", "ガチコイシャタチニササグバラッドキミガワラエバチキュウモマワル"],
["テオ", "うらしま・日替わり", "テオ"],
["ジェヘナ（Gehenna）", "さかせん・日替わり", "ジェヘナ"],
["右肩の蝶", "志麻セン・日替わり", "ミギカタノチョウ"],
["SHOW MUST GO ON!!", "日替わり", "ショウマストゴーオン"],
["SHINY", "日替わり", "シャイニー"],
["ミダリニハルイロ", "", "ミダリニハルイロ"],
["アワダンサー", "日替わり", "アワダンサー"],
["ポーカーフェイク", "日替わり", "ポーカーフェイク"],
["truth", "", "トゥルース"],
["ラメグラデーション", "", "ラメグラデーション"],
["花や、花", "日替わり", "ハナヤハナ"],
["絶景", "日替わり", "ゼッケイ"],
["Shoutër", "日替わり", "シャウター"],
["Pathfinders", "日替わり", "パスファインダーズ"],
["TENTH", "東京公演のみ", "テンス"],
["ばく", "東京公演のみ", "バク"],
["Mermaid", "東京公演のみ", "マーメイド"],
]);







/* ===== 正規化 ===== */
function normalize(str) {
  return (str || "")
    .toLowerCase()
    .replace(/[ぁ-ん]/g, s =>
      String.fromCharCode(s.charCodeAt(0) + 0x60)
    )
    .replace(/ー/g, "")
    .replace(/\s+/g, "");
}

/* ===== 初期化 ===== */
window.addEventListener("DOMContentLoaded", () => {

  const searchBox =
    document.getElementById("searchBox");
  const suggest =
    document.getElementById("suggest");
  const result =
    document.getElementById("result");
  const searchBtn =
    document.getElementById("searchBtn");

  let selectedIndex = -1;

  /* ===== 検索処理 ===== */
  function searchSong() {
    const keyword =
      searchBox.value.trim();

   const key = normalize(keyword);

result.innerHTML = "";

/* 空欄対策 */
if (!key) {
  result.innerHTML =
    "<li>見つかりませんでした</li>";
  return;
}

    const filtered =
      data.filter(item =>
        normalize(item.song) === key ||
        normalize(item.alias)
          .includes(key)
      );

    if (filtered.length === 0) {
      result.innerHTML =
        "<li>見つかりませんでした</li>";
      return;
    }

const grouped = {};

/* 年ごと分類 */
filtered.forEach(item => {

  const year =
    item.year || "その他";

  const liveText =
    item.note
      ? `${item.live}（${item.note}）`
      : item.live;

  if (!grouped[year]) {
    grouped[year] = new Set();
  }

  grouped[year].add(liveText);
});

/* 表示 */
Object.keys(grouped)
  .sort()
  .forEach(year => {

    // 年見出し
    const yearLi =
      document.createElement("li");

    yearLi.className =
      "year-title";

    yearLi.textContent =
      `[${year}]`;

    result.appendChild(yearLi);

    // ライブ一覧
    grouped[year]
      .forEach(live => {

        const liveLi =
          document.createElement("li");

        liveLi.className =
          "live-item";

        liveLi.textContent =
          live;

        result.appendChild(liveLi);
      });
  });

  }

  /* ===== サジェスト ===== */
  searchBox.addEventListener(
    "input",
    () => {

      const keyNorm =
        normalize(
          searchBox.value.trim()
        );

      suggest.innerHTML = "";
      selectedIndex = -1;

      if (!keyNorm) return;

      const matches = [];

      data.forEach(item => {
        if (
          normalize(item.song)
            .includes(keyNorm) ||
          normalize(item.alias)
            .includes(keyNorm)
        ) {
          matches.push(item.song);
        }
      });

      const uniqueMatches =
        [...new Set(matches)]
          .slice(0, 10);

      uniqueMatches.forEach(song => {

        const li =
          document.createElement("li");

        li.textContent = song;

        li.onclick = () => {
          searchBox.value = song;
          suggest.innerHTML = "";
          searchSong();
        };

        suggest.appendChild(li);
      });
    }
  );

  /* ===== 選択状態 ===== */
  function updateSelection(items) {

    items.forEach(item => {
      item.classList.remove(
        "selected"
      );
    });

    if (items[selectedIndex]) {

      items[selectedIndex]
        .classList.add(
          "selected"
        );

      items[selectedIndex]
        .scrollIntoView({
          block: "nearest"
        });
    }
  }

  /* ===== キーボード ===== */
  searchBox.addEventListener(
    "keydown",
    (e) => {

      const items =
        suggest.querySelectorAll(
          "li"
        );

      // ↓
      if (
        e.key === "ArrowDown"
      ) {

        e.preventDefault();

        if (
          items.length === 0
        ) return;

        selectedIndex =
          selectedIndex <
          items.length - 1
            ? selectedIndex + 1
            : 0;

        updateSelection(items);
      }

      // ↑
      else if (
        e.key === "ArrowUp"
      ) {

        e.preventDefault();

        if (
          items.length === 0
        ) return;

        selectedIndex =
          selectedIndex > 0
            ? selectedIndex - 1
            : items.length - 1;

        updateSelection(items);
      }

      // Enter
      else if (
        e.key === "Enter"
      ) {

        e.preventDefault();

        if (
          selectedIndex >= 0 &&
          items[selectedIndex]
        ) {
          searchBox.value =
            items[
              selectedIndex
            ].textContent;
        }

        suggest.innerHTML = "";
        searchSong();
      }
    }
  );


  /* ===== ボタン ===== */
  searchBtn.addEventListener(
    "click",
    searchSong
  );

});
