addLiveTour(
  "浦島坂田船",
  "2015",
  "浦島坂田船ライブツアー -Listen to my voice-",
  [
{
  date: "8月1日",
  place: "東京・TSUTAYA O-WEST",
  songs: [

  ]
},
{
  date: "8月9日",
  place: "大阪・BIGCAT",
  songs: [

  ]
},
{
  date: "9月12日",
  place: "名古屋・CLUB QUATTRO",
  songs: [

  ]
},
{
  date: "9月21日",
  place: "東京・TSUTAYA O-EAST",
  songs: [

  ]
    }
  ]
);

addLiveTour(
  "浦島坂田船",
  "2016",
  "浦島坂田船 SUMMER TOUR 2016 -CRUISE PARTY-",
  [
{
  date: "7月3日",
  place: "大阪・Zepp Namba",
  songs: [

  ]
},
{
  date: "7月10日",
  place: "東京・TSUTAYA O-EAST",
  songs: [

  ]
},
{
  date: "7月30日",
  place: "愛知・Zepp Nagoya",
  songs: [

  ]
    }
  ]
);

addLiveTour(
  "浦島坂田船",
  "2016",
  "浦島坂田船 SUMMER TOUR 2016 -CRUISE LIVE-",
  [
{
  date: "7月31日",
  place: "岡山・CRAZYMAMA KINGDOM",
  songs: [

  ]
},
{
  date: "8月20日",
  place: "新潟・LOTS",
  songs: [

  ]
},
{
  date: "8月21日",
  place: "宮城・チームスマイル・仙台PIT",
  songs: [

  ]
},
{
  date: "8月27日",
  place: "京都・KYOTO MUSE",
  songs: [

  ]
},
{
  date: "8月28日",
  place: "福岡・BEAT STATION",
  songs: [

  ]
},
{
  date: "9月3日",
  place: "静岡・SOUND SHOWER ark",
  songs: [

  ]
},
{
  date: "9月17日",
  place: "東京・ディファ有明",
  songs: [
["Pathfinders", "", "パスファインダーズ"],
["アイドルっぽい曲を作った。", "", "アイドルッポイキョクヲツクッタ"],
["Dreamer", "", "ドリーマー"],
["最強ライバル", "", "サイキョウライバル"],
["Mermaid", "", "マーメイド"],
["しわ", "", "シワ"],
["notebook love", "志麻", "ノートブックラブ"],
["色恋", "センラ", "イロコイ"],
["曇天", "志麻セン", "ドンテン"],
["スーパーヒーロー", "となりの坂田。", "スーパーヒーロー"],
["バレリーコ", "うらさか", "バレリーコ"],
["シアワセは台本の外から", "", "シアワセハダイホンノソトカラ"],
["虎視眈々", "", "コシタンタン"],
["海賊船～心の奪い手～", "", "カイゾクセンココロノウバイテ"],
["千本桜", "", "センボンザクラ"],
["ポワゾンKISS", "", "ポワゾンキス"],
["Blessing", "", "ブレッシング"],
["Fire◎Flower", "", "ファイアーフラワー"],
["I'm Home Again", "", "アイムホームアゲイン"],
["Calc.", "†Darkness phantom chains†", "カルク"],
["恋色花火", "", "コイイロハナビ"],
["Shoutër", "", "シャウター"],
  
  ]
    }
  ]
);

addLiveTour(
  "浦島坂田船",
  "2016",
  "浦島坂田船　台湾公演",
  [
{
  date: "11月19日",
  place: "台湾・花漾Hana展演空間",
  songs: [

  ]
    }
  ]
);

addLiveTour(
  "浦島坂田船",
  "2017",
  "浦島坂田船 SPRING TOUR 2017 -春の宴-",
  [
{
  date: "3月4日",
  place: "大阪・Zepp Namba",
  songs: [

  ]
},
{
  date: "3月5日",
  place: "大阪・Zepp Namba",
  songs: [

  ]
},
{
  date: "3月12日",
  place: "東京・チームスマイル・豊洲PIT",
  songs: [
["海賊船～心の奪い手～", "浦島坂田船", "カイゾクセンココロノウバイテ"],
["千本桜", "浦島坂田船", "センボンザクラ"],
["虎視眈々", "浦島坂田船", "コシタンタン"],
["ゴーストルール", "浦島坂田船", "ゴーストルール"],
["エイリアンエイリアン", "浦島坂田船", "エイリアンエイリアン"],
["フラジール", "さかせん", "フラジール"],
["ダチュラと林檎", "センラ", "ダチュラトリンゴ"],
["きみへ", "となりの坂田。", "キミヘ"],
["ドナーソング", "志麻", "ドナーソング"],
["ダンスロボットダンス", "うらたぬき", "ダンスロボットダンス"],
["脱獄", "うらしま", "ダツゴク"],
["Pathfinders", "浦島坂田船", "パスファインダーズ"],
["アイドルっぽい曲を作った。", "浦島坂田船", "アイドルッポイキョクヲツクッタ"],
["脱法ロック", "浦島坂田船", "ダッポウロック"],
["Dreamer", "浦島坂田船", "ドリーマー"],
["君まであと何メーター", "浦島坂田船", "キミマデアトナンメーター"],
["太陽系デスコ", "浦島坂田船", "タイヨウケイデスコ"],
["Shoutër", "浦島坂田船", "シャウター"],
  ]
},
{
  date: "3月18日",
  place: "愛知・名古屋DIAMOND HALL",
  songs: [

  ]
    }
  ]
);

addLiveTour(
  "浦島坂田船",
  "2017",
  "浦島坂田船 SUMMER TOUR 2017 Beyond The Compass -BAND Edition-",
  [
{
  date: "7月30日",
  place: "宮城・チームスマイル・仙台PIT",
  songs: [

  ]
},
{
  date: "8月3日",
  place: "東京・新木場Studio Coast",
  songs: [

  ]
},
{
  date: "8月19日",
  place: "大阪・Zepp Osaka Bayside",
  songs: [

  ]
},
{
  date: "8月20日",
  place: "愛知・Zepp Nagoya",
  songs: [

  ]
    }
  ]
);

addLiveTour(
  "浦島坂田船",
  "2017",
  "浦島坂田船 SUMMER TOUR 2017 Beyond The Compass -DJ Edition-",
  [
{
  date: "7月22日",
  place: "高知・キャラバンサライ",
  songs: [

  ]
},
{
  date: "7月23日",
  place: "香川・高松festhalle",
  songs: [

  ]
},
{
  date: "7月29日",
  place: "青森・Quarter",
  songs: [

  ]
},
{
  date: "8月26日",
  place: "広島・CLUB QUATTRO",
  songs: [

  ]
},
{
  date: "8月27日",
  place: "福岡・DRUM LOGOS",
  songs: [

  ]
},
{
  date: "9月3日",
  place: "北海道・札幌ペニーレーン24",
  songs: [

  ]
},
{
  date: "9月16日",
  place: "石川・金沢Eight Hall",
  songs: [

  ]
},
{
  date: "9月17日",
  place: "福井・響のホール",
  songs: [

  ]
    }
  ]
);

addLiveTour(
  "浦島坂田船",
  "2018",
  "浦島坂田船 Spring Tour 2018 桜吹雪で乱de舞！",
  [
{
  date: "3月4日",
  place: "北海道・Zepp Sapporo",
  songs: [

  ]
},
{
  date: "3月10日",
  place: "広島・BLUE LIVE HIROSHIMA",
  songs: [

  ]
},
{
  date: "3月11日",
  place: "福岡・DRUM LOGOS",
  songs: [

  ]
},
{
  date: "3月17日",
  place: "大阪・Zepp Osaka Bayside",
  songs: [

  ]
},
{
  date: "3月22日",
  place: "愛知・Zepp Nagoya",
  songs: [

  ]
},
{
  date: "3月31日",
  place: "東京・Zepp DiverCity(TOKYO)",
  songs: [
["百花繚乱", "浦島坂田船", "ヒャッカリョウラン"],
["千本桜 -guitar rock arrangement-", "浦島坂田船", "センボンザクラギターロックアレンジメント"],
["チュルリラ・チュルリラ・ダッダッダ！", "浦島坂田船", "チュルリラチュルリラダッダッダ"],
["太陽系デスコ", "浦島坂田船", "タイヨウケイデスコ"],
["ターミナル", "センラ", "ターミナル"],
["♯嘲笑ポラロイド", "志麻セン", "チョウショウポラロイド"],
["カメリア・コンプレックス", "志麻", "カメリアコンプレックス"],
["お気に召すまま", "となりの坂田。", "オキニメスママ"],
["ノンファンタジー", "うらさか", "ノンファンタジー"],
["テオ", "うらたぬき", "テオ"],
["海賊船～心の奪い手～", "浦島坂田船", "カイゾクセンココロノウバイテ"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["Carry Forward", "浦島坂田船", "キャリーフォワード"],
["彗星ハネムーン", "浦島坂田船", "スイセイハネムーン"],
["ハロウ！ゴーストシップ", "浦島坂田船", "ハロウゴーストシップ"],
["Shoutër", "浦島坂田船", "シャウター"],
["SHOW MUST GO ON!!", "浦島坂田船", "ショーマストゴーオン"],
["年に一夜の恋模様", "浦島坂田船", "ネンニイチヤノコイモヨウ"],
["Mermaid", "浦島坂田船", "マーメイド"],
["そらに、ひらり", "浦島坂田船", "ソラニヒラリ"],

  ]
},
{
  date: "4月5日",
  place: "東京・Zepp Tokyo",
  songs: [

  ]
    }
  ]
);

addLiveTour(
  "浦島坂田船",
  "2018",
  "浦島坂田船 SUMMER TOUR 2018 俺SUMMERと、宇CHU♥旅行♥",
  [
{
  date: "7月7日",
  place: "福井・響のホール",
  songs: [

  ]
},
{
  date: "7月8日",
  place: "石川・金沢EightHall",
  songs: [

  ]
},
{
  date: "8月4日",
  place: "京都・FAN J",
  songs: [

  ]
},
{
  date: "8月5日",
  place: "福岡・DRUM LOGOS",
  songs: [

  ]
},
{
  date: "7月14日",
  place: "大阪・Zepp Namba",
  songs: [

  ]
},
{
  date: "7月15日",
  place: "大阪・Zepp Namba",
  songs: [

  ]
},
{
  date: "7月26日",
  place: "愛知・Zepp Nagoya",
  songs: [

  ]
},
{
  date: "8月18日",
  place: "宮城・チームスマイル・仙台PIT",
  songs: [

  ]
    }
  ]
);

addLiveTour(
  "浦島坂田船",
  "2018",
  "浦島坂田船 5th Anniversary 熱♡CHU♡宙♡ 俺SUMMERと、宇CHU♡旅行♡",
  [
{
  date: "7月30日",
  place: "東京・日本武道館",
  songs: [

  ]
},
{
  date: "7月31日",
  place: "東京・日本武道館",
  songs: [

  ]
    }
  ]
);





addLiveTour(
  "浦島坂田船",
  "2019",
  "URASAKA KINGDOM～To kiss princess～",
  [
{
  date: "1月5日",
  place: "愛知・Zepp Nagoya",
  songs: [

  ]
},
{
  date: "1月6日",
  place: "大阪・Zepp Namba",
  songs: [

  ]
},
{
  date: "1月14日",
  place: "東京・Zepp Tokyo",
  songs: [

  ]
    }
  ]
);


addLiveTour(
  "浦島坂田船",
  "2019",
  "浦島坂田船 Spring Tour 2019 -斬（ZAN）-",
  [
{
  date: "3月9日",
  place: "兵庫・神戸ワールド記念ホール",
  songs: [

  ]
},
{
  date: "3月10日",
  place: "兵庫・神戸ワールド記念ホール",
  songs: [

  ]
},
{
  date: "3月23日",
  place: "愛知・Zepp Nagoya",
  songs: [

  ]
},
{
  date: "3月25日",
  place: "福岡・Zepp Fukuoka",
  songs: [

  ]
},
{
  date: "3月30日",
  place: "北海道・Zepp Sapporo",
  songs: [

  ]
},
{
  date: "4月3日",
  place: "東京・両国国技館",
  songs: [

  ]
},
{
  date: "4月4日",
  place: "東京・両国国技館",
  songs: [
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["千本桜 -guitar rock arrangement-", "浦島坂田船", "センボンザクラギターロックアレンジメント"],
["虎視眈々", "浦島坂田船", "コシタンタン"],
["百花繚乱", "浦島坂田船", "ヒャッカリョウラン"],
["吉原ラメント", "浦島坂田船", "ヨシワララメント"],
["やっぱ最強！", "うらさか", "ヤッパサイキョウ"],
["ジグソーパズル", "志麻セン", "ジグソーパズル"],
["誠 -Live for Justice-", "浦島坂田船", "マコトライブフォージャスティス"],
["スパイラル", "センラ", "スパイラル"],
["セクトの誅罰", "うらたぬき", "セクトノチュウバツ"],
["ボードゲームライフ", "志麻", "ボードゲームライフ"],
["ねぇ、どろどろさん", "となりの坂田。", "ネェドロドロサン"],
["神のまにまに", "浦島坂田船", "カミノマニマニ"],
["小さなライオン", "浦島坂田船", "チイサナライオン"],
["Sailor's High", "浦島坂田船", "セイラーズハイ"],
["わいふぁい暴想ボーイ", "浦島坂田船", "ワイファイボウソウボーイ"],
["Peacock Epoch", "浦島坂田船", "ピーコックエポック"],
["合戦", "浦島坂田船", "カッセン"],
["そらに、ひらり", "浦島坂田船", "ソラニヒラリ"],
["Shoutër", "浦島坂田船", "シャウター"],
["SAILING!!!!!", "浦島坂田船", "セイリング"],
  ]
    }
  ]
);

addLiveTour(
  "浦島坂田船",
  "2019",
  "浦島坂田船 SUMMER TOUR 2019 -浦島theカジノ船　俺たち愛＄、今夜お前とBETイン-",
  [
{
  date: "7月13日",
  place: "東京・オリンパスホール八王子",
  songs: [

  ]
},
{
  date: "7月20日",
  place: "静岡・静岡市民文化会館 大ホール",
  songs: [

  ]
},
{
  date: "7月21日",
  place: "愛知・名古屋国際会議場センチュリーホール",
  songs: [

  ]
},
{
  date: "7月27日",
  place: "石川・本多の森ホール",
  songs: [

  ]
},
{
  date: "7月28日",
  place: "富山・富山オーバード・ホール",
  songs: [

  ]
},
{
  date: "7月31日",
  place: "神奈川・パシフィコ横浜 国立大ホール",
  songs: [

  ]
},
{
  date: "8月1日",
  place: "神奈川・パシフィコ横浜 国立大ホール",
  songs: [

  ]
},
{
  date: "8月3日",
  place: "広島・広島文化学園HBGホール",
  songs: [

  ]
},
{
  date: "8月4日",
  place: "香川・サンポートホール高松 大ホール",
  songs: [

  ]
},
{
  date: "8月17日",
  place: "福島・けんしん郡山文化センター 大ホール",
  songs: [

  ]
},
{
  date: "8月18日",
  place: "宮城・仙台サンプラザホール",
  songs: [

  ]
},
{
  date: "8月20日",
  place: "大阪・大阪城ホール",
  songs: [

  ]
},
{
  date: "8月24日",
  place: "熊本・市民会館シアーズホーム夢ホール",
  songs: [

  ]
},
{
  date: "8月25日",
  place: "福岡・福岡サンパレス",
  songs: [

  ]
},
{
  date: "8月27日",
  place: "高知・高知市文化プラザかるぽーと",
  songs: [

  ]
},
{
  date: "9月1日",
  place: "北海道・札幌文化芸術劇場 hitaru",
  songs: [

  ]
},
{
  date: "9月14日",
  place: "大阪・大阪国際会議場グランキューブ大阪メインホール",
  songs: [

  ]
},
{
  date: "9月15日",
  place: "大阪・大阪国際会議場グランキューブ大阪メインホール",
  songs: [

  ]
},
{
  date: "10月5日",
  place: "千葉・幕張メッセ国際展示場1・2・3ホール",
  songs: [

  ]
},
{
  date: "10月6日",
  place: "千葉・幕張メッセ国際展示場1・2・3ホール",
  songs: [

  ]
    }
  ]
);






addLiveTour(
  "浦島坂田船",
  "2019",
  "Happy Halloweeeen 浦島坂田幽霊船 ～ようこそ令和元年 やっぱり霊はあかんねん憑依Go!～",
  [
{
  date: "10月22日",
  place: "兵庫・神戸ワールド記念ホール",
  songs: [

  ]
},
{
  date: "10月24日",
  place: "神奈川・横浜アリーナ",
  songs: [
["HORRORISM","浦島坂田船","ホラーリズム"],
["グリムメイカー","浦島坂田船","グリムメイカー"],
["ゴーストルール","浦島坂田船","ゴーストルール"],
["拝啓ドッペルゲンガー","浦島坂田船","ハイケイドッペルゲンガー"],
["Mrs.Pumpkinの滑稽な夢","浦島坂田船","ミセスパンプキンノコッケイナユメ"],
["Happy Halloween","浦島坂田船","ハッピーハロウィン"],
["ハロウ！ゴーストシップ","浦島坂田船","ハロウゴーストシップ"],
["Trip-Trap, Love Trap!!","志麻セン","トリップトラップラブトラップ"],
["決戦前夜","うらさか","ケッセンゼンヤ"],
["ハングリー・ゴースト","浦島坂田船","ハングリーゴースト"],
["Starry Cruise","浦島坂田船","スターリークルーズ"],
["Fortune!!","浦島坂田船","フォーチュン"],
["ARK","浦島坂田船","アーク"],
["ビターチョコデコレーション","となりの坂田。","ビターチョコデコレーション"],
["最適解","志麻","サイテキカイ"],
["コールボーイ","センラ","コールボーイ"],
["誘惑","うらたぬき","ユウワク"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["ポーカーフェイク","浦島坂田船","ポーカーフェイク"],
["花吹雪","浦島坂田船","ハナフブキ"],
["千本桜-guitar rock arrangement ver-","浦島坂田船","センボンザクラギターロックアレンジメントバージョン"],
["Snow melody","浦島坂田船","スノーメロディ"],
["カレンダーリマインダー","浦島坂田船","カレンダーリマインダー"],
["Shoutër", "浦島坂田船", "シャウター"],
["明日へのBye Bye","浦島坂田船","アシタヘノバイバイ"],
  ]
    }
  ]
);









addLiveTour(
  "浦島坂田船",
  "2017",
  "浦島坂田船 SUMMER TOUR 2017 ～THE FINAL～",
  [
    {
      date: "10月28日",
      place: "東京・両国国技館",
      songs: [
["Pathfinders", "浦島坂田船", "パスファインダーズ"],
["Carry Forward", "浦島坂田船", "キャリーフォワード"],
["最強ライバル", "浦島坂田船", "サイキョウライバル"],
["厨病激発ボーイ", "浦島坂田船", "チュウビョウゲキハツボーイ"],
["太陽系デスコ", "浦島坂田船", "タイヨウケイデスコ"],
["Reach", "うらたぬき", "リーチ"],
["NO DRIVE, NO LIFE", "となりの坂田。", "ノードライブノーライフ"],
["プリンセスに口づけを", "うらさか", "プリンセスニクチヅケヲ"],
["slumber number", "センラ", "スランバーナンバー"],
["#嘲笑ポラロイド", "志麻セン", "チョウショウポラロイド"],
["recoup", "志麻", "リクープ"],
["ロメオ", "浦島坂田船", "ロメオ"],
["ポワゾンKISS", "浦島坂田船", "ポワゾンキス"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["千本桜-guitar rock arrangement ver.-", "浦島坂田船", "センボンザクラギターロックアレンジメント"],
["恋色花火", "浦島坂田船", "コイイロハナビ"],
["君まであと何メーター", "浦島坂田船", "キミマデアトナンメーター"],
["SHOW MUST GO ON!!", "浦島坂田船", "ショウマストゴーオン"],
["Sailor's High", "浦島坂田船", "セイラーズハイ"],
["Dreamer", "浦島坂田船", "ドリーマー"],
["Mermaid", "浦島坂田船", "マーメイド"],
["Shoutër", "浦島坂田船", "シャウター"],
       ]
    }
  ]
);



addLiveTour(
  "浦島坂田船",
  "2017",
  "Happy Halloweeeen 浦島坂田幽霊船 ～コスプレしてLOVE（恋）♥～",
  [
    {
      date: "10月29日",
      place: "東京・両国国技館",
      songs: [
["Mrs.Pumpkinの滑稽な夢", "浦島坂田船", "ミセスパンプキンノコッケイナユメ"],
["Happy Halloween", "浦島坂田船", "ハッピーハロウィン"],
["ゴーストルール", "浦島坂田船", "ゴーストルール"],
["拝啓ドッペルゲンガー", "浦島坂田船", "ハイケイドッペルゲンガー"],
["ハロウ！ゴーストシップ", "浦島坂田船", "ハロウゴーストシップ"],
["彗星ハネムーン", "うらたぬき", "スイセイハネムーン"],
["可愛くなりたい", "となりの坂田。", "カワイクナリタイ"],
["すきなことだけでいいです", "うらさか", "スキナコトダケデイイデス"],
["ヒバナ", "志麻", "ヒバナ"],
["フィクサー", "センラ", "フィクサー"],
["#嘲笑ポラロイド", "志麻セン", "アザワライポラロイド"],
["Shoutër", "浦島坂田船", "シャウター"],
["Sailor's High", "浦島坂田船", "セイラーズハイ"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["千本桜-guitar rock arrangement ver.-", "浦島坂田船", "センボンザクラギターロックアレンジメント"],
["SHOW MUST GO ON!!", "浦島坂田船", "ショウマストゴーオン"],
       ]
    }
  ]
);



addLiveTour(
  "浦島坂田船",
  "2018",
  "浦島坂田船 SUMMER TOUR 2018～THE FINAL～",
  [
    {
      date: "10月27日",
      place: "千葉・幕張イベントホール ",
      songs: [
["Starry Cruise", "浦島坂田船", "スターリークルーズ"],
["明星ギャラクティカ", "浦島坂田船", "ミョウジョウギャラクティカ"],
["わいふぁい暴想ボーイ", "浦島坂田船", "ワイファイボウソウボーイ"],
["ロキ", "浦島坂田船", "ロキ"],
["太陽系デスコ", "浦島坂田船", "タイヨウケイデスコ"],
["スクールボーイ", "となりの坂田。", "スクールボーイ"],
["ユメミドリ", "うらさか", "ユメミドリ"],
["Life goes on", "うらたぬき", "ライフゴーズオン"],
["spill", "志麻", "スピル"],
["Make a pass", "センラ", "メイクアパス"],
["ギャラクシー", "志麻セン", "ギャラクシー"],
["Peacock Epoch", "浦島坂田船", "ピーコックエポック"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["ロメオ", "浦島坂田船", "ロメオ"],
["Sailor's High", "浦島坂田船", "セイラーズハイ"],
["SHOW MUST GO ON!!", "浦島坂田船", "ショーマストゴーオン"],
["secret base ～君がくれたもの～", "浦島坂田船", "シークレットベースキミガクレタモノ"],
["年に一夜の恋模様", "浦島坂田船", "ネンニイチヤノコイモヨウ"],
["千本桜 -guitar rock arrangement-", "浦島坂田船", "センボンザクラギターロックアレンジメント"],
["Shouter", "浦島坂田船", "シャウター"],
["SAILING!!!!!", "浦島坂田船", "セイリング"],
       ]
    }
  ]
);


addLiveTour(
  "浦島坂田船",
  "2018",
  "浦島坂田船「Happy Halloweeeen 浦島坂田幽霊船～吸魂（求婚）パーティ!?ちょっと魔って▽もしかして僕にヨーカイ？～」",
  [
    {
      date: "10月28日",
      place: "千葉・幕張メッセ 幕張イベントホール",
      songs: [
["グリムメイカー", "浦島坂田船", "グリムメイカー"],
["ハロウ！ゴーストシップ", "浦島坂田船", "ハロウゴーストシップ"],
["Happy Halloween", "浦島坂田船", "ハッピーハロウィン"],
["Mrs.Pumpkinの滑稽な夢", "浦島坂田船", "ミセスパンプキンノコッケイナユメ"],
["ロメオ", "浦島坂田船", "ロメオ"],
["千日紅", "志麻", "センニチコウ"],
["#嘲笑ポラロイド", "志麻セン", "チョウショウポラロイド"],
["スパイラル", "センラ", "スパイラル"],
["私、アイドル宣言", "となりの坂田。", "ワタシアイドルセンゲン"],
["夢ファンファーレ", "うらさか", "ユメファンファーレ"],
["Pink", "うらたぬき", "ピンク"],
["Shouter", "浦島坂田船", "シャウター"],
["年に一夜の恋模様", "浦島坂田船", "トシニヒトヨノコイモヨウ"],
["最強ライバル", "浦島坂田船", "サイキョウライバル"],
["太陽系デスコ", "浦島坂田船", "タイヨウケイデスコ"],
["わいふぁい暴想ボーイ", "浦島坂田船", "ワイファイボウソウボーイ"],
["Peacock Epoch", "浦島坂田船", "ピーコックエポック"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["Dreamer", "浦島坂田船", "ドリーマー"],
["千本桜 -guitar rock arrangement-", "浦島坂田船", "センボンザクラギターロックアレンジメント"],
["厨病激発ボーイ", "浦島坂田船", "チュウビョウゲキハツボーイ"],
["SAILING!!!!!", "浦島坂田船", "セイリング"],
       ]
    }
  ]
);





addLiveTour(
  "浦島坂田船",
  "2020",
  "浦島坂田船 Spring Tour 2020 ―花（HANA）―",
  [
{
  date: "2月23日",
  place: "石川・金沢歌劇座",
  songs: [

  ]
},
{
  date: "2月24日",
  place: "新潟・新潟テルサ",
  songs: [

  ]
},
{
  date: "2月29日",
  place: "群馬・ベイシア文化ホール",
  songs: [
["新型コロナウイルス感染拡大防止に伴い開催中止", "", ""],

  ]
},
{
  date: "3月7日",
  place: "大阪・大阪城ホール",
  songs: [
["新型コロナウイルス感染拡大防止に伴い開催中止", "", ""],

  ]
},
{
  date: "3月8日",
  place: "大阪・大阪城ホール",
  songs: [
["新型コロナウイルス感染拡大防止に伴い開催中止", "", ""],

  ]
},
{
  date: "3月14日",
  place: "岩手・岩手県民会館",
  songs: [
["新型コロナウイルス感染拡大防止に伴い開催中止", "", ""],

  ]
},
{
  date: "3月15日",
  place: "青森・リンクステーションホール青森",
  songs: [
["新型コロナウイルス感染拡大防止に伴い開催中止", "", ""],

  ]
},
{
  date: "3月20日",
  place: "愛知・一宮市民会館",
  songs: [
["新型コロナウイルス感染拡大防止に伴い開催中止", "", ""],

  ]
},
{
  date: "3月30日",
  place: "千葉・幕張メッセ国際展示場4～6ホール",
  songs: [
["新型コロナウイルス感染拡大防止に伴い開催中止", "", ""],

  ]
},
{
  date: "3月31日",
  place: "千葉・幕張メッセ国際展示場4～6ホール",
  songs: [
["新型コロナウイルス感染拡大防止に伴い開催中止", "", ""],

  ]
},
{
  date: "4月5日",
  place: "山口・周南市文化会館",
  songs: [
["新型コロナウイルス感染拡大防止に伴い開催中止", "", ""],

  ]
},
{
  date: "4月6日",
  place: "岡山・倉敷市民会館",
  songs: [
["新型コロナウイルス感染拡大防止に伴い開催中止", "", ""],

  ]
},
{
  date: "4月11日",
  place: "長崎・長崎ブリックホール",
  songs: [
["新型コロナウイルス感染拡大防止に伴い開催中止", "", ""],
  ]
},
{
  date: "4月12日",
  place: "佐賀・佐賀市文化会館",
  songs: [
["新型コロナウイルス感染拡大防止に伴い開催中止", "", ""],
  ]
},
{
  date: "4月19日",
  place: "沖縄・沖縄市民会館",
  songs: [
["新型コロナウイルス感染拡大防止に伴い開催中止", "", ""],
  ]
    }
  ]
);













addLiveTour(
  "浦島坂田船",
  "2020",
  "浦島坂田船！Live&Live～RAINBOW～", [
    {
      date: "12月26日",
      place: "無観客配信ライブ",
      songs: [
["YELLOW FINEST", "浦島坂田船", "イエローファイネスト"],
["青く塗り替えろ!", "浦島坂田船", "アオクヌリカエロ"],
["最強Drive!!", "浦島坂田船", "サイキョウドライブ"],
["レッドホットクレイジーナイト", "浦島坂田船", "レッドホットクレイジーナイト"],
["ココ マドモアゼル", "浦島坂田船", "ココマドモアゼル"],
["GET UP", "うらたぬき", "ゲットアップ"],
["紫雲の翼", "志麻", "シウンノツバサ"],
["迷図", "となりの坂田。", "メイズ"],
["Sweet Magic", "センラ", "スイートマジック"],
["VS", "うらさか", "ブイエス"],
["ファイティンサマーカーニバル", "志麻セン", "ファイティンサマーカーニバル"],
["ポーカーフェイク", "浦島坂田船", "ポーカーフェイク"],
["微笑、香り、君と僕を繋ぐ", "浦島坂田船", "ビショウカオリキミトボクヲツナグ"],
["Peacock Epoch", "浦島坂田船", "ピーコックエポック"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["花や、花", "浦島坂田船", "ハナヤハナ"],
["Shoutër", "浦島坂田船", "シャウター"],
["RAINBOW", "浦島坂田船", "レインボー"],
 ]
    }
  ]
);



addLiveTour(
  "浦島坂田船",
  "2020",
  "浦島坂田船！Live&Live～CREW'S BEST～", [
    {
      date: "12月27日",
      place: "無観客配信ライブ",
      songs: [
["Shoutër", "浦島坂田船", "シャウター"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["海賊船～心の奪い手～", "浦島坂田船", "カイゾクセンココロノウバイテ"],
["Mermaid", "浦島坂田船", "マーメイド"],
["シアワセは台本の外から", "うらたぬき", "シアワセハダイホンノソトカラ"],
["CRAZY BUNNY!!", "志麻", "クレイジーバニー"],
["スーパーヒーロー", "となりの坂田。", "スーパーヒーロー"],
["色恋", "センラ", "イロコイ"],
["Snow melody", "浦島坂田船", "スノーメロディー"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["Beetle Battle", "浦島坂田船", "ビートルバトル"],
["年に一夜の恋模様", "メドレー", "トシニヒトヨノコイモヨウ"],
["アイドルっぽい曲を作った。", "メドレー", "アイドルッポイキョクヲツクッタ"],
["ベノム", "メドレー", "ベノム"],
["ハロウ！ゴーストシップ", "メドレー", "ハロウゴーストシップ"],
["ARK", "メドレー", "アーク"],
["Sailor's High", "メドレー", "セイラーズハイ"],
["Dreamer", "メドレー", "ドリーマー"],
["千本桜-guitar rock arrangement ver.-", "メドレー", "センボンザクラギターロックアレンジメントバージョン"],
["君まであと何メーター", "メドレー", "キミマデアトナンメーター"],
["最強ライバル", "メドレー", "サイキョウライバル"],
["花や、花", "浦島坂田船", "ハナヤハナ"],
["Peacock Epoch", "浦島坂田船", "ピーコックエポック"],
["SAILING!!!!!", "浦島坂田船", "セイリング"],
["RAINBOW", "浦島坂田船", "レインボー"],
 ]
    }
  ]
);


addLiveTour(
  "浦島坂田船",
  "2021",
  "浦島坂田船 Spring Tour 2021 花（HANA）〜桜花再凛〜",
  [
{
  date: "3月13日",
  place: "宮崎・宮崎市民文化ホール 大ホール",
  songs: [

  ]
},
{
  date: "3月14日",
  place: "鹿児島・川商ホール 第1ホール（鹿児島市民文化ホール）",
  songs: [

  ]
},
{
  date: "3月24日",
  place: "山口・周南市文化会館 大ホール",
  songs: [

  ]
},
{
  date: "3月25日",
  place: "岡山・倉敷市民会館",
  songs: [

  ]
},
{
  date: "3月27日",
  place: "茨城・結城市民文化センターアクロス",
  songs: [

  ]
},
{
  date: "3月30日",
  place: "東京・日本武道館",
  songs: [

  ]
},
{
  date: "3月31日",
  place: "東京・日本武道館",
  songs: [

  ]
},
{
  date: "4月3日",
  place: "兵庫・神戸国際会館こくさいホール",
  songs: [

  ]
},
{
  date: "4月4日",
  place: "滋賀・滋賀県立芸術劇場びわ湖ホール 大ホール",
  songs: [

  ]
},
{
  date: "4月15日",
  place: "岐阜・長良川国際会議場 メインホール",
  songs: [

  ]
},
{
  date: "4月17日",
  place: "福井・フェニックス・プラザ大ホール",
  songs: [

  ]
},
{
  date: "4月18日",
  place: "京都・ロームシアター京都 メインホール",
  songs: [

  ]
},
{
  date: "4月24日",
  place: "山形・やまぎん県民ホール 大ホール",
  songs: [

  ]
    },
  {
  date: "4月25日",
  place: "無観客配信ライブ",
  songs: [

  ]
    }
  ]
);


addLiveTour(
  "浦島坂田船",
  "2021",
  "浦島坂田船 SUMMER TOUR 2021 ～甘い∞(はち)密のような♡(恋)をしない？キミの放課後はボクのモノ♡無限大の♡(LOVE)STARTぉ☆～",
  [
{
  date: "7月24日",
  place: "北海道・札幌文化芸術劇場 hitaru",
  songs: [

  ]
},
{
  date: "7月28日",
  place: "東京・東京ガーデンシアター",
  songs: [

  ]
},
{
  date: "7月29日",
  place: "東京・東京ガーデンシアター",
  songs: [

  ]
},
{
  date: "8月7日",
  place: "愛知・日本ガイシホール",
  songs: [

  ]
},
{
  date: "8月8日",
  place: "愛知・日本ガイシホール",
  songs: [

  ]
},
{
  date: "8月14日",
  place: "福岡・マリンメッセ福岡",
  songs: [

  ]
},
{
  date: "8月20日",
  place: "宮城・ゼビオアリーナ仙台",
  songs: [

  ]
},
{
  date: "8月21日",
  place: "宮城・ゼビオアリーナ仙台",
  songs: [

  ]
},
{
  date: "8月24日",
  place: "大阪・大阪城ホール",
  songs: [

  ]
},
{
  date: "8月25日",
  place: "大阪・大阪城ホール",
  songs: [

  ]
},
{
  date: "8月28日",
  place: "広島・広島サンプラザホール",
  songs: [

  ]
},
{
  date: "8月29日",
  place: "広島・広島サンプラザホール",
  songs: [

  ]
},
{
  date: "9月4日",
  place: "高知・高知県立県民体育館",
  songs: [

  ]
},
{
  date: "9月5日",
  place: "高知・高知県立県民体育館",
  songs: [

  ]
},
{
  date: "9月11日",
  place: "島根・島根県民会館 大ホール",
  songs: [

  ]
},
{
  date: "9月12日",
  place: "鳥取・とりぎん文化会館 梨花ホール",
  songs: [

  ]
},
{
  date: "12月24日",
  place: "大阪・大阪城ホール",
  songs: [

  ]
},
{
  date: "12月28日",
  place: "千葉・幕張メッセ国際展示場9・10・11ホール",
  songs: [

  ]
    }
  ]
);

    addLiveTour(
  "浦島坂田船",
  "2021",
  "Happy Halloweeeen 浦島坂田幽霊船　～本気か！MAGIC！マジカルミラクル！きゅるるるるん☆彡　お菓子くなっちゃう♡もうっ//♡　やメテオー！CHU♡ﾄﾞｰﾝ！～", [
    {
      date: "10月31日",
      place: "無観客配信ライブ",
      songs: [
["Bad Monster", "浦島坂田船", "バッドモンスター"],
["HORRORISM", "浦島坂田船", "ホラリズム"],
["ヴァンパイア", "浦島坂田船", "ヴァンパイア"],
["Happy Halloween", "浦島坂田船", "ハッピーハロウィン"],
["ハングリー・ゴースト", "浦島坂田船", "ハングリーゴースト"],
["PIRATES A GO GO", "浦島坂田船", "パイレーツアゴーゴー"],
["Ring", "浦島坂田船", "リング"],
["グリムメイカー", "浦島坂田船", "グリムメイカー"],
["ハロウ！ゴーストシップ", "浦島坂田船", "ハロウゴーストシップ"],
["SPOOKY MAGICAL NIGHT", "浦島坂田船", "スプーキーマジカルナイト"],
["realizer", "浦島坂田船", "リアライザー"],
["カモフラ", "浦島坂田船", "カモフラ"],
["KING", "浦島坂田船", "キング"],
["Beetle Battle", "浦島坂田船", "ビートルバトル"],
["キュートなカノジョ", "となりの坂田。", "キュートナカノジョ"],
["ボッカデラベリタ", "うらたぬき", "ボッカデラベリタ"],
["爆笑", "センラ", "バクショウ"],
["Oxygen", "志麻", "オキシジェン"],
["生涯ライバル", "浦島坂田船", "ショウガイライバル"],
["青空ピカソ", "浦島坂田船", "アオゾラピカソ"],
["フランマ", "浦島坂田船", "フランマ"],
["ワナビークインビー", "浦島坂田船", "ワナビークインビー"],
["最強Drive!!", "浦島坂田船", "サイキョウドライブ"],
["SAILING!!!!!", "浦島坂田船", "セイリング"],
  ]
    }
  ]
);

addLiveTour(
  "浦島坂田船",
  "2022",
  "浦島坂田船 Spring Tour 2022 ～令和浪漫～",
  [
{
  date: "2月23日",
  place: "新潟・新潟テルサ",
  songs: [

  ]
},
{
  date: "2月27日",
  place: "静岡・静岡市民文化会館 大ホール",
  songs: [

  ]
},
{
  date: "3月5日",
  place: "長野・まつもと市民芸術館",
  songs: [

  ]
},
{
  date: "3月6日",
  place: "石川・金沢歌劇座",
  songs: [

  ]
},
{
  date: "3月12日",
  place: "青森・リンクステーションホール青森",
  songs: [

  ]
},
{
  date: "3月13日",
  place: "岩手・盛岡市民文化ホール 大ホール",
  songs: [

  ]
},
{
  date: "3月21日",
  place: "徳島・アスティとくしま",
  songs: [

  ]
},
{
  date: "3月22日",
  place: "兵庫・神戸国際会館こくさいホール",
  songs: [

  ]
},
{
  date: "3月28日",
  place: "山梨・YCC県民文化ホール（山梨県立県民文化ホール）",
  songs: [

  ]
},
{
  date: "4月2日",
  place: "和歌山・和歌山県民文化会館 大ホール",
  songs: [

  ]
},
{
  date: "4月3日",
  place: "奈良・なら100年会館 大ホール",
  songs: [

  ]
},
{
  date: "4月5日",
  place: "三重・四日市市文化会館 第1ホール",
  songs: [

  ]
},
  {
      date: "4月9日",
      place: "神奈川・ぴあアリーナMM",
      songs: [
        ["燦然賛歌", "浦島坂田船", "サンゼンサンカ"],
["グッド・バイ", "浦島坂田船", "グッドバイ"],
["吉原ラメント", "浦島坂田船", "ヨシワララメント"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレアラシコンフュージョン"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["オルターエゴ", "志麻セン", "オルターエゴ"],
["爆笑", "うらさか", "バクショウ"],
["誠-Live for Justice-", "浦島坂田船", "マコトライブフォージャスティス"],
["極楽浄土", "浦島坂田船", "ゴクラクジョウド"],
["貴方と云ふ花", "浦島坂田船", "アナタトイウハナ"],
["ベビーデーズ", "さかせん", "ベビーデーズ"],
["アニマル", "裏千家", "アニマル"],
["チェック・ナイト", "となりの坂田。", "チェックナイト"],
["Burn it down", "うらしま", "バーンイットダウン"],
["レーヴ", "志麻", "レーヴ"],
["パンペルデュ", "センラ", "パンペルデュ"],
["二息歩行(Reloaded)", "しまさか", "ニソクホコウリローデッド"],
["恋のMAGIC", "うらたぬき", "コイノマジック"],
["シンデレラステップ", "浦島坂田船", "シンデレラステップ"],
["マジカル・ショコラティエ", "浦島坂田船", "マジカルショコラティエ"],
["生涯ライバル", "浦島坂田船", "ショウガイライバル"],
["ワナビークインビ―", "浦島坂田船", "ワナビークインビー"],
["アワ・ダンサー", "浦島坂田船", "アワダンサー"],
["realizer", "浦島坂田船", "リアライザー"],
["Peacock Epoch", "浦島坂田船", "ピーコックエポック"],
["花や、花", "浦島坂田船", "ハナヤハナ"],
      ]
    },


    {
       date: "4月10日",
      place: "神奈川・ぴあアリーナMM",
      songs: [
        ["燦然賛歌", "浦島坂田船", "サンゼンサンカ"],
["グッド・バイ", "浦島坂田船", "グッドバイ"],
["吉原ラメント", "浦島坂田船", "ヨシワララメント"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレアラシコンフュージョン"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["オルターエゴ", "志麻セン", "オルターエゴ"],
["爆笑", "うらさか", "バクショウ"],
["誠-Live for Justice-", "浦島坂田船", "マコトライブフォージャスティス"],
["極楽浄土", "浦島坂田船", "ゴクラクジョウド"],
["貴方と云ふ花", "浦島坂田船", "アナタトイウハナ"],
["ベビーデーズ", "さかせん", "ベビーデーズ"],
["アニマル", "裏千家", "アニマル"],
["チェック・ナイト", "となりの坂田。", "チェックナイト"],
["Burn it down", "うらしま", "バーンイットダウン"],
["レーヴ", "志麻", "レーヴ"],
["パンペルデュ", "センラ", "パンペルデュ"],
["二息歩行(Reloaded)", "しまさか", "ニソクホコウリローデッド"],
["恋のMAGIC", "うらたぬき", "コイノマジック"],
["シンデレラステップ", "浦島坂田船", "シンデレラステップ"],
["マジカル・ショコラティエ", "浦島坂田船", "マジカルショコラティエ"],
 ["わいふぁい暴想ボーイ","日替わり","ワイファイボウソウボーイ"],
["ワナビークインビ―", "浦島坂田船", "ワナビークインビー"],
["アワ・ダンサー", "浦島坂田船", "アワダンサー"],
["realizer", "浦島坂田船", "リアライザー"],
["Peacock Epoch", "浦島坂田船", "ピーコックエポック"],
["花や、花", "浦島坂田船", "ハナヤハナ"],
      ]
},
{
  date: "4月14日",
  place: "山口・KDDI維新ホール",
  songs: [

  ]
},
{
  date: "4月16日",
  place: "佐賀・佐賀市文化会館",
  songs: [

  ]
},
{
  date: "4月17日",
  place: "長崎・長崎ブリックホール",
  songs: [

  ]
},
{
  date: "4月23日",
  place: "大分・iichikoグランシアタ",
  songs: [

  ]
},
{
  date: "4月24日",
  place: "愛媛・愛媛県県民文化会館 メインホール",
  songs: [

  ]
},
{
  date: "4月29日",
  place: "沖縄・沖縄コンベンションセンター劇場棟",
  songs: [

  ]
},
{
  date: "4月30日",
  place: "沖縄・沖縄コンベンションセンター劇場棟",
  songs: [

  ]
    }
  ]
);





  

addLiveTour(
  "浦島坂田船",
  "2022",
  "浦島坂田船 SUMMER TOUR 2022 Toni9ht",
  [

{
  date: "7月29日",
  place: "宮城・ゼビオアリーナ仙台",
  songs: [
["Piece Piece Piece", "浦島坂田船", "ピースピースピース"],
["ポーカーフェイク", "浦島坂田船", "ポーカーフェイク"],
["シャララ", "浦島坂田船", "シャララ"],
["夜咄ディセイブ", "浦島坂田船", "ヨバナシディセイブ"],
["レッドホットクレイジーナイト", "浦島坂田船", "レッドホットクレイジーナイト"],
["Starry Cruise", "浦島坂田船", "スターリークルーズ"],
["マダ", "うらたぬき", "マダ"],
["ゆめのものまね", "となりの坂田。", "ユメノモノマネ"],
["どっちつかずLOVERS", "うらさか", "ドッチツカズラバーズ"],
["月夜", "浦島坂田船", "ツキヨ"],
["ヨニゲーム", "浦島坂田船", "ヨニゲーム"],
["ヒドイヒドラ", "浦島坂田船", "ヒドイヒドラ"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["十六夜ナイトフィーバー", "志麻", "イザヨイナイトフィーバー"],
["DREAM BABY", "センラ", "ドリームベイビー"],
["Ride The Night", "志麻セン", "ライドザナイト"],
["年に一夜の恋模様", "浦島坂田船", "トシニヒトヨノコイモヨウ"],
["流れ星なんていらない", "浦島坂田船", "ナガレボシナンテイラナイ"],
["アンコール", "浦島坂田船", "アンコール"],
["SWEET TASTE PRESENT", "浦島坂田船", "スイートテイストプレゼント"],
["溺愛", "浦島坂田船", "デキアイ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["僕のシンデレラ", "浦島坂田船", "ボクノシンデレラ"],
["本能全開ソレソレソレ!", "浦島坂田船", "ホンノウゼンカイソレソレソレ"],
["Shoutër", "浦島坂田船", "シャウター"],
  ]
},
{
  date: "7月30日",
  place: "宮城・ゼビオアリーナ仙台",
  songs: [
["Piece Piece Piece", "浦島坂田船", "ピースピースピース"],
["ポーカーフェイク", "浦島坂田船", "ポーカーフェイク"],
["シャララ", "浦島坂田船", "シャララ"],
["夜咄ディセイブ", "浦島坂田船", "ヨバナシディセイブ"],
["レッドホットクレイジーナイト", "浦島坂田船", "レッドホットクレイジーナイト"],
["Starry Cruise", "浦島坂田船", "スターリークルーズ"],
["マダ", "うらたぬき", "マダ"],
["ゆめのものまね", "となりの坂田。", "ユメノモノマネ"],
["どっちつかずLOVERS", "うらさか", "ドッチツカズラバーズ"],
["月夜", "浦島坂田船", "ツキヨ"],
["ヨニゲーム", "浦島坂田船", "ヨニゲーム"],
["ヒドイヒドラ", "浦島坂田船", "ヒドイヒドラ"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["十六夜ナイトフィーバー", "志麻", "イザヨイナイトフィーバー"],
["DREAM BABY", "センラ", "ドリームベイビー"],
["Ride The Night", "志麻セン", "ライドザナイト"],
["年に一夜の恋模様", "浦島坂田船", "トシニヒトヨノコイモヨウ"],
["流れ星なんていらない", "浦島坂田船", "ナガレボシナンテイラナイ"],
["アンコール", "浦島坂田船", "アンコール"],
["マジカル・ショコラティエ", "浦島坂田船", "マジカルショコラティエ"],
["溺愛", "浦島坂田船", "デキアイ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["僕のシンデレラ", "浦島坂田船", "ボクノシンデレラ"],
["本能全開ソレソレソレ!", "浦島坂田船", "ホンノウゼンカイソレソレソレ"],
["Shoutër", "浦島坂田船", "シャウター"],
  ]
},
{
  date: "8月2日",
  place: "北海道・北海道立総合体育センター北海きたえーる",
  songs: [
["Piece Piece Piece", "浦島坂田船", "ピースピースピース"],
["ポーカーフェイク", "浦島坂田船", "ポーカーフェイク"],
["シャララ", "浦島坂田船", "シャララ"],
["夜咄ディセイブ", "浦島坂田船", "ヨバナシディセイブ"],
["レッドホットクレイジーナイト", "浦島坂田船", "レッドホットクレイジーナイト"],
["Starry Cruise", "浦島坂田船", "スターリークルーズ"],
["マダ", "うらたぬき", "マダ"],
["ゆめのものまね", "となりの坂田。", "ユメノモノマネ"],
["どっちつかずLOVERS", "うらさか", "ドッチツカズラバーズ"],
["月夜", "浦島坂田船", "ツキヨ"],
["ヨニゲーム", "浦島坂田船", "ヨニゲーム"],
["ヒドイヒドラ", "浦島坂田船", "ヒドイヒドラ"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["十六夜ナイトフィーバー", "志麻", "イザヨイナイトフィーバー"],
["DREAM BABY", "センラ", "ドリームベイビー"],
["Ride The Night", "志麻セン", "ライドザナイト"],
["年に一夜の恋模様", "浦島坂田船", "トシニヒトヨノコイモヨウ"],
["流れ星なんていらない", "浦島坂田船", "ナガレボシナンテイラナイ"],
["アンコール", "浦島坂田船", "アンコール"],
["SWEET TASTE PRESENT", "浦島坂田船", "スイートテイストプレゼント"],
["溺愛", "浦島坂田船", "デキアイ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["僕のシンデレラ", "浦島坂田船", "ボクノシンデレラ"],
["本能全開ソレソレソレ!", "浦島坂田船", "ホンノウゼンカイソレソレソレ"],
["Shoutër", "浦島坂田船", "シャウター"],
  ]
},
{
  date: "8月11日",
  place: "福岡・マリンメッセ福岡A館",
  songs: [
["Piece Piece Piece", "浦島坂田船", "ピースピースピース"],
["ポーカーフェイク", "浦島坂田船", "ポーカーフェイク"],
["シャララ", "浦島坂田船", "シャララ"],
["夜咄ディセイブ", "浦島坂田船", "ヨバナシディセイブ"],
["レッドホットクレイジーナイト", "浦島坂田船", "レッドホットクレイジーナイト"],
["Starry Cruise", "浦島坂田船", "スターリークルーズ"],
["マダ", "うらたぬき", "マダ"],
["ゆめのものまね", "となりの坂田。", "ユメノモノマネ"],
["どっちつかずLOVERS", "うらさか", "ドッチツカズラバーズ"],
["月夜", "浦島坂田船", "ツキヨ"],
["ヨニゲーム", "浦島坂田船", "ヨニゲーム"],
["ヒドイヒドラ", "浦島坂田船", "ヒドイヒドラ"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["十六夜ナイトフィーバー", "志麻", "イザヨイナイトフィーバー"],
["DREAM BABY", "センラ", "ドリームベイビー"],
["Ride The Night", "志麻セン", "ライドザナイト"],
["年に一夜の恋模様", "浦島坂田船", "トシニヒトヨノコイモヨウ"],
["流れ星なんていらない", "浦島坂田船", "ナガレボシナンテイラナイ"],
["アンコール", "浦島坂田船", "アンコール"],
["マジカル・ショコラティエ", "浦島坂田船", "マジカルショコラティエ"],
["溺愛", "浦島坂田船", "デキアイ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["僕のシンデレラ", "浦島坂田船", "ボクノシンデレラ"],
["本能全開ソレソレソレ!", "浦島坂田船", "ホンノウゼンカイソレソレソレ"],
["Shoutër", "浦島坂田船", "シャウター"],
  ]
},
{
  date: "8月16日",
  place: "東京・国立代々木競技場 第一体育館",
  songs: [
["Piece Piece Piece", "浦島坂田船", "ピースピースピース"],
["ポーカーフェイク", "浦島坂田船", "ポーカーフェイク"],
["シャララ", "浦島坂田船", "シャララ"],
["夜咄ディセイブ", "浦島坂田船", "ヨバナシディセイブ"],
["レッドホットクレイジーナイト", "浦島坂田船", "レッドホットクレイジーナイト"],
["Starry Cruise", "浦島坂田船", "スターリークルーズ"],
["マダ", "うらたぬき", "マダ"],
["ゆめのものまね", "となりの坂田。", "ユメノモノマネ"],
["どっちつかずLOVERS", "うらさか", "ドッチツカズラバーズ"],
["月夜", "浦島坂田船", "ツキヨ"],
["ヨニゲーム", "浦島坂田船", "ヨニゲーム"],
["ヒドイヒドラ", "浦島坂田船", "ヒドイヒドラ"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["十六夜ナイトフィーバー", "志麻", "イザヨイナイトフィーバー"],
["DREAM BABY", "センラ", "ドリームベイビー"],
["Ride The Night", "志麻セン", "ライドザナイト"],
["年に一夜の恋模様", "浦島坂田船", "トシニヒトヨノコイモヨウ"],
["流れ星なんていらない", "浦島坂田船", "ナガレボシナンテイラナイ"],
["アンコール", "浦島坂田船", "アンコール"],
["SWEET TASTE PRESENT", "浦島坂田船", "スイートテイストプレゼント"],
["溺愛", "浦島坂田船", "デキアイ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["僕のシンデレラ", "浦島坂田船", "ボクノシンデレラ"],
["本能全開ソレソレソレ!", "浦島坂田船", "ホンノウゼンカイソレソレソレ"],
["Shoutër", "浦島坂田船", "シャウター"],
  ]
},
{
  date: "8月17日",
  place: "東京・国立代々木競技場 第一体育館",
  songs: [
["Piece Piece Piece", "浦島坂田船", "ピースピースピース"],
["ポーカーフェイク", "浦島坂田船", "ポーカーフェイク"],
["シャララ", "浦島坂田船", "シャララ"],
["夜咄ディセイブ", "浦島坂田船", "ヨバナシディセイブ"],
["レッドホットクレイジーナイト", "浦島坂田船", "レッドホットクレイジーナイト"],
["Starry Cruise", "浦島坂田船", "スターリークルーズ"],
["マダ", "うらたぬき", "マダ"],
["ゆめのものまね", "となりの坂田。", "ユメノモノマネ"],
["どっちつかずLOVERS", "うらさか", "ドッチツカズラバーズ"],
["月夜", "浦島坂田船", "ツキヨ"],
["ヨニゲーム", "浦島坂田船", "ヨニゲーム"],
["ヒドイヒドラ", "浦島坂田船", "ヒドイヒドラ"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["十六夜ナイトフィーバー", "志麻", "イザヨイナイトフィーバー"],
["DREAM BABY", "センラ", "ドリームベイビー"],
["Ride The Night", "志麻セン", "ライドザナイト"],
["年に一夜の恋模様", "浦島坂田船", "トシニヒトヨノコイモヨウ"],
["流れ星なんていらない", "浦島坂田船", "ナガレボシナンテイラナイ"],
["アンコール", "浦島坂田船", "アンコール"],
["マジカル・ショコラティエ", "浦島坂田船", "マジカルショコラティエ"],
["溺愛", "浦島坂田船", "デキアイ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["僕のシンデレラ", "浦島坂田船", "ボクノシンデレラ"],
["本能全開ソレソレソレ!", "浦島坂田船", "ホンノウゼンカイソレソレソレ"],
["Shoutër", "浦島坂田船", "シャウター"],
  ]
},
{
  date: "8月20日",
  place: "広島・広島サンプラザホール",
  songs: [
["Piece Piece Piece", "浦島坂田船", "ピースピースピース"],
["ポーカーフェイク", "浦島坂田船", "ポーカーフェイク"],
["シャララ", "浦島坂田船", "シャララ"],
["夜咄ディセイブ", "浦島坂田船", "ヨバナシディセイブ"],
["レッドホットクレイジーナイト", "浦島坂田船", "レッドホットクレイジーナイト"],
["Starry Cruise", "浦島坂田船", "スターリークルーズ"],
["マダ", "うらたぬき", "マダ"],
["ゆめのものまね", "となりの坂田。", "ユメノモノマネ"],
["どっちつかずLOVERS", "うらさか", "ドッチツカズラバーズ"],
["月夜", "浦島坂田船", "ツキヨ"],
["ヨニゲーム", "浦島坂田船", "ヨニゲーム"],
["ヒドイヒドラ", "浦島坂田船", "ヒドイヒドラ"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["十六夜ナイトフィーバー", "志麻", "イザヨイナイトフィーバー"],
["DREAM BABY", "センラ", "ドリームベイビー"],
["Ride The Night", "志麻セン", "ライドザナイト"],
["年に一夜の恋模様", "浦島坂田船", "トシニヒトヨノコイモヨウ"],
["流れ星なんていらない", "浦島坂田船", "ナガレボシナンテイラナイ"],
["アンコール", "浦島坂田船", "アンコール"],
["SWEET TASTE PRESENT", "浦島坂田船", "スイートテイストプレゼント"],
["溺愛", "浦島坂田船", "デキアイ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["僕のシンデレラ", "浦島坂田船", "ボクノシンデレラ"],
["本能全開ソレソレソレ!", "浦島坂田船", "ホンノウゼンカイソレソレソレ"],
["Shoutër", "浦島坂田船", "シャウター"],
  ]
},
{
  date: "8月21日",
  place: "広島・広島サンプラザホール",
  songs: [
["Piece Piece Piece", "浦島坂田船", "ピースピースピース"],
["ポーカーフェイク", "浦島坂田船", "ポーカーフェイク"],
["シャララ", "浦島坂田船", "シャララ"],
["夜咄ディセイブ", "浦島坂田船", "ヨバナシディセイブ"],
["レッドホットクレイジーナイト", "浦島坂田船", "レッドホットクレイジーナイト"],
["Starry Cruise", "浦島坂田船", "スターリークルーズ"],
["マダ", "うらたぬき", "マダ"],
["ゆめのものまね", "となりの坂田。", "ユメノモノマネ"],
["どっちつかずLOVERS", "うらさか", "ドッチツカズラバーズ"],
["月夜", "浦島坂田船", "ツキヨ"],
["ヨニゲーム", "浦島坂田船", "ヨニゲーム"],
["ヒドイヒドラ", "浦島坂田船", "ヒドイヒドラ"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["十六夜ナイトフィーバー", "志麻", "イザヨイナイトフィーバー"],
["DREAM BABY", "センラ", "ドリームベイビー"],
["Ride The Night", "志麻セン", "ライドザナイト"],
["年に一夜の恋模様", "浦島坂田船", "トシニヒトヨノコイモヨウ"],
["流れ星なんていらない", "浦島坂田船", "ナガレボシナンテイラナイ"],
["アンコール", "浦島坂田船", "アンコール"],
["マジカル・ショコラティエ", "浦島坂田船", "マジカルショコラティエ"],
["溺愛", "浦島坂田船", "デキアイ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["僕のシンデレラ", "浦島坂田船", "ボクノシンデレラ"],
["本能全開ソレソレソレ!", "浦島坂田船", "ホンノウゼンカイソレソレソレ"],
["Shoutër", "浦島坂田船", "シャウター"],
  ]
},
{
  date: "8月23日",
  place: "大阪・大阪城ホール",
  songs: [
["Piece Piece Piece", "浦島坂田船", "ピースピースピース"],
["ポーカーフェイク", "浦島坂田船", "ポーカーフェイク"],
["シャララ", "浦島坂田船", "シャララ"],
["夜咄ディセイブ", "浦島坂田船", "ヨバナシディセイブ"],
["レッドホットクレイジーナイト", "浦島坂田船", "レッドホットクレイジーナイト"],
["Starry Cruise", "浦島坂田船", "スターリークルーズ"],
["マダ", "うらたぬき", "マダ"],
["ゆめのものまね", "となりの坂田。", "ユメノモノマネ"],
["どっちつかずLOVERS", "うらさか", "ドッチツカズラバーズ"],
["月夜", "浦島坂田船", "ツキヨ"],
["ヨニゲーム", "浦島坂田船", "ヨニゲーム"],
["ヒドイヒドラ", "浦島坂田船", "ヒドイヒドラ"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["十六夜ナイトフィーバー", "志麻", "イザヨイナイトフィーバー"],
["DREAM BABY", "センラ", "ドリームベイビー"],
["Ride The Night", "志麻セン", "ライドザナイト"],
["年に一夜の恋模様", "浦島坂田船", "トシニヒトヨノコイモヨウ"],
["流れ星なんていらない", "浦島坂田船", "ナガレボシナンテイラナイ"],
["アンコール", "浦島坂田船", "アンコール"],
["SWEET TASTE PRESENT", "浦島坂田船", "スイートテイストプレゼント"],
["溺愛", "浦島坂田船", "デキアイ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["僕のシンデレラ", "浦島坂田船", "ボクノシンデレラ"],
["本能全開ソレソレソレ!", "浦島坂田船", "ホンノウゼンカイソレソレソレ"],
["Shoutër", "浦島坂田船", "シャウター"],
  ]
},
{
  date: "8月24日",
  place: "大阪・大阪城ホール",
  songs: [
["Piece Piece Piece", "浦島坂田船", "ピースピースピース"],
["ポーカーフェイク", "浦島坂田船", "ポーカーフェイク"],
["シャララ", "浦島坂田船", "シャララ"],
["夜咄ディセイブ", "浦島坂田船", "ヨバナシディセイブ"],
["レッドホットクレイジーナイト", "浦島坂田船", "レッドホットクレイジーナイト"],
["Starry Cruise", "浦島坂田船", "スターリークルーズ"],
["マダ", "うらたぬき", "マダ"],
["ゆめのものまね", "となりの坂田。", "ユメノモノマネ"],
["どっちつかずLOVERS", "うらさか", "ドッチツカズラバーズ"],
["月夜", "浦島坂田船", "ツキヨ"],
["ヨニゲーム", "浦島坂田船", "ヨニゲーム"],
["ヒドイヒドラ", "浦島坂田船", "ヒドイヒドラ"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["十六夜ナイトフィーバー", "志麻", "イザヨイナイトフィーバー"],
["DREAM BABY", "センラ", "ドリームベイビー"],
["Ride The Night", "志麻セン", "ライドザナイト"],
["年に一夜の恋模様", "浦島坂田船", "トシニヒトヨノコイモヨウ"],
["流れ星なんていらない", "浦島坂田船", "ナガレボシナンテイラナイ"],
["アンコール", "浦島坂田船", "アンコール"],
["マジカル・ショコラティエ", "浦島坂田船", "マジカルショコラティエ"],
["溺愛", "浦島坂田船", "デキアイ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["僕のシンデレラ", "浦島坂田船", "ボクノシンデレラ"],
["本能全開ソレソレソレ!", "浦島坂田船", "ホンノウゼンカイソレソレソレ"],
["Shoutër", "浦島坂田船", "シャウター"],
  ]
},
{
  date: "9月10日",
  place: "東京・有明アリーナ",
  songs: [
["Piece Piece Piece", "浦島坂田船", "ピースピースピース"],
["ポーカーフェイク", "浦島坂田船", "ポーカーフェイク"],
["シャララ", "浦島坂田船", "シャララ"],
["夜咄ディセイブ", "浦島坂田船", "ヨバナシディセイブ"],
["レッドホットクレイジーナイト", "浦島坂田船", "レッドホットクレイジーナイト"],
["Starry Cruise", "浦島坂田船", "スターリークルーズ"],
["マダ", "うらたぬき", "マダ"],
["ゆめのものまね", "となりの坂田。", "ユメノモノマネ"],
["どっちつかずLOVERS", "うらさか", "ドッチツカズラバーズ"],
["月夜", "浦島坂田船", "ツキヨ"],
["ヨニゲーム", "浦島坂田船", "ヨニゲーム"],
["ヒドイヒドラ", "浦島坂田船", "ヒドイヒドラ"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["十六夜ナイトフィーバー", "志麻", "イザヨイナイトフィーバー"],
["DREAM BABY", "センラ", "ドリームベイビー"],
["Ride The Night", "志麻セン", "ライドザナイト"],
["年に一夜の恋模様", "浦島坂田船", "トシニヒトヨノコイモヨウ"],
["流れ星なんていらない", "浦島坂田船", "ナガレボシナンテイラナイ"],
["アンコール", "浦島坂田船", "アンコール"],
["マジカル・ショコラティエ", "浦島坂田船", "マジカルショコラティエ"],
["溺愛", "浦島坂田船", "デキアイ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["僕のシンデレラ", "浦島坂田船", "ボクノシンデレラ"],
["本能全開ソレソレソレ!", "浦島坂田船", "ホンノウゼンカイソレソレソレ"],
["Shoutër", "浦島坂田船", "シャウター"],
  ]
},
{
  date: "9月11日",
  place: "東京・有明アリーナ",
  songs: [
["Piece Piece Piece", "浦島坂田船", "ピースピースピース"],
["ポーカーフェイク", "浦島坂田船", "ポーカーフェイク"],
["シャララ", "浦島坂田船", "シャララ"],
["夜咄ディセイブ", "浦島坂田船", "ヨバナシディセイブ"],
["レッドホットクレイジーナイト", "浦島坂田船", "レッドホットクレイジーナイト"],
["Starry Cruise", "浦島坂田船", "スターリークルーズ"],
["マダ", "うらたぬき", "マダ"],
["ゆめのものまね", "となりの坂田。", "ユメノモノマネ"],
["どっちつかずLOVERS", "うらさか", "ドッチツカズラバーズ"],
["月夜", "浦島坂田船", "ツキヨ"],
["ヨニゲーム", "浦島坂田船", "ヨニゲーム"],
["ヒドイヒドラ", "浦島坂田船", "ヒドイヒドラ"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["十六夜ナイトフィーバー", "志麻", "イザヨイナイトフィーバー"],
["DREAM BABY", "センラ", "ドリームベイビー"],
["Ride The Night", "志麻セン", "ライドザナイト"],
["年に一夜の恋模様", "浦島坂田船", "トシニヒトヨノコイモヨウ"],
["流れ星なんていらない", "浦島坂田船", "ナガレボシナンテイラナイ"],
["アンコール", "浦島坂田船", "アンコール"],
["SWEET TASTE PRESENT", "浦島坂田船", "スイートテイストプレゼント"],
["溺愛", "浦島坂田船", "デキアイ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["僕のシンデレラ", "浦島坂田船", "ボクノシンデレラ"],
["本能全開ソレソレソレ!", "浦島坂田船", "ホンノウゼンカイソレソレソレ"],
["Shoutër", "浦島坂田船", "シャウター"],
  ]
},
{
  date: "9月23日",
  place: "静岡・静岡エコパアリーナ",
  songs: [
["Piece Piece Piece", "浦島坂田船", "ピースピースピース"],
["ポーカーフェイク", "浦島坂田船", "ポーカーフェイク"],
["シャララ", "浦島坂田船", "シャララ"],
["夜咄ディセイブ", "浦島坂田船", "ヨバナシディセイブ"],
["レッドホットクレイジーナイト", "浦島坂田船", "レッドホットクレイジーナイト"],
["Starry Cruise", "浦島坂田船", "スターリークルーズ"],
["マダ", "うらたぬき", "マダ"],
["ゆめのものまね", "となりの坂田。", "ユメノモノマネ"],
["どっちつかずLOVERS", "うらさか", "ドッチツカズラバーズ"],
["月夜", "浦島坂田船", "ツキヨ"],
["ヨニゲーム", "浦島坂田船", "ヨニゲーム"],
["ヒドイヒドラ", "浦島坂田船", "ヒドイヒドラ"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["十六夜ナイトフィーバー", "志麻", "イザヨイナイトフィーバー"],
["DREAM BABY", "センラ", "ドリームベイビー"],
["Ride The Night", "志麻セン", "ライドザナイト"],
["年に一夜の恋模様", "浦島坂田船", "トシニヒトヨノコイモヨウ"],
["流れ星なんていらない", "浦島坂田船", "ナガレボシナンテイラナイ"],
["アンコール", "浦島坂田船", "アンコール"],
["SWEET TASTE PRESENT", "浦島坂田船", "スイートテイストプレゼント"],
["溺愛", "浦島坂田船", "デキアイ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["僕のシンデレラ", "浦島坂田船", "ボクノシンデレラ"],
["本能全開ソレソレソレ!", "浦島坂田船", "ホンノウゼンカイソレソレソレ"],
["SAILING!!!!!", "浦島坂田船", "セイリング"],
["Q for U", "浦島坂田船", "キューフォーユー"],
]
},
{
  date: "1月28日",
  place: "静岡・静岡エコパアリーナ",
  songs: [
["Piece Piece Piece", "浦島坂田船", "ピースピースピース"],
["ポーカーフェイク", "浦島坂田船", "ポーカーフェイク"],
["シャララ", "浦島坂田船", "シャララ"],
["夜咄ディセイブ", "浦島坂田船", "ヨバナシディセイブ"],
["レッドホットクレイジーナイト", "浦島坂田船", "レッドホットクレイジーナイト"],
["Starry Cruise", "浦島坂田船", "スターリークルーズ"],
["マダ", "うらたぬき", "マダ"],
["ゆめのものまね", "となりの坂田。", "ユメノモノマネ"],
["どっちつかずLOVERS", "うらさか", "ドッチツカズラバーズ"],
["月夜", "浦島坂田船", "ツキヨ"],
["ヨニゲーム", "浦島坂田船", "ヨニゲーム"],
["ヒドイヒドラ", "浦島坂田船", "ヒドイヒドラ"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["十六夜ナイトフィーバー", "志麻", "イザヨイナイトフィーバー"],
["DREAM BABY", "センラ", "ドリームベイビー"],
["Ride The Night", "志麻セン", "ライドザナイト"],
["年に一夜の恋模様", "浦島坂田船", "トシニヒトヨノコイモヨウ"],
["流れ星なんていらない", "浦島坂田船", "ナガレボシナンテイラナイ"],
["アンコール", "浦島坂田船", "アンコール"],
["SWEET TASTE PRESENT", "浦島坂田船", "スイートテイストプレゼント"],
["溺愛", "浦島坂田船", "デキアイ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["僕のシンデレラ", "浦島坂田船", "ボクノシンデレラ"],
["本能全開ソレソレソレ!", "浦島坂田船", "ホンノウゼンカイソレソレソレ"],
["SAILING!!!!!", "浦島坂田船", "セイリング"],
["Q for U", "浦島坂田船", "キューフォーユー"],
 ]
},
{
  date: "1月29日",
  place: "静岡・静岡エコパアリーナ",
  songs: [
["Piece Piece Piece", "浦島坂田船", "ピースピースピース"],
["ポーカーフェイク", "浦島坂田船", "ポーカーフェイク"],
["シャララ", "浦島坂田船", "シャララ"],
["夜咄ディセイブ", "浦島坂田船", "ヨバナシディセイブ"],
["レッドホットクレイジーナイト", "浦島坂田船", "レッドホットクレイジーナイト"],
["Starry Cruise", "浦島坂田船", "スターリークルーズ"],
["マダ", "うらたぬき", "マダ"],
["ゆめのものまね", "となりの坂田。", "ユメノモノマネ"],
["どっちつかずLOVERS", "うらさか", "ドッチツカズラバーズ"],
["月夜", "浦島坂田船", "ツキヨ"],
["ヨニゲーム", "浦島坂田船", "ヨニゲーム"],
["ヒドイヒドラ", "浦島坂田船", "ヒドイヒドラ"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["十六夜ナイトフィーバー", "志麻", "イザヨイナイトフィーバー"],
["DREAM BABY", "センラ", "ドリームベイビー"],
["Ride The Night", "志麻セン", "ライドザナイト"],
["年に一夜の恋模様", "浦島坂田船", "トシニヒトヨノコイモヨウ"],
["流れ星なんていらない", "浦島坂田船", "ナガレボシナンテイラナイ"],
["アンコール", "浦島坂田船", "アンコール"],
["マジカル・ショコラティエ", "浦島坂田船", "マジカルショコラティエ"],
["溺愛", "浦島坂田船", "デキアイ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["僕のシンデレラ", "浦島坂田船", "ボクノシンデレラ"],
["本能全開ソレソレソレ!", "浦島坂田船", "ホンノウゼンカイソレソレソレ"],
["SAILING!!!!!", "浦島坂田船", "セイリング"],
["Q for U", "浦島坂田船", "キューフォーユー"],
]
    }
  ]
);

addLiveTour(
  "浦島坂田船",
  "2022",
  "Happy Halloweeeen 浦島坂田幽霊船 Ψ悪魔執事Ψ あなたが飽くまで仕えます♡ワタクシかなり使えます♡ちゃんとしni9htお仕置きデビか～？？？？",
  [
{
  date: "10月22日",
  place: "兵庫・神戸ワールド記念ホール",
  songs: [

  ]
},
{
  date: "10月23日",
  place: "兵庫・神戸ワールド記念ホール",
  songs: [

  ]
},
{
  date: "10月29日",
  place: "千葉・幕張メッセ国際展示場9・10・11ホール",
  songs: [

  ]
},
{
  date: "10月30日",
  place: "千葉・幕張メッセ国際展示場9・10・11ホール",
  songs: [

  ]
    }
  ]
);





addLiveTour(
  "浦島坂田船",
  "2023",
  "10th Anniversary 浦島坂田船SPECIAL TAG LIVE2023 〜Shima×Senra Ride The Night〜",
  [
{
  date: "2月11日",
  place: "東京・東京ガーデンシアター",
  songs: [

  ]
},
{
  date: "2月12日",
  place: "東京・東京ガーデンシアター",
  songs: [

  ]
    }
  ]
);


addLiveTour(
  "浦島坂田船",
  "2023",
  "10th Anniversary 浦島坂田船SPECIAL TAG LIVE2023 URASAKA KINGDOM 〜Dark Side Fantasy〜",
  [
{
  date: "7月2日 昼の部",
  place: "東京・東京ガーデンシアター",
  songs: [

  ]
},
{
  date: "7月2日 夜の部",
  place: "東京・東京ガーデンシアター",
  songs: [

  ]
    }
  ]
);











 
addLiveTour(
  "浦島坂田船",
  "2023",
  "浦島坂田船 Spring Tour 2023 彩 -sai-",
  [
{
  date: "3月19日",
  place: "栃木・宇都宮市文化会館 大ホール",
  songs: [
["絶景","浦島坂田船","ゼッケイ"],
["燦然賛歌","浦島坂田船","サンゼンサンカ"],
["フランマ","浦島坂田船","フランマ"],
["青く塗り替えろ！","浦島坂田船","アオクヌリカエロ"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["アワ・ダンサー","浦島坂田船","アワダンサー"],
["合戦","浦島坂田船","カッセン"],
["共鳴コントラスト","浦島坂田船","キョウメイコントラスト"],
["ミダリニハルイロ","浦島坂田船","ミダリニハルイロ"],
["返り咲","浦島坂田船","カエリザキ"],
["Delicious","裏千家・センラ","デリシャス"],
["RED","しまさか。","レッド"],
["マウントリタガール","うらしま","マウントリタガール"],
["絶頂讃歌","さかせん","ゼッチョウサンカ"],
["SWEET","志麻セン","スイート"],
["百花繚乱デンジャービーツ","うらさか","ヒャッカリョウランデンジャービーツ"],
["Ring","浦島坂田船","リング"],
["プレゼント","浦島坂田船","プレゼント"],
["飲めや 歌えや 踊れや 騒げ","浦島坂田船","ノメヤウタエヤオドレヤサワゲ"],
["ドラマティックノエル","浦島坂田船","ドラマティックノエル"],
["10 CARAT CHOCOLATE","浦島坂田船","テンカラットチョコレート"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["千本桜 -guitar rock arrangement ver.-","浦島坂田船","センボンザクラギターロックアレンジメントバージョン"],
["RAINBOW","浦島坂田船","レインボー"],
  ]
},
{
  date: "3月21日",
  place: "群馬・高崎芸術劇場 大劇場",
  songs: [
["絶景","浦島坂田船","ゼッケイ"],
["燦然賛歌","浦島坂田船","サンゼンサンカ"],
["フランマ","浦島坂田船","フランマ"],
["青く塗り替えろ！","浦島坂田船","アオクヌリカエロ"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["アワ・ダンサー","浦島坂田船","アワダンサー"],
["合戦","浦島坂田船","カッセン"],
["共鳴コントラスト","浦島坂田船","キョウメイコントラスト"],
["ミダリニハルイロ","浦島坂田船","ミダリニハルイロ"],
["返り咲","浦島坂田船","カエリザキ"],
["Delicious","裏千家・センラ","デリシャス"],
["RED","しまさか。","レッド"],
["マウントリタガール","うらしま","マウントリタガール"],
["絶頂讃歌","さかせん","ゼッチョウサンカ"],
["SWEET","志麻セン","スイート"],
["百花繚乱デンジャービーツ","うらさか","ヒャッカリョウランデンジャービーツ"],
["Ring","浦島坂田船","リング"],
["プレゼント","浦島坂田船","プレゼント"],
["飲めや 歌えや 踊れや 騒げ","浦島坂田船","ノメヤウタエヤオドレヤサワゲ"],
["ドラマティックノエル","浦島坂田船","ドラマティックノエル"],
["10 CARAT CHOCOLATE","浦島坂田船","テンカラットチョコレート"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["千本桜 -guitar rock arrangement ver.-","浦島坂田船","センボンザクラギターロックアレンジメントバージョン"],
["RAINBOW","浦島坂田船","レインボー"],
  ]
},
{
  date: "3月24日",
  place: "鹿児島・川商ホール 第1ホール（鹿児島市民文化ホール）",
  songs: [
["絶景","浦島坂田船","ゼッケイ"],
["燦然賛歌","浦島坂田船","サンゼンサンカ"],
["フランマ","浦島坂田船","フランマ"],
["青く塗り替えろ！","浦島坂田船","アオクヌリカエロ"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["アワ・ダンサー","浦島坂田船","アワダンサー"],
["合戦","浦島坂田船","カッセン"],
["共鳴コントラスト","浦島坂田船","キョウメイコントラスト"],
["ミダリニハルイロ","浦島坂田船","ミダリニハルイロ"],
["返り咲","浦島坂田船","カエリザキ"],
["Delicious","裏千家・センラ","デリシャス"],
["RED","しまさか。","レッド"],
["マウントリタガール","うらしま","マウントリタガール"],
["絶頂讃歌","さかせん","ゼッチョウサンカ"],
["SWEET","志麻セン","スイート"],
["百花繚乱デンジャービーツ","うらさか","ヒャッカリョウランデンジャービーツ"],
["Ring","浦島坂田船","リング"],
["プレゼント","浦島坂田船","プレゼント"],
["飲めや 歌えや 踊れや 騒げ","浦島坂田船","ノメヤウタエヤオドレヤサワゲ"],
["ドラマティックノエル","浦島坂田船","ドラマティックノエル"],
["10 CARAT CHOCOLATE","浦島坂田船","テンカラットチョコレート"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["千本桜 -guitar rock arrangement ver.-","浦島坂田船","センボンザクラギターロックアレンジメントバージョン"],
["RAINBOW","浦島坂田船","レインボー"],
  ]
},
{
  date: "3月26日",
  place: "熊本・熊本城ホール メインホール",
  songs: [
["絶景","浦島坂田船","ゼッケイ"],
["燦然賛歌","浦島坂田船","サンゼンサンカ"],
["フランマ","浦島坂田船","フランマ"],
["青く塗り替えろ！","浦島坂田船","アオクヌリカエロ"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["アワ・ダンサー","浦島坂田船","アワダンサー"],
["合戦","浦島坂田船","カッセン"],
["共鳴コントラスト","浦島坂田船","キョウメイコントラスト"],
["ミダリニハルイロ","浦島坂田船","ミダリニハルイロ"],
["返り咲","浦島坂田船","カエリザキ"],
["Delicious","裏千家・センラ","デリシャス"],
["RED","しまさか。","レッド"],
["マウントリタガール","うらしま","マウントリタガール"],
["絶頂讃歌","さかせん","ゼッチョウサンカ"],
["SWEET","志麻セン","スイート"],
["百花繚乱デンジャービーツ","うらさか","ヒャッカリョウランデンジャービーツ"],
["Ring","浦島坂田船","リング"],
["プレゼント","浦島坂田船","プレゼント"],
["飲めや 歌えや 踊れや 騒げ","浦島坂田船","ノメヤウタエヤオドレヤサワゲ"],
["ドラマティックノエル","浦島坂田船","ドラマティックノエル"],
["10 CARAT CHOCOLATE","浦島坂田船","テンカラットチョコレート"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["千本桜 -guitar rock arrangement ver.-","浦島坂田船","センボンザクラギターロックアレンジメントバージョン"],
["RAINBOW","浦島坂田船","レインボー"],
  ]
},
{
  date: "3月29日",
  place: "滋賀・滋賀県立芸術劇場びわ湖ホール 大ホール",
  songs: [
["絶景","浦島坂田船","ゼッケイ"],
["燦然賛歌","浦島坂田船","サンゼンサンカ"],
["フランマ","浦島坂田船","フランマ"],
["青く塗り替えろ！","浦島坂田船","アオクヌリカエロ"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["アワ・ダンサー","浦島坂田船","アワダンサー"],
["合戦","浦島坂田船","カッセン"],
["共鳴コントラスト","浦島坂田船","キョウメイコントラスト"],
["ミダリニハルイロ","浦島坂田船","ミダリニハルイロ"],
["返り咲","浦島坂田船","カエリザキ"],
["Delicious","裏千家・センラ","デリシャス"],
["RED","しまさか。","レッド"],
["マウントリタガール","うらしま","マウントリタガール"],
["絶頂讃歌","さかせん","ゼッチョウサンカ"],
["SWEET","志麻セン","スイート"],
["百花繚乱デンジャービーツ","うらさか","ヒャッカリョウランデンジャービーツ"],
["Ring","浦島坂田船","リング"],
["プレゼント","浦島坂田船","プレゼント"],
["飲めや 歌えや 踊れや 騒げ","浦島坂田船","ノメヤウタエヤオドレヤサワゲ"],
["ドラマティックノエル","浦島坂田船","ドラマティックノエル"],
["10 CARAT CHOCOLATE","浦島坂田船","テンカラットチョコレート"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["千本桜 -guitar rock arrangement ver.-","浦島坂田船","センボンザクラギターロックアレンジメントバージョン"],
["RAINBOW","浦島坂田船","レインボー"],
  ]
},
{
  date: "3月30日",
  place: "京都・ロームシアター京都 メインホール",
  songs: [
["絶景","浦島坂田船","ゼッケイ"],
["燦然賛歌","浦島坂田船","サンゼンサンカ"],
["フランマ","浦島坂田船","フランマ"],
["青く塗り替えろ！","浦島坂田船","アオクヌリカエロ"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["アワ・ダンサー","浦島坂田船","アワダンサー"],
["合戦","浦島坂田船","カッセン"],
["共鳴コントラスト","浦島坂田船","キョウメイコントラスト"],
["ミダリニハルイロ","浦島坂田船","ミダリニハルイロ"],
["返り咲","浦島坂田船","カエリザキ"],
["Delicious","裏千家・センラ","デリシャス"],
["RED","しまさか。","レッド"],
["マウントリタガール","うらしま","マウントリタガール"],
["絶頂讃歌","さかせん","ゼッチョウサンカ"],
["SWEET","志麻セン","スイート"],
["百花繚乱デンジャービーツ","うらさか","ヒャッカリョウランデンジャービーツ"],
["Ring","浦島坂田船","リング"],
["プレゼント","浦島坂田船","プレゼント"],
["飲めや 歌えや 踊れや 騒げ","浦島坂田船","ノメヤウタエヤオドレヤサワゲ"],
["ドラマティックノエル","浦島坂田船","ドラマティックノエル"],
["10 CARAT CHOCOLATE","浦島坂田船","テンカラットチョコレート"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["千本桜 -guitar rock arrangement ver.-","浦島坂田船","センボンザクラギターロックアレンジメントバージョン"],
["RAINBOW","浦島坂田船","レインボー"],
  ]
},
{
  date: "4月3日",
  place: "香川・レクザムホール 大ホール",
  songs: [
["絶景","浦島坂田船","ゼッケイ"],
["燦然賛歌","浦島坂田船","サンゼンサンカ"],
["フランマ","浦島坂田船","フランマ"],
["青く塗り替えろ！","浦島坂田船","アオクヌリカエロ"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["アワ・ダンサー","浦島坂田船","アワダンサー"],
["合戦","浦島坂田船","カッセン"],
["共鳴コントラスト","浦島坂田船","キョウメイコントラスト"],
["ミダリニハルイロ","浦島坂田船","ミダリニハルイロ"],
["返り咲","浦島坂田船","カエリザキ"],
["Delicious","裏千家・センラ","デリシャス"],
["RED","しまさか。","レッド"],
["マウントリタガール","うらしま","マウントリタガール"],
["絶頂讃歌","さかせん","ゼッチョウサンカ"],
["SWEET","志麻セン","スイート"],
["百花繚乱デンジャービーツ","うらさか","ヒャッカリョウランデンジャービーツ"],
["Ring","浦島坂田船","リング"],
["プレゼント","浦島坂田船","プレゼント"],
["飲めや 歌えや 踊れや 騒げ","浦島坂田船","ノメヤウタエヤオドレヤサワゲ"],
["ドラマティックノエル","浦島坂田船","ドラマティックノエル"],
["10 CARAT CHOCOLATE","浦島坂田船","テンカラットチョコレート"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["千本桜 -guitar rock arrangement ver.-","浦島坂田船","センボンザクラギターロックアレンジメントバージョン"],
["RAINBOW","浦島坂田船","レインボー"],
  ]
},
{
  date: "4月4日",
  place: "岡山・岡山市民会館",
  songs: [
["絶景","浦島坂田船","ゼッケイ"],
["燦然賛歌","浦島坂田船","サンゼンサンカ"],
["フランマ","浦島坂田船","フランマ"],
["青く塗り替えろ！","浦島坂田船","アオクヌリカエロ"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["アワ・ダンサー","浦島坂田船","アワダンサー"],
["合戦","浦島坂田船","カッセン"],
["共鳴コントラスト","浦島坂田船","キョウメイコントラスト"],
["ミダリニハルイロ","浦島坂田船","ミダリニハルイロ"],
["返り咲","浦島坂田船","カエリザキ"],
["Delicious","裏千家・センラ","デリシャス"],
["RED","しまさか。","レッド"],
["マウントリタガール","うらしま","マウントリタガール"],
["絶頂讃歌","さかせん","ゼッチョウサンカ"],
["SWEET","志麻セン","スイート"],
["百花繚乱デンジャービーツ","うらさか","ヒャッカリョウランデンジャービーツ"],
["Ring","浦島坂田船","リング"],
["プレゼント","浦島坂田船","プレゼント"],
["飲めや 歌えや 踊れや 騒げ","浦島坂田船","ノメヤウタエヤオドレヤサワゲ"],
["ドラマティックノエル","浦島坂田船","ドラマティックノエル"],
["10 CARAT CHOCOLATE","浦島坂田船","テンカラットチョコレート"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["千本桜 -guitar rock arrangement ver.-","浦島坂田船","センボンザクラギターロックアレンジメントバージョン"],
["RAINBOW","浦島坂田船","レインボー"],
  ]
},
{
  date: "4月8日",
  place: "岩手・岩手県民会館 大ホール",
  songs: [
["絶景","浦島坂田船","ゼッケイ"],
["燦然賛歌","浦島坂田船","サンゼンサンカ"],
["フランマ","浦島坂田船","フランマ"],
["青く塗り替えろ！","浦島坂田船","アオクヌリカエロ"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["アワ・ダンサー","浦島坂田船","アワダンサー"],
["合戦","浦島坂田船","カッセン"],
["共鳴コントラスト","浦島坂田船","キョウメイコントラスト"],
["ミダリニハルイロ","浦島坂田船","ミダリニハルイロ"],
["返り咲","浦島坂田船","カエリザキ"],
["Delicious","裏千家・センラ","デリシャス"],
["RED","しまさか。","レッド"],
["マウントリタガール","うらしま","マウントリタガール"],
["絶頂讃歌","さかせん","ゼッチョウサンカ"],
["SWEET","志麻セン","スイート"],
["百花繚乱デンジャービーツ","うらさか","ヒャッカリョウランデンジャービーツ"],
["Ring","浦島坂田船","リング"],
["プレゼント","浦島坂田船","プレゼント"],
["飲めや 歌えや 踊れや 騒げ","浦島坂田船","ノメヤウタエヤオドレヤサワゲ"],
["ドラマティックノエル","浦島坂田船","ドラマティックノエル"],
["10 CARAT CHOCOLATE","浦島坂田船","テンカラットチョコレート"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["千本桜 -guitar rock arrangement ver.-","浦島坂田船","センボンザクラギターロックアレンジメントバージョン"],
["RAINBOW","浦島坂田船","レインボー"],
  ]
},
{
  date: "4月9日",
  place: "秋田・あきた芸術劇場ミルハス 大ホール",
  songs: [
["絶景","浦島坂田船","ゼッケイ"],
["燦然賛歌","浦島坂田船","サンゼンサンカ"],
["フランマ","浦島坂田船","フランマ"],
["青く塗り替えろ！","浦島坂田船","アオクヌリカエロ"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["アワ・ダンサー","浦島坂田船","アワダンサー"],
["合戦","浦島坂田船","カッセン"],
["共鳴コントラスト","浦島坂田船","キョウメイコントラスト"],
["ミダリニハルイロ","浦島坂田船","ミダリニハルイロ"],
["返り咲","浦島坂田船","カエリザキ"],
["Delicious","裏千家・センラ","デリシャス"],
["RED","しまさか。","レッド"],
["マウントリタガール","うらしま","マウントリタガール"],
["絶頂讃歌","さかせん","ゼッチョウサンカ"],
["SWEET","志麻セン","スイート"],
["百花繚乱デンジャービーツ","うらさか","ヒャッカリョウランデンジャービーツ"],
["Ring","浦島坂田船","リング"],
["プレゼント","浦島坂田船","プレゼント"],
["飲めや 歌えや 踊れや 騒げ","浦島坂田船","ノメヤウタエヤオドレヤサワゲ"],
["ドラマティックノエル","浦島坂田船","ドラマティックノエル"],
["10 CARAT CHOCOLATE","浦島坂田船","テンカラットチョコレート"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["千本桜 -guitar rock arrangement ver.-","浦島坂田船","センボンザクラギターロックアレンジメントバージョン"],
["RAINBOW","浦島坂田船","レインボー"],
  ]
},
{
  date: "4月15日",
  place: "長野・ホクト文化ホール 大ホール",
  songs: [
["絶景","浦島坂田船","ゼッケイ"],
["燦然賛歌","浦島坂田船","サンゼンサンカ"],
["フランマ","浦島坂田船","フランマ"],
["青く塗り替えろ！","浦島坂田船","アオクヌリカエロ"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["アワ・ダンサー","浦島坂田船","アワダンサー"],
["合戦","浦島坂田船","カッセン"],
["共鳴コントラスト","浦島坂田船","キョウメイコントラスト"],
["ミダリニハルイロ","浦島坂田船","ミダリニハルイロ"],
["返り咲","浦島坂田船","カエリザキ"],
["Delicious","裏千家・センラ","デリシャス"],
["RED","しまさか。","レッド"],
["マウントリタガール","うらしま","マウントリタガール"],
["絶頂讃歌","さかせん","ゼッチョウサンカ"],
["SWEET","志麻セン","スイート"],
["百花繚乱デンジャービーツ","うらさか","ヒャッカリョウランデンジャービーツ"],
["Ring","浦島坂田船","リング"],
["プレゼント","浦島坂田船","プレゼント"],
["飲めや 歌えや 踊れや 騒げ","浦島坂田船","ノメヤウタエヤオドレヤサワゲ"],
["ドラマティックノエル","浦島坂田船","ドラマティックノエル"],
["10 CARAT CHOCOLATE","浦島坂田船","テンカラットチョコレート"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["千本桜 -guitar rock arrangement ver.-","浦島坂田船","センボンザクラギターロックアレンジメントバージョン"],
["RAINBOW","浦島坂田船","レインボー"],
  ]
},
{
  date: "4月16日",
  place: "富山・富山オーバード・ホール",
  songs: [
["絶景","浦島坂田船","ゼッケイ"],
["燦然賛歌","浦島坂田船","サンゼンサンカ"],
["フランマ","浦島坂田船","フランマ"],
["青く塗り替えろ！","浦島坂田船","アオクヌリカエロ"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["アワ・ダンサー","浦島坂田船","アワダンサー"],
["合戦","浦島坂田船","カッセン"],
["共鳴コントラスト","浦島坂田船","キョウメイコントラスト"],
["ミダリニハルイロ","浦島坂田船","ミダリニハルイロ"],
["返り咲","浦島坂田船","カエリザキ"],
["Delicious","裏千家・センラ","デリシャス"],
["RED","しまさか。","レッド"],
["マウントリタガール","うらしま","マウントリタガール"],
["絶頂讃歌","さかせん","ゼッチョウサンカ"],
["SWEET","志麻セン","スイート"],
["百花繚乱デンジャービーツ","うらさか","ヒャッカリョウランデンジャービーツ"],
["Ring","浦島坂田船","リング"],
["プレゼント","浦島坂田船","プレゼント"],
["飲めや 歌えや 踊れや 騒げ","浦島坂田船","ノメヤウタエヤオドレヤサワゲ"],
["ドラマティックノエル","浦島坂田船","ドラマティックノエル"],
["10 CARAT CHOCOLATE","浦島坂田船","テンカラットチョコレート"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["千本桜 -guitar rock arrangement ver.-","浦島坂田船","センボンザクラギターロックアレンジメントバージョン"],
["RAINBOW","浦島坂田船","レインボー"],
  ]
    }
  ]
);


   addLiveTour(
  "浦島坂田船",
  "2023",
  "浦島坂田船 10th Anniversary 〜Memorial Live〜", [
{
  date: "4月29日",
  place: "埼玉・さいたまスーパーアリーナ ＜スタジアムモード＞",
  songs: [
["Carry Forward","浦島坂田船","キャリーフォワード"],
["アイドルっぽい曲を作った。","浦島坂田船","アイドルッポイキョクヲツクッタ"],
["Dreamer","浦島坂田船","ドリーマー"],
["花鳥風月","浦島坂田船","カチョウフウゲツ"],
["海賊船～心の奪い手～","浦島坂田船","カイゾクセンココロノウバイテ"],
["最強ライバル","浦島坂田船","サイキョウライバル"],
["千本桜-guitar rock arrangement ver.-","浦島坂田船","センボンザクラギターロックアレンジメントバージョン"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["スーパーヒーロー","となりの坂田。","スーパーヒーロー"],
["シアワセは台本の外から","うらたぬき","シアワセハダイホンノソトカラ"],
["Trip-Trap, Love Trap!!","うらさか","トリップトラップラブラップ"],
["脳内シェイカー","センラ","ノウナイシェイカー"],
["CRAZY BUNNY!!","志麻","クレイジーバニー"],
["#嘲笑ポラロイド","志麻セン","チョウショウポラロイド"],
["花吹雪","浦島坂田船","ハナフブキ"],
["ARK","浦島坂田船","アーク"],
["Sailor's High","浦島坂田船","セイラーズハイ"],
["わいふぁい暴想ボーイ","浦島坂田船","ワイファイボウソウボーイ"],
["Pathfinders","メドレー","パスファインダーズ"],
["ポーカーフェイク","メドレー","ポーカーフェイク"],
["ハロウ！ゴーストシップ","メドレー","ハロウゴーストシップ"],
["花魁俺嵐コンフュージョン","メドレー","オイランオレランコンフュージョン"],
["明日へのBye Bye","メドレー","アシタヘノバイバイ"],
["Snow melody","メドレー","スノーメロディー"],
["世界で一番好きな名前","メドレー","セカイデイチバンスキナナマエ"],
["Fire◎Flower","メドレー","ファイアフラワー"],
["年に一夜の恋模様","メドレー","トシニヒトヨノコイモヨウ"],
["SHOW MUST GO ON!!","メドレー","ショウマストゴーオン"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["花や、花","浦島坂田船","ハナヤハナ"],
["恋色花火","浦島坂田船","コイイロハナビ"],
["君まであと何メーター","浦島坂田船","キミマデアトナンメーター"],
["Mermaid","浦島坂田船","マーメイド"],
["Shoutër","浦島坂田船","シャウター"],
["Peacock Epoch","浦島坂田船","ピーコックエポック"],
["SAILING!!!!!","浦島坂田船","セイリング"],
]
    }
  ]
);



addLiveTour(
  "浦島坂田船",
  "2023",
  "浦島坂田船 SUMMER TOUR 2023 Plusss",
  [

{
  date: "7月15日",
  place: "愛知・日本ガイシホール",
  songs: [

  ]
},
{
  date: "7月22日",
  place: "広島・広島サンプラザホール",
  songs: [

  ]
},
{
  date: "7月23日",
  place: "広島・広島サンプラザホール",
  songs: [

  ]
},
{
  date: "7月29日",
  place: "宮城・ゼビオアリーナ仙台",
  songs: [

  ]
},
{
  date: "7月30日",
  place: "宮城・ゼビオアリーナ仙台",
  songs: [

  ]
},
{
  date: "8月11日",
  place: "兵庫・神戸ワールド記念ホール",
  songs: [

  ]
},
{
  date: "8月12日",
  place: "兵庫・神戸ワールド記念ホール",
  songs: [

  ]
},
{
  date: "8月14日",
  place: "福岡・福岡国際センター",
  songs: [

  ]
},
{
  date: "8月25日",
  place: "東京・国立代々木競技場 第一体育館",
  songs: [

  ]
},
{
  date: "8月26日",
  place: "東京・国立代々木競技場 第一体育館",
  songs: [
["＋","浦島坂田船","プラス"],
["Q for U","浦島坂田船","キューフォーユー"],
["世界で一番好きな名前","浦島坂田船","セカイデイチバンスキナナマエ"],
["千本桜 -guitar rock arrangement ver.-","浦島坂田船","センボンザクラギターロックアレンジメントバージョン"],
["SHINY","浦島坂田船","シャイニー"],
["明日へのBye Bye","浦島坂田船","アシタヘノバイバイ"],
["シャドウ","浦島坂田船","シャドウ"],
["シンデレラステップ","浦島坂田船","シンデレラステップ"],
["獣王無尽","浦島坂田船","ジュウオウムジン"],
["不可逆性シンクロニシティ","うらたぬき","フカギャクセイシンクロニシティ"],
["I think","センラ","アイシンク"],
["cigar≠kiss","志麻","シガーキス"],
["共鳴Tune!","となりの坂田。","キョウメイチューン"],
["We can fly away, NEW SKY!","うらたぬき / となりの坂田。","ウィーキャンフライアウェイニュースカイ"],
["bloom","志麻 / センラ","ブルーム"],
["Peacock Epoch","浦島坂田船","ピーコックエポック"],
["Crossroads","浦島坂田船","クロスロード"],
["シャララ","浦島坂田船","シャララ"],
["生き証人","浦島坂田船","イキショウニン"],
["アイドル","浦島坂田船","アイドル"],
["Piece Piece Piece","浦島坂田船","ピースピースピース"],
["SUNNY","浦島坂田船","サニー"],
["最強Drive!!","浦島坂田船","サイキョウドライブ"],
["Carry Forward","浦島坂田船","キャリーフォワード"],
["VOYAGE","浦島坂田船","ボヤージュ"],
["Shoutër","浦島坂田船","シャウター"],
["LoveLoveLove","浦島坂田船","ラブラブラブ"],
  ]
},
{
  date: "8月31日",
  place: "北海道・旭川市民文化会館 大ホール",
  songs: [

  ]
},
{
  date: "9月1日",
  place: "北海道・旭川市民文化会館 大ホール",
  songs: [

  ]
},
{
  date: "9月7日",
  place: "石川・本多の森ホール",
  songs: [

  ]
},
{
  date: "9月8日",
  place: "新潟・新潟県民会館 大ホール",
  songs: [

  ]
},
{
  date: "9月17日",
  place: "徳島・アスティとくしま",
  songs: [

  ]
},
{
  date: "9月18日",
  place: "徳島・アスティとくしま",
  songs: [

  ]
},
{
  date: "9月23日",
  place: "静岡・静岡エコパアリーナ",
  songs: [

  ]
    }
  ]
);




addLiveTour(
  "浦島坂田船",
  "2023",
  "Happy Halloweeeen 浦島坂田幽霊船 ～キャッ！とめられないの！？いたずらしニャイで♡でもご主人タマがすこすこすこてぃっしゅHOLD♡～",
  [
{
  date: "10月21日",
  place: "東京・有明アリーナ",
  songs: [
["おーるでい・おーるにゃいと","浦島坂田船","オールデイオールニャイト"],
["カモフラ","浦島坂田船","カモフラ"],
["ハングリー・ゴースト","浦島坂田船","ハングリーゴースト"],
["カレンダーリマインダー","浦島坂田船","カレンダーリマインダー"],
["シンプルLOVE","浦島坂田船","シンプルラブ"],
["プレゼント","浦島坂田船","プレゼント"],
["獣王無尽","浦島坂田船","ジュウオウムジン"],
["すーぱーぬこになりたい","浦島坂田船","スーパーヌコニナリタイ"],
["マジカル・ショコラティエ","浦島坂田船","マジカルショコラティエ"],
["可愛くてごめん","浦島坂田船","カワイクテゴメン"],
["わいふぁい暴想ボーイ","浦島坂田船","ワイファイボウソウボーイ"],
["ジャックオーランタン","浦島坂田船","ジャックオーランタン"],
["うらたねこ♀","うらたぬき","ウラタネコ"],
["回る空うさぎ","となりの坂田。","マワルソラウサギ"],
["NIGHT SCREAMER","センラ","ナイトスクリーマー"],
["イエスタデイはトゥモローを歌わない","志麻","イエスタデイハトゥモローヲウタワナイ"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["百花繚乱デンジャービーツ","浦島坂田船","ヒャッカリョウランデンジャービーツ"],
["SWEET","浦島坂田船","スウィート"],
["PIRATES A GO GO","浦島坂田船","パイレーツアゴーゴー"],
["生き証人","浦島坂田船","イキショウニン"],
["本能全開ソレソレソレ!","浦島坂田船","ホンノウゼンカイソレソレソレ"],
["ハロウ！ゴーストシップ","浦島坂田船","ハロウゴーストシップ"],
["ナイトメリーハッピネス","浦島坂田船","ナイトメリーハッピネス"],
["ヘウレーカ","浦島坂田船","ヘウレーカ"],
  ]
},
{
  date: "10月22日",
  place: "東京・有明アリーナ",
  songs: [
["おーるでい・おーるにゃいと","浦島坂田船","オールデイオールニャイト"],
["カモフラ","浦島坂田船","カモフラ"],
["ハングリー・ゴースト","浦島坂田船","ハングリーゴースト"],
["カレンダーリマインダー","浦島坂田船","カレンダーリマインダー"],
["シンプルLOVE","浦島坂田船","シンプルラブ"],
["プレゼント","浦島坂田船","プレゼント"],
["獣王無尽","浦島坂田船","ジュウオウムジン"],
["すーぱーぬこになりたい","浦島坂田船","スーパーヌコニナリタイ"],
["マジカル・ショコラティエ","浦島坂田船","マジカルショコラティエ"],
["可愛くてごめん","浦島坂田船","カワイクテゴメン"],
["わいふぁい暴想ボーイ","浦島坂田船","ワイファイボウソウボーイ"],
["ジャックオーランタン","浦島坂田船","ジャックオーランタン"],
["うらたねこ♀","うらたぬき","ウラタネコ"],
["回る空うさぎ","となりの坂田。","マワルソラウサギ"],
["NIGHT SCREAMER","センラ","ナイトスクリーマー"],
["イエスタデイはトゥモローを歌わない","志麻","イエスタデイハトゥモローヲウタワナイ"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["百花繚乱デンジャービーツ","浦島坂田船","ヒャッカリョウランデンジャービーツ"],
["SWEET","浦島坂田船","スウィート"],
["PIRATES A GO GO","浦島坂田船","パイレーツアゴーゴー"],
["生き証人","浦島坂田船","イキショウニン"],
["本能全開ソレソレソレ!","浦島坂田船","ホンノウゼンカイソレソレソレ"],
["ハロウ！ゴーストシップ","浦島坂田船","ハロウゴーストシップ"],
["ナイトメリーハッピネス","浦島坂田船","ナイトメリーハッピネス"],
["ヘウレーカ","浦島坂田船","ヘウレーカ"],
  ]
    }
  ]
);



addLiveTour(
  "浦島坂田船",
  "2024",
  "USSS SOLO FESTIVAL 2024 -ソロフェス-",
  [
{
  date: "2月10日",
  place: "東京・東京ガーデンシアター",
  songs: [
["イエスタデイはトゥモローを歌わない","志麻","イエスタデイハトゥモローヲウタワナイ"],
["Violet Thunder","志麻","バイオレットサンダー"],
["FIREFIRE","志麻","ファイアファイア"],
["ダスティピンク","志麻","ダスティピンク"],
["ロストワンの号哭","志麻","ロストワンノゴウコク"],
["敗北の少年","志麻","ハイボクノショウネン"],
["Magiない♡カリグラフィック","志麻","マジナイカリグラフィック"],
["最適解","志麻","サイテキカイ"],
["Freja","センラ","フレイヤ"],
["Sweet Magic","センラ","スイートマジック"],
["Dolce Vita","センラ","ドルチェヴィータ"],
["イカサマライフゲイム","センラ","イカサマライフゲイム"],
["スペシャルパフェ","センラ","スペシャルパフェ"],
["パンペルデュ","センラ","パンペルデュ"],
["脳内シェイカー","センラ","ノウナイシェイカー"],
["スパイラル","センラ","スパイラル"],
["リビングハート","となりの坂田。","リビングハート"],
["共鳴Tune!","となりの坂田。","キョウメイチューン"],
["迷図","となりの坂田。","メイズ"],
["エゴロック","となりの坂田。","エゴロック"],
["スーパーヒーロー","となりの坂田。","スーパーヒーロー"],
["無駄≠無駄","となりの坂田。","ムダムダ"],
["未完成ユートピア","となりの坂田。","ミカンセイユートピア"],
["ゆめのものまね","となりの坂田。","ユメノモノマネ"],
["テオ","うらたぬき","テオ"],
["Come on tonight", "うらたぬき", "カモントゥナイト"],
["ぶーぶー!","うらたぬき","ブーブー"],
["恋のMAGIC","うらたぬき","コイノマジック"],
["全愛不問コスモスナニカ","うらたぬき","ゼンアイフモンコスモスナニカ"],
["ハイヒール・プリンセス","うらたぬき","ハイヒールプリンセス"],
["愚かなオルカ","うらたぬき","オロカナオルカ"],
["Pink","うらたぬき","ピンク"],
["ダンスロボットダンス","うらたぬき","ダンスロボットダンス"],
["たぬきのぽんぽこ祭り","うらたぬき","タヌキノポンポコマツリ"],
["Peacock Epoch","浦島坂田船","ピーコックエポック"],
["おーるでい・おーるにゃいと","浦島坂田船","オールデイオールニャイト"],
["Snow melody","浦島坂田船","スノーメロディー"],
["Dreamer","浦島坂田船","ドリーマー"],
["太陽系デスコ","浦島坂田船","タイヨウケイデスコ"],
["フレンドシップ","浦島坂田船","フレンドシップ"],
  ]
},
{
  date: "2月11日",
  place: "東京・東京ガーデンシアター",
  songs: [
["リビングハート", "となりの坂田。", "リビングハート"],
["共鳴Tune!","となりの坂田。","キョウメイチューン"],
["荒波", "となりの坂田。", "アラナミ"],
["エゴロック", "となりの坂田。", "エゴロック"],
["スーパーヒーロー", "となりの坂田。", "スーパーヒーロー"],
["無駄≠無駄", "となりの坂田。", "ムダムダ"],
["未完成ユートピア", "となりの坂田。", "ミカンセイユートピア"],
["ゆめのものまね", "となりの坂田。", "ユメノモノマネ"],
["テオ", "うらたぬき", "テオ"],
["Come on tonight", "うらたぬき", "カモントゥナイト"],
["ぶーぶー!","うらたぬき","ブーブー"],
["恋のMAGIC","うらたぬき","コイノマジック"],
["全愛不問コスモスナニカ","うらたぬき","ゼンアイフモンコスモスナニカ"],
["グッデストルーラー", "うらたぬき", "グッデストルーラー"],
["愚かなオルカ", "うらたぬき", "オロカナオルカ"],
["Pink","うらたぬき","ピンク"],
["ダンスロボットダンス", "うらたぬき", "ダンスロボットダンス"],
["たぬきのぽんぽこ祭り", "うらたぬき", "タヌキノポンポコマツリ"],
["イエスタデイはトゥモローを歌わない", "志麻", "イエスタデイハトゥモローヲウタワナイ"],
["Violet Thunder", "志麻", "バイオレットサンダー"],
["Oxygen", "志麻", "オキシジェン"],
["ダスティピンク", "志麻", "ダスティピンク"],
["ロストワンの号哭", "志麻", "ロストワンノゴウコク"],
["敗北の少年", "志麻", "ハイボクノショウネン"],
["Magiない♡カリグラフィック", "志麻", "マジナイカリグラフィック"],
["最適解", "志麻", "サイテキカイ"],
["Freja", "センラ", "フレイヤ"],
["Sweet Magic", "センラ", "スイートマジック"],
["色恋", "センラ", "イロコイ"],
["ファーストレディ", "センラ", "ファーストレディ"],
["スペシャルパフェ", "センラ", "スペシャルパフェ"],
["パンペルデュ", "センラ", "パンペルデュ"],
["脳内シェイカー", "センラ", "ノウナイシェイカー"],
["ホシアイ", "センラ", "ホシアイ"],
["Peacock Epoch", "浦島坂田船", "ピーコックエポック"],
["おーるでい・おーるにゃいと","浦島坂田船","オールデイオールニャイト"],
["Snow Melody", "浦島坂田船", "スノーメロディー"],
["Dreamer", "浦島坂田船", "ドリーマー"],
["太陽系デスコ", "浦島坂田船", "タイヨウケイデスコ"],
["フレンドシップ", "浦島坂田船", "フレンドシップ"],
  ]
},
{
  date: "3月3日",
  place: "東京・日本武道館",
  songs: [

 ["たぬきのぽんぽこ祭り","うらたぬき","タヌキノポンポコマツリ"],
["ハイヒール・プリンセス","うらたぬき","ハイヒールプリンセス"],
["恋のMAGIC","うらたぬき","コイノマジック"],
["全愛不問コスモスナニカ","うらたぬき","ゼンアイフモンコスモスナニカ"],
["愚かなオルカ","うらたぬき","オロカナオルカ"],
["セクトの誅罰","うらたぬき","セクトノチュウバツ"],
["Pink","うらたぬき","ピンク"],
["ダンスロボットダンス","うらたぬき","ダンスロボットダンス"],
["テオ","うらたぬき","テオ"],
["リビングハート","となりの坂田。","リビングハート"],
["共鳴Tune!","となりの坂田。","キョウメイチューン"],
["迷図","となりの坂田。","メイズ"],
["ラヴィ","となりの坂田。","ラヴィ"],
["スーパーヒーロー","となりの坂田。","スーパーヒーロー"],
["無駄≠無駄","となりの坂田。","ムダムダ"],
["未完成ユートピア","となりの坂田。","ミカンセイユートピア"],
["ゆめのものまね","となりの坂田。","ユメノモノマネ"],
["Freja","センラ","フレイヤ"],
["Sweet Magic","センラ","スイートマジック"],
["スパイラル","センラ","スパイラル"],
["色恋","センラ","イロコイ"],
["スペシャルパフェ","センラ","スペシャルパフェ"],
["脳内シェイカー","センラ","ノウナイシェイカー"],
["ホシアイ","センラ","ホシアイ"],
["Make a pass","センラ","メイクアパス"],
["イエスタデイはトゥモローを歌わない","志麻","イエスタデイハトゥモローヲウタワナイ"],
["Violet Thunder","志麻","バイオレットサンダー"],
["Oxygen","志麻","オキシジェン"],
["ダスティピンク","志麻","ダスティピンク"],
["ロストワンの号哭","志麻","ロストワンノゴウコク"],
["敗北の少年","志麻","ハイボクノショウネン"],
["Magiない♡カリグラフィック","志麻","マジナイカリグラフィック"],
["CRAZY BUNNY!!","志麻","クレイジーバニー"],
["Peacock Epoch","浦島坂田船","ピーコックエポック"],
["おーるでい・おーるにゃいと","浦島坂田船","オールデイオールニャイト"],
["Snow melody","浦島坂田船","スノーメロディー"],
["フレンドシップ","浦島坂田船","フレンドシップ"],
["太陽系デスコ","浦島坂田船","タイヨウケイデスコ"],
["SAILING!!!!!","浦島坂田船","セイリング"],
  ]
    }
  ]
);





addLiveTour(
  "浦島坂田船",
  "2024",
  "浦島坂田船 Spring Tour 2024 -四春祭-",
  [
{
  date: "3月20日",
  place: "兵庫・アクリエひめじ 大ホール",
  songs: [
 ["SAKURA FUBUKI", "浦島坂田船", "サクラフブキ"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["貴方と云ふ花", "浦島坂田船", "アナタトイウハナ"],
["恋色花火", "浦島坂田船", "コイイロハナビ"],
["グッド・バイ", "浦島坂田船", "グッドバイ"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["アワ・ダンサー", "浦島坂田船", "アワダンサー"],
["大喝采","裏千家","ダイカッサイ"],
["My Sweet Prisoner","しまさか","マイスウィートプリズナー"],
["祭唄", "浦島坂田船", "マツリウタ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["シャドウ", "浦島坂田船", "シャドウ"],
["だれかの心臓になれたなら","うらたぬき","ダレカノシンゾウニナレタナラ"],
["世界寿命と最後の一日","となりの坂田。","セカイジュミョウトサイゴノイチニチ"],
["朧月","センラ","オボロヅキ"],
["バレリーコ","志麻","バレリーコ"],
["Bling-Bang-Bang-Born", "浦島坂田船", "ブリンバンバンボーン"],
["ゼンシンゼンレイ好きさ", "浦島坂田船", "ゼンシンゼンレイスキサ"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["Pathfinders", "浦島坂田船", "パスファインダーズ"],
["花吹雪", "浦島坂田船", "ハナフブキ"],
["完全燃焼～春祭り～", "浦島坂田船", "カンゼンネンショウハルマツリ"],
["合戦", "浦島坂田船", "カッセン"],
["絶景", "浦島坂田船", "ゼッケイ"],
  ]
},
{
  date: "3月23日",
  place: "和歌山・和歌山県民文化会館 大ホール",
  songs: [
 ["SAKURA FUBUKI", "浦島坂田船", "サクラフブキ"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["貴方と云ふ花", "浦島坂田船", "アナタトイウハナ"],
["恋色花火", "浦島坂田船", "コイイロハナビ"],
["グッド・バイ", "浦島坂田船", "グッドバイ"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["アワ・ダンサー", "浦島坂田船", "アワダンサー"],
["SHININ'DAYS", "志麻セン", "シャイニングデイズ"],
["Happy tap people", "うらさか", "ハッピータップピープル"],
["祭唄", "浦島坂田船", "マツリウタ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["シャドウ", "浦島坂田船", "シャドウ"],
["だれかの心臓になれたなら","うらたぬき","ダレカノシンゾウニナレタナラ"],
["世界寿命と最後の一日","となりの坂田。","セカイジュミョウトサイゴノイチニチ"],
["バレリーコ","志麻","バレリーコ"],
["朧月","センラ","オボロヅキ"],
["Bling-Bang-Bang-Born", "浦島坂田船", "ブリンバンバンボーン"],
["ゼンシンゼンレイ好きさ", "浦島坂田船", "ゼンシンゼンレイスキサ"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["Pathfinders", "浦島坂田船", "パスファインダーズ"],
["花吹雪", "浦島坂田船", "ハナフブキ"],
["完全燃焼～春祭り～", "浦島坂田船", "カンゼンネンショウハルマツリ"],
["合戦", "浦島坂田船", "カッセン"],
["絶景", "浦島坂田船", "ゼッケイ"],
  ]
},
{
  date: "3月24日",
  place: "奈良・なら100年会館 大ホール",
  songs: [
 ["SAKURA FUBUKI", "浦島坂田船", "サクラフブキ"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["貴方と云ふ花", "浦島坂田船", "アナタトイウハナ"],
["恋色花火", "浦島坂田船", "コイイロハナビ"],
["グッド・バイ", "浦島坂田船", "グッドバイ"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["アワ・ダンサー", "浦島坂田船", "アワダンサー"],
["マンティス▽クライシス","さかせん","マンティスクライシス"],
["チュルリラ・チュルリラ・ダッダッダ！","うらしま","チュルリラチュルリラダッダッダ"],
["祭唄", "浦島坂田船", "マツリウタ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["シャドウ", "浦島坂田船", "シャドウ"],
["さよならメモリーズ","センラ","サヨナラメモリーズ"],
["ゴーストルール","志麻","ゴーストルール"],
["ロスタイムメモリー","となりの坂田。","ロスタイムメモリー"],
["人生リセットボタン","うらたぬき","ジンセイリセットボタン"],
["Bling-Bang-Bang-Born", "浦島坂田船", "ブリンバンバンボーン"],
["ゼンシンゼンレイ好きさ", "浦島坂田船", "ゼンシンゼンレイスキサ"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["Pathfinders", "浦島坂田船", "パスファインダーズ"],
["花吹雪", "浦島坂田船", "ハナフブキ"],
["完全燃焼～春祭り～", "浦島坂田船", "カンゼンネンショウハルマツリ"],
["合戦", "浦島坂田船", "カッセン"],
["絶景", "浦島坂田船", "ゼッケイ"],
  ]
},
{
  date: "3月28日",
  place: "福井・フェニックスプラザ 大ホール",
  songs: [
 ["SAKURA FUBUKI", "浦島坂田船", "サクラフブキ"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["貴方と云ふ花", "浦島坂田船", "アナタトイウハナ"],
["恋色花火", "浦島坂田船", "コイイロハナビ"],
["グッド・バイ", "浦島坂田船", "グッドバイ"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["アワ・ダンサー", "浦島坂田船", "アワダンサー"],
["SHININ'DAYS", "志麻セン", "シャイニングデイズ"],
["Happy tap people", "うらさか", "ハッピータップピープル"],
["祭唄", "浦島坂田船", "マツリウタ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["シャドウ", "浦島坂田船", "シャドウ"],
["だれかの心臓になれたなら","うらたぬき","ダレカノシンゾウニナレタナラ"],
["世界寿命と最後の一日","となりの坂田。","セカイジュミョウトサイゴノイチニチ"],
["バレリーコ","志麻","バレリーコ"],
["朧月","センラ","オボロヅキ"],
["Bling-Bang-Bang-Born", "浦島坂田船", "ブリンバンバンボーン"],
["ゼンシンゼンレイ好きさ", "浦島坂田船", "ゼンシンゼンレイスキサ"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["Pathfinders", "浦島坂田船", "パスファインダーズ"],
["花吹雪", "浦島坂田船", "ハナフブキ"],
["完全燃焼～春祭り～", "浦島坂田船", "カンゼンネンショウハルマツリ"],
["合戦", "浦島坂田船", "カッセン"],
["絶景", "浦島坂田船", "ゼッケイ"],
  ]
},
{
  date: "3月29日",
  place: "三重・四日市市文化会館 第1ホール",
  songs: [
 ["SAKURA FUBUKI", "浦島坂田船", "サクラフブキ"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["貴方と云ふ花", "浦島坂田船", "アナタトイウハナ"],
["恋色花火", "浦島坂田船", "コイイロハナビ"],
["グッド・バイ", "浦島坂田船", "グッドバイ"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["アワ・ダンサー", "浦島坂田船", "アワダンサー"],
["チュルリラ・チュルリラ・ダッダッダ！","うらしま","チュルリラチュルリラダッダッダ"],
["マンティス▽クライシス","さかせん","マンティスクライシス"],
["祭唄", "浦島坂田船", "マツリウタ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["シャドウ", "浦島坂田船", "シャドウ"],
["さよならメモリーズ","センラ","サヨナラメモリーズ"],
["ゴーストルール","志麻","ゴーストルール"],
["ロスタイムメモリー","となりの坂田。","ロスタイムメモリー"],
["人生リセットボタン","うらたぬき","ジンセイリセットボタン"],
["Bling-Bang-Bang-Born", "浦島坂田船", "ブリンバンバンボーン"],
["ゼンシンゼンレイ好きさ", "浦島坂田船", "ゼンシンゼンレイスキサ"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["Pathfinders", "浦島坂田船", "パスファインダーズ"],
["花吹雪", "浦島坂田船", "ハナフブキ"],
["完全燃焼～春祭り～", "浦島坂田船", "カンゼンネンショウハルマツリ"],
["合戦", "浦島坂田船", "カッセン"],
["絶景", "浦島坂田船", "ゼッケイ"],
  ]
},
{
  date: "3月31日",
  place: "愛知・名古屋国際会議場 センチュリーホール",
  songs: [
 ["SAKURA FUBUKI", "浦島坂田船", "サクラフブキ"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["貴方と云ふ花", "浦島坂田船", "アナタトイウハナ"],
["恋色花火", "浦島坂田船", "コイイロハナビ"],
["グッド・バイ", "浦島坂田船", "グッドバイ"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["アワ・ダンサー", "浦島坂田船", "アワダンサー"],
["チュルリラ・チュルリラ・ダッダッダ！","うらしま","チュルリラチュルリラダッダッダ"],
["マンティス▽クライシス","さかせん","マンティスクライシス"],
["祭唄", "浦島坂田船", "マツリウタ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["シャドウ", "浦島坂田船", "シャドウ"],
["だれかの心臓になれたなら","うらたぬき","ダレカノシンゾウニナレタナラ"],
["世界寿命と最後の一日","となりの坂田。","セカイジュミョウトサイゴノイチニチ"],
["バレリーコ","志麻","バレリーコ"],
["朧月","センラ","オボロヅキ"],
["Bling-Bang-Bang-Born", "浦島坂田船", "ブリンバンバンボーン"],
["ゼンシンゼンレイ好きさ", "浦島坂田船", "ゼンシンゼンレイスキサ"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["Pathfinders", "浦島坂田船", "パスファインダーズ"],
["花吹雪", "浦島坂田船", "ハナフブキ"],
["完全燃焼～春祭り～", "浦島坂田船", "カンゼンネンショウハルマツリ"],
["合戦", "浦島坂田船", "カッセン"],
["絶景", "浦島坂田船", "ゼッケイ"],
  ]
},
{
  date: "4月5日",
  place: "福岡・北九州ソレイユホール",
  songs: [
 ["SAKURA FUBUKI", "浦島坂田船", "サクラフブキ"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["貴方と云ふ花", "浦島坂田船", "アナタトイウハナ"],
["恋色花火", "浦島坂田船", "コイイロハナビ"],
["グッド・バイ", "浦島坂田船", "グッドバイ"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["アワ・ダンサー", "浦島坂田船", "アワダンサー"],
["My Sweet Prisoner","しまさか","マイスウィートプリズナー"],
["大喝采","裏千家","ダイカッサイ"],
["祭唄", "浦島坂田船", "マツリウタ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["シャドウ", "浦島坂田船", "シャドウ"],
["だれかの心臓になれたなら","うらたぬき","ダレカノシンゾウニナレタナラ"],
["世界寿命と最後の一日","となりの坂田。","セカイジュミョウトサイゴノイチニチ"],
["朧月","センラ","オボロヅキ"],
["バレリーコ","志麻","バレリーコ"],
["Bling-Bang-Bang-Born", "浦島坂田船", "ブリンバンバンボーン"],
["ゼンシンゼンレイ好きさ", "浦島坂田船", "ゼンシンゼンレイスキサ"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["Pathfinders", "浦島坂田船", "パスファインダーズ"],
["花吹雪", "浦島坂田船", "ハナフブキ"],
["完全燃焼～春祭り～", "浦島坂田船", "カンゼンネンショウハルマツリ"],
["合戦", "浦島坂田船", "カッセン"],
["絶景", "浦島坂田船", "ゼッケイ"],
  ]
},
{
  date: "4月7日",
  place: "高知・高知県立県民文化ホール オレンジホール",
  songs: [
 ["SAKURA FUBUKI", "浦島坂田船", "サクラフブキ"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["貴方と云ふ花", "浦島坂田船", "アナタトイウハナ"],
["恋色花火", "浦島坂田船", "コイイロハナビ"],
["グッド・バイ", "浦島坂田船", "グッドバイ"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["アワ・ダンサー", "浦島坂田船", "アワダンサー"],
["SHININ'DAYS", "志麻セン", "シャイニングデイズ"],
["Happy tap people", "うらさか", "ハッピータップピープル"],
["祭唄", "浦島坂田船", "マツリウタ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["シャドウ", "浦島坂田船", "シャドウ"],
["さよならメモリーズ","センラ","サヨナラメモリーズ"],
["ゴーストルール","志麻","ゴーストルール"],
["ロスタイムメモリー","となりの坂田。","ロスタイムメモリー"],
["人生リセットボタン","うらたぬき","ジンセイリセットボタン"],
["Bling-Bang-Bang-Born", "浦島坂田船", "ブリンバンバンボーン"],
["ゼンシンゼンレイ好きさ", "浦島坂田船", "ゼンシンゼンレイスキサ"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["Pathfinders", "浦島坂田船", "パスファインダーズ"],
["花吹雪", "浦島坂田船", "ハナフブキ"],
["完全燃焼～春祭り～", "浦島坂田船", "カンゼンネンショウハルマツリ"],
["合戦", "浦島坂田船", "カッセン"],
["絶景", "浦島坂田船", "ゼッケイ"],
  ]
},
{
  date: "4月12日",
  place: "北海道・札幌文化芸術劇場 hitaru",
  songs: [
 ["SAKURA FUBUKI", "浦島坂田船", "サクラフブキ"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["貴方と云ふ花", "浦島坂田船", "アナタトイウハナ"],
["恋色花火", "浦島坂田船", "コイイロハナビ"],
["グッド・バイ", "浦島坂田船", "グッドバイ"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["アワ・ダンサー", "浦島坂田船", "アワダンサー"],
["チュルリラ・チュルリラ・ダッダッダ！","うらしま","チュルリラチュルリラダッダッダ"],
["マンティス▽クライシス","さかせん","マンティスクライシス"],
["祭唄", "浦島坂田船", "マツリウタ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["シャドウ", "浦島坂田船", "シャドウ"],
["さよならメモリーズ","センラ","サヨナラメモリーズ"],
["ゴーストルール","志麻","ゴーストルール"],
["ロスタイムメモリー","となりの坂田。","ロスタイムメモリー"],
["人生リセットボタン","うらたぬき","ジンセイリセットボタン"],
["Bling-Bang-Bang-Born", "浦島坂田船", "ブリンバンバンボーン"],
["ゼンシンゼンレイ好きさ", "浦島坂田船", "ゼンシンゼンレイスキサ"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["Pathfinders", "浦島坂田船", "パスファインダーズ"],
["花吹雪", "浦島坂田船", "ハナフブキ"],
["完全燃焼～春祭り～", "浦島坂田船", "カンゼンネンショウハルマツリ"],
["合戦", "浦島坂田船", "カッセン"],
["絶景", "浦島坂田船", "ゼッケイ"],
  ]
},
{
  date: "4月14日",
  place: "青森・リンクステーションホール青森",
  songs: [
 ["SAKURA FUBUKI", "浦島坂田船", "サクラフブキ"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["貴方と云ふ花", "浦島坂田船", "アナタトイウハナ"],
["恋色花火", "浦島坂田船", "コイイロハナビ"],
["グッド・バイ", "浦島坂田船", "グッドバイ"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["アワ・ダンサー", "浦島坂田船", "アワダンサー"],
["SHININ'DAYS", "志麻セン", "シャイニングデイズ"],
["Happy tap people", "うらさか", "ハッピータップピープル"],
["祭唄", "浦島坂田船", "マツリウタ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["シャドウ", "浦島坂田船", "シャドウ"],
["だれかの心臓になれたなら","うらたぬき","ダレカノシンゾウニナレタナラ"],
["世界寿命と最後の一日","となりの坂田。","セカイジュミョウトサイゴノイチニチ"],
["朧月","センラ","オボロヅキ"],
["バレリーコ", "志麻", "バレリーコ"],
["Bling-Bang-Bang-Born", "浦島坂田船", "ブリンバンバンボーン"],
["ゼンシンゼンレイ好きさ", "浦島坂田船", "ゼンシンゼンレイスキサ"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["Pathfinders", "浦島坂田船", "パスファインダーズ"],
["花吹雪", "浦島坂田船", "ハナフブキ"],
["完全燃焼～春祭り～", "浦島坂田船", "カンゼンネンショウハルマツリ"],
["合戦", "浦島坂田船", "カッセン"],
["絶景", "浦島坂田船", "ゼッケイ"],
  ]
},
{
  date: "4月19日",
  place: "山口・周南市文化会館",
  songs: [
 ["SAKURA FUBUKI", "浦島坂田船", "サクラフブキ"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["貴方と云ふ花", "浦島坂田船", "アナタトイウハナ"],
["恋色花火", "浦島坂田船", "コイイロハナビ"],
["グッド・バイ", "浦島坂田船", "グッドバイ"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["アワ・ダンサー", "浦島坂田船", "アワダンサー"],
["マンティス▽クライシス","さかせん","マンティスクライシス"],
["チュルリラ・チュルリラ・ダッダッダ！","うらしま","チュルリラチュルリラダッダッダ"],
    ["祭唄", "浦島坂田船", "マツリウタ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["シャドウ", "浦島坂田船", "シャドウ"],
["さよならメモリーズ","センラ","サヨナラメモリーズ"],
["ゴーストルール","志麻","ゴーストルール"],
["ロスタイムメモリー","となりの坂田。","ロスタイムメモリー"],
["人生リセットボタン","うらたぬき","ジンセイリセットボタン"],
["Bling-Bang-Bang-Born", "浦島坂田船", "ブリンバンバンボーン"],
["ゼンシンゼンレイ好きさ", "浦島坂田船", "ゼンシンゼンレイスキサ"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["Pathfinders", "浦島坂田船", "パスファインダーズ"],
["花吹雪", "浦島坂田船", "ハナフブキ"],
["完全燃焼～春祭り～", "浦島坂田船", "カンゼンネンショウハルマツリ"],
["合戦", "浦島坂田船", "カッセン"],
["絶景", "浦島坂田船", "ゼッケイ"],
  ]
},
{
  date: "4月21日",
  place: "鳥取・米子コンベンションセンター BiG SHiP",
  songs: [
 ["SAKURA FUBUKI", "浦島坂田船", "サクラフブキ"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["貴方と云ふ花", "浦島坂田船", "アナタトイウハナ"],
["恋色花火", "浦島坂田船", "コイイロハナビ"],
["グッド・バイ", "浦島坂田船", "グッドバイ"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["アワ・ダンサー", "浦島坂田船", "アワダンサー"],
    ["大喝采","裏千家","ダイカッサイ"],
["My Sweet Prisoner","しまさか","マイスウィートプリズナー"],
["祭唄", "浦島坂田船", "マツリウタ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["シャドウ", "浦島坂田船", "シャドウ"],
["だれかの心臓になれたなら","うらたぬき","ダレカノシンゾウニナレタナラ"],
["世界寿命と最後の一日","となりの坂田。","セカイジュミョウトサイゴノイチニチ"],
["朧月","センラ","オボロヅキ"],
["バレリーコ","志麻","バレリーコ"],
    ["Bling-Bang-Bang-Born", "浦島坂田船", "ブリンバンバンボーン"],
["ゼンシンゼンレイ好きさ", "浦島坂田船", "ゼンシンゼンレイスキサ"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["Pathfinders", "浦島坂田船", "パスファインダーズ"],
["花吹雪", "浦島坂田船", "ハナフブキ"],
["完全燃焼～春祭り～", "浦島坂田船", "カンゼンネンショウハルマツリ"],
["合戦", "浦島坂田船", "カッセン"],
["絶景", "浦島坂田船", "ゼッケイ"],
  ]
},
{
  date: "4月27日",
  place: "東京・有明アリーナ",
  songs: [
 ["SAKURA FUBUKI", "浦島坂田船", "サクラフブキ"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["貴方と云ふ花", "浦島坂田船", "アナタトイウハナ"],
["恋色花火", "浦島坂田船", "コイイロハナビ"],
["グッド・バイ", "浦島坂田船", "グッドバイ"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["アワ・ダンサー", "浦島坂田船", "アワダンサー"],
["チュルリラ・チュルリラ・ダッダッダ！","うらしま","チュルリラチュルリラダッダッダ"],
["マンティス▽クライシス","さかせん","マンティスクライシス"],
["祭唄", "浦島坂田船", "マツリウタ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["シャドウ", "浦島坂田船", "シャドウ"],
["朧月","センラ","オボロヅキ"],
["ゴーストルール","志麻","ゴーストルール"],
["世界寿命と最後の一日","となりの坂田。","セカイジュミョウトサイゴノイチニチ"],
["人生リセットボタン","うらたぬき","ジンセイリセットボタン"],   
["Bling-Bang-Bang-Born", "浦島坂田船", "ブリンバンバンボーン"],
["ゼンシンゼンレイ好きさ", "浦島坂田船", "ゼンシンゼンレイスキサ"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["Pathfinders", "浦島坂田船", "パスファインダーズ"],
["花吹雪", "浦島坂田船", "ハナフブキ"],
["完全燃焼～春祭り～", "浦島坂田船", "カンゼンネンショウハルマツリ"],
["合戦", "浦島坂田船", "カッセン"],
["絶景", "浦島坂田船", "ゼッケイ"],
["花や、花", "浦島坂田船", "ハナヤハナ"],
  ]
},
{
  date: "4月28日",
  place: "東京・有明アリーナ",
  songs: [
    ["SAKURA FUBUKI", "浦島坂田船", "サクラフブキ"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["貴方と云ふ花", "浦島坂田船", "アナタトイウハナ"],
["恋色花火", "浦島坂田船", "コイイロハナビ"],
["グッド・バイ", "浦島坂田船", "グッドバイ"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["アワ・ダンサー", "浦島坂田船", "アワダンサー"],
["SHININ'DAYS", "志麻セン", "シャイニングデイズ"],
["Happy tap people", "うらさか", "ハッピータップピープル"],
["祭唄", "浦島坂田船", "マツリウタ"],
["鈍色Wheels", "浦島坂田船", "ニビイロホイールズ"],
["シャドウ", "浦島坂田船", "シャドウ"],
["だれかの心臓になれたなら", "うらたぬき", "ダレカノシンゾウニナレタナラ"],
["ロスタイムメモリー", "となりの坂田。", "ロスタイムメモリー"],
["さよならメモリーズ", "センラ", "サヨナラメモリーズ"],
["バレリーコ", "志麻", "バレリーコ"],
["Bling-Bang-Bang-Born", "浦島坂田船", "ブリンバンバンボーン"],
["ゼンシンゼンレイ好きさ", "浦島坂田船", "ゼンシンゼンレイスキサ"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["Pathfinders", "浦島坂田船", "パスファインダーズ"],
["花吹雪", "浦島坂田船", "ハナフブキ"],
["完全燃焼～春祭り～", "浦島坂田船", "カンゼンネンショウハルマツリ"],
["合戦", "浦島坂田船", "カッセン"],
["絶景", "浦島坂田船", "ゼッケイ"],
["花や、花", "浦島坂田船", "ハナヤハナ"],
]
    }
  ]
);



addLiveTour(
  "浦島坂田船",
  "2024",
  "浦島坂田船 SUMMER TOUR 2024 Weddiing",
  [
{
  date: "7月20日",
  place: "広島・広島サンプラザホール",
  songs: [
["アダマントリング","浦島坂田船","アダマントリング"],
["アイドルっぽい曲を作った。","浦島坂田船","アイドルッポイキョクヲツクッタ"],
["僕のシンデレラ","浦島坂田船","ボクノシンデレラ"],
["世界で一番好きな名前","浦島坂田船","セカイデイチバンスキナナマエ"],
["SHOW MUST GO ON!!","浦島坂田船","ショウマストゴーオン"],
["Save Me","浦島坂田船","セーブミー"],
["ホワイトプリンス","浦島坂田船","ホワイトプリンス"],
["Mermaid","浦島坂田船","マーメイド"],
["フレテ","浦島坂田船","フレテ"],
["シックスセンス・ベル","浦島坂田船","シックスセンスベル"],
["幸せのレシピ","浦島坂田船","シアワセノレシピ"],
["メリメリ","うらたぬき","メリメリ"],
["マグネティック","となりの坂田。","マグネティック"],
["妄想注意報","うらさか","モウソウチュウイホウ"],
["Killer Killer My Love","志麻","キラーキラーマイラブ"],
["FlashBack","センラ","フラッシュバック"],
["Treat You Better","志麻セン","トリートユーベター"],
["シャララ","浦島坂田船","シャララ"],
["むしろ Why?","浦島坂田船","ムシロホワイ"],
["生き証人","浦島坂田船","イキショウニン"],
["フレンドシップ","浦島坂田船","フレンドシップ"],
["＋","浦島坂田船","プラス"],
["ハイサイ守護礼","浦島坂田船","ハイサイシュゴレイ"],
["ヘウレーカ","浦島坂田船","ヘウレーカ"],
  ]
},
{
  date: "7月21日",
  place: "広島・広島サンプラザホール",
  songs: [
["アダマントリング","浦島坂田船","アダマントリング"],
["アイドルっぽい曲を作った。","浦島坂田船","アイドルッポイキョクヲツクッタ"],
["僕のシンデレラ","浦島坂田船","ボクノシンデレラ"],
["世界で一番好きな名前","浦島坂田船","セカイデイチバンスキナナマエ"],
["SHOW MUST GO ON!!","浦島坂田船","ショウマストゴーオン"],
["Save Me","浦島坂田船","セーブミー"],
["ホワイトプリンス","浦島坂田船","ホワイトプリンス"],
["君まであと何メーター","浦島坂田船","キミマデアトナンメーター"],
["フレテ","浦島坂田船","フレテ"],
["シックスセンス・ベル","浦島坂田船","シックスセンスベル"],
["幸せのレシピ","浦島坂田船","シアワセノレシピ"],
["メリメリ","うらたぬき","メリメリ"],
["マグネティック","となりの坂田。","マグネティック"],
["妄想注意報","うらさか","モウソウチュウイホウ"],
["Killer Killer My Love","志麻","キラーキラーマイラブ"],
["FlashBack","センラ","フラッシュバック"],
["Treat You Better","志麻セン","トリートユーベター"],
["シャララ","浦島坂田船","シャララ"],
["むしろ Why?","浦島坂田船","ムシロホワイ"],
["レッドホットクレイジーナイト","浦島坂田船","レッドホットクレイジーナイト"],
["フレンドシップ","浦島坂田船","フレンドシップ"],
["＋","浦島坂田船","プラス"],
["ハイサイ守護礼","浦島坂田船","ハイサイシュゴレイ"],
["SAILING!!!!!","浦島坂田船","セイリング"],

  ]
},
{
  date: "7月27日",
  place: "宮城・ゼビオアリーナ仙台",
  songs: [
["アダマントリング","浦島坂田船","アダマントリング"],
["アイドルっぽい曲を作った。","浦島坂田船","アイドルッポイキョクヲツクッタ"],
["僕のシンデレラ","浦島坂田船","ボクノシンデレラ"],
["世界で一番好きな名前","浦島坂田船","セカイデイチバンスキナナマエ"],
["SHOW MUST GO ON!!","浦島坂田船","ショウマストゴーオン"],
["Save Me","浦島坂田船","セーブミー"],
["ホワイトプリンス","浦島坂田船","ホワイトプリンス"],
["Mermaid","浦島坂田船","マーメイド"],
["フレテ","浦島坂田船","フレテ"],
["シックスセンス・ベル","浦島坂田船","シックスセンスベル"],
["幸せのレシピ","浦島坂田船","シアワセノレシピ"],
["メリメリ","うらたぬき","メリメリ"],
["マグネティック","となりの坂田。","マグネティック"],
["妄想注意報","うらさか","モウソウチュウイホウ"],
["Killer Killer My Love","志麻","キラーキラーマイラブ"],
["FlashBack","センラ","フラッシュバック"],
["Treat You Better","志麻セン","トリートユーベター"],
["シャララ","浦島坂田船","シャララ"],
["むしろ Why?","浦島坂田船","ムシロホワイ"],
["生き証人","浦島坂田船","イキショウニン"],
["フレンドシップ","浦島坂田船","フレンドシップ"],
["＋","浦島坂田船","プラス"],
["ハイサイ守護礼","浦島坂田船","ハイサイシュゴレイ"],
["ヘウレーカ","浦島坂田船","ヘウレーカ"],

  ]
},
{
  date: "7月28日",
  place: "宮城・ゼビオアリーナ仙台",
  songs: [
["アダマントリング","浦島坂田船","アダマントリング"],
["アイドルっぽい曲を作った。","浦島坂田船","アイドルッポイキョクヲツクッタ"],
["僕のシンデレラ","浦島坂田船","ボクノシンデレラ"],
["世界で一番好きな名前","浦島坂田船","セカイデイチバンスキナナマエ"],
["SHOW MUST GO ON!!","浦島坂田船","ショウマストゴーオン"],
["Save Me","浦島坂田船","セーブミー"],
["ホワイトプリンス","浦島坂田船","ホワイトプリンス"],
["君まであと何メーター","浦島坂田船","キミマデアトナンメーター"],
["フレテ","浦島坂田船","フレテ"],
["シックスセンス・ベル","浦島坂田船","シックスセンスベル"],
["幸せのレシピ","浦島坂田船","シアワセノレシピ"],
["メリメリ","うらたぬき","メリメリ"],
["マグネティック","となりの坂田。","マグネティック"],
["妄想注意報","うらさか","モウソウチュウイホウ"],
["Killer Killer My Love","志麻","キラーキラーマイラブ"],
["FlashBack","センラ","フラッシュバック"],
["Treat You Better","志麻セン","トリートユーベター"],
["シャララ","浦島坂田船","シャララ"],
["むしろ Why?","浦島坂田船","ムシロホワイ"],
["レッドホットクレイジーナイト","浦島坂田船","レッドホットクレイジーナイト"],
["フレンドシップ","浦島坂田船","フレンドシップ"],
["＋","浦島坂田船","プラス"],
["ハイサイ守護礼","浦島坂田船","ハイサイシュゴレイ"],
["SAILING!!!!!","浦島坂田船","セイリング"],

  ]
},
{
  date: "8月3日",
  place: "千葉・LaLa arena TOKYO-BAY",
  songs: [
["アダマントリング","浦島坂田船","アダマントリング"],
["アイドルっぽい曲を作った。","浦島坂田船","アイドルッポイキョクヲツクッタ"],
["僕のシンデレラ","浦島坂田船","ボクノシンデレラ"],
["世界で一番好きな名前","浦島坂田船","セカイデイチバンスキナナマエ"],
["SHOW MUST GO ON!!","浦島坂田船","ショウマストゴーオン"],
["Save Me","浦島坂田船","セーブミー"],
["ホワイトプリンス","浦島坂田船","ホワイトプリンス"],
["Mermaid","浦島坂田船","マーメイド"],
["フレテ","浦島坂田船","フレテ"],
["シックスセンス・ベル","浦島坂田船","シックスセンスベル"],
["幸せのレシピ","浦島坂田船","シアワセノレシピ"],
["メリメリ","うらたぬき","メリメリ"],
["マグネティック","となりの坂田。","マグネティック"],
["妄想注意報","うらさか","モウソウチュウイホウ"],
["Killer Killer My Love","志麻","キラーキラーマイラブ"],
["FlashBack","センラ","フラッシュバック"],
["Treat You Better","志麻セン","トリートユーベター"],
["シャララ","浦島坂田船","シャララ"],
["むしろ Why?","浦島坂田船","ムシロホワイ"],
["生き証人","浦島坂田船","イキショウニン"],
["フレンドシップ","浦島坂田船","フレンドシップ"],
["＋","浦島坂田船","プラス"],
["ハイサイ守護礼","浦島坂田船","ハイサイシュゴレイ"],
["ヘウレーカ","浦島坂田船","ヘウレーカ"],

  ]
},
{
  date: "8月4日",
  place: "千葉・LaLa arena TOKYO-BAY",
  songs: [
["アダマントリング","浦島坂田船","アダマントリング"],
["アイドルっぽい曲を作った。","浦島坂田船","アイドルッポイキョクヲツクッタ"],
["僕のシンデレラ","浦島坂田船","ボクノシンデレラ"],
["世界で一番好きな名前","浦島坂田船","セカイデイチバンスキナナマエ"],
["SHOW MUST GO ON!!","浦島坂田船","ショウマストゴーオン"],
["Save Me","浦島坂田船","セーブミー"],
["ホワイトプリンス","浦島坂田船","ホワイトプリンス"],
["君まであと何メーター","浦島坂田船","キミマデアトナンメーター"],
["フレテ","浦島坂田船","フレテ"],
["シックスセンス・ベル","浦島坂田船","シックスセンスベル"],
["幸せのレシピ","浦島坂田船","シアワセノレシピ"],
["メリメリ","うらたぬき","メリメリ"],
["マグネティック","となりの坂田。","マグネティック"],
["妄想注意報","うらさか","モウソウチュウイホウ"],
["Killer Killer My Love","志麻","キラーキラーマイラブ"],
["FlashBack","センラ","フラッシュバック"],
["Treat You Better","志麻セン","トリートユーベター"],
["シャララ","浦島坂田船","シャララ"],
["むしろ Why?","浦島坂田船","ムシロホワイ"],
["レッドホットクレイジーナイト","浦島坂田船","レッドホットクレイジーナイト"],
["フレンドシップ","浦島坂田船","フレンドシップ"],
["＋","浦島坂田船","プラス"],
["ハイサイ守護礼","浦島坂田船","ハイサイシュゴレイ"],
["SAILING!!!!!","浦島坂田船","セイリング"],

  ]
},
{
  date: "8月24日",
  place: "福岡・福岡国際センター",
  songs: [
["アダマントリング","浦島坂田船","アダマントリング"],
["アイドルっぽい曲を作った。","浦島坂田船","アイドルッポイキョクヲツクッタ"],
["僕のシンデレラ","浦島坂田船","ボクノシンデレラ"],
["世界で一番好きな名前","浦島坂田船","セカイデイチバンスキナナマエ"],
["SHOW MUST GO ON!!","浦島坂田船","ショウマストゴーオン"],
["Save Me","浦島坂田船","セーブミー"],
["ホワイトプリンス","浦島坂田船","ホワイトプリンス"],
["Mermaid","浦島坂田船","マーメイド"],
["フレテ","浦島坂田船","フレテ"],
["シックスセンス・ベル","浦島坂田船","シックスセンスベル"],
["幸せのレシピ","浦島坂田船","シアワセノレシピ"],
["メリメリ","うらたぬき","メリメリ"],
["マグネティック","となりの坂田。","マグネティック"],
["妄想注意報","うらさか","モウソウチュウイホウ"],
["Killer Killer My Love","志麻","キラーキラーマイラブ"],
["FlashBack","センラ","フラッシュバック"],
["Treat You Better","志麻セン","トリートユーベター"],
["シャララ","浦島坂田船","シャララ"],
["むしろ Why?","浦島坂田船","ムシロホワイ"],
["生き証人","浦島坂田船","イキショウニン"],
["フレンドシップ","浦島坂田船","フレンドシップ"],
["＋","浦島坂田船","プラス"],
["ハイサイ守護礼","浦島坂田船","ハイサイシュゴレイ"],
["ヘウレーカ","浦島坂田船","ヘウレーカ"],

  ]
},
{
  date: "8月25日",
  place: "福岡・福岡国際センター",
  songs: [
["アダマントリング","浦島坂田船","アダマントリング"],
["アイドルっぽい曲を作った。","浦島坂田船","アイドルッポイキョクヲツクッタ"],
["僕のシンデレラ","浦島坂田船","ボクノシンデレラ"],
["世界で一番好きな名前","浦島坂田船","セカイデイチバンスキナナマエ"],
["SHOW MUST GO ON!!","浦島坂田船","ショウマストゴーオン"],
["Save Me","浦島坂田船","セーブミー"],
["ホワイトプリンス","浦島坂田船","ホワイトプリンス"],
["君まであと何メーター","浦島坂田船","キミマデアトナンメーター"],
["フレテ","浦島坂田船","フレテ"],
["シックスセンス・ベル","浦島坂田船","シックスセンスベル"],
["幸せのレシピ","浦島坂田船","シアワセノレシピ"],
["メリメリ","うらたぬき","メリメリ"],
["マグネティック","となりの坂田。","マグネティック"],
["妄想注意報","うらさか","モウソウチュウイホウ"],
["Killer Killer My Love","志麻","キラーキラーマイラブ"],
["FlashBack","センラ","フラッシュバック"],
["Treat You Better","志麻セン","トリートユーベター"],
["シャララ","浦島坂田船","シャララ"],
["むしろ Why?","浦島坂田船","ムシロホワイ"],
["レッドホットクレイジーナイト","浦島坂田船","レッドホットクレイジーナイト"],
["フレンドシップ","浦島坂田船","フレンドシップ"],
["＋","浦島坂田船","プラス"],
["ハイサイ守護礼","浦島坂田船","ハイサイシュゴレイ"],
["SAILING!!!!!","浦島坂田船","セイリング"],

  ]
},
{
  date: "9月7日",
  place: "兵庫・神戸ワールド記念ホール",
  songs: [
["アダマントリング","浦島坂田船","アダマントリング"],
["アイドルっぽい曲を作った。","浦島坂田船","アイドルッポイキョクヲツクッタ"],
["僕のシンデレラ","浦島坂田船","ボクノシンデレラ"],
["世界で一番好きな名前","浦島坂田船","セカイデイチバンスキナナマエ"],
["SHOW MUST GO ON!!","浦島坂田船","ショウマストゴーオン"],
["Save Me","浦島坂田船","セーブミー"],
["ホワイトプリンス","浦島坂田船","ホワイトプリンス"],
["Mermaid","浦島坂田船","マーメイド"],
["フレテ","浦島坂田船","フレテ"],
["シックスセンス・ベル","浦島坂田船","シックスセンスベル"],
["幸せのレシピ","浦島坂田船","シアワセノレシピ"],
["メリメリ","うらたぬき","メリメリ"],
["マグネティック","となりの坂田。","マグネティック"],
["妄想注意報","うらさか","モウソウチュウイホウ"],
["Killer Killer My Love","志麻","キラーキラーマイラブ"],
["FlashBack","センラ","フラッシュバック"],
["Treat You Better","志麻セン","トリートユーベター"],
["シャララ","浦島坂田船","シャララ"],
["むしろ Why?","浦島坂田船","ムシロホワイ"],
["生き証人","浦島坂田船","イキショウニン"],
["フレンドシップ","浦島坂田船","フレンドシップ"],
["＋","浦島坂田船","プラス"],
["ハイサイ守護礼","浦島坂田船","ハイサイシュゴレイ"],
["ヘウレーカ","浦島坂田船","ヘウレーカ"],
  ]
},
{
  date: "9月8日",
  place: "兵庫・神戸ワールド記念ホール",
  songs: [
["アダマントリング","浦島坂田船","アダマントリング"],
["アイドルっぽい曲を作った。","浦島坂田船","アイドルッポイキョクヲツクッタ"],
["僕のシンデレラ","浦島坂田船","ボクノシンデレラ"],
["世界で一番好きな名前","浦島坂田船","セカイデイチバンスキナナマエ"],
["SHOW MUST GO ON!!","浦島坂田船","ショウマストゴーオン"],
["Save Me","浦島坂田船","セーブミー"],
["ホワイトプリンス","浦島坂田船","ホワイトプリンス"],
["君まであと何メーター","浦島坂田船","キミマデアトナンメーター"],
["フレテ","浦島坂田船","フレテ"],
["シックスセンス・ベル","浦島坂田船","シックスセンスベル"],
["幸せのレシピ","浦島坂田船","シアワセノレシピ"],
["メリメリ","うらたぬき","メリメリ"],
["マグネティック","となりの坂田。","マグネティック"],
["妄想注意報","うらさか","モウソウチュウイホウ"],
["Killer Killer My Love","志麻","キラーキラーマイラブ"],
["FlashBack","センラ","フラッシュバック"],
["Treat You Better","志麻セン","トリートユーベター"],
["シャララ","浦島坂田船","シャララ"],
["むしろ Why?","浦島坂田船","ムシロホワイ"],
["レッドホットクレイジーナイト","浦島坂田船","レッドホットクレイジーナイト"],
["フレンドシップ","浦島坂田船","フレンドシップ"],
["＋","浦島坂田船","プラス"],
["ハイサイ守護礼","浦島坂田船","ハイサイシュゴレイ"],
["SAILING!!!!!","浦島坂田船","セイリング"],
  ]
},
{
  date: "9月14日",
  place: "愛知・Aichi Sky Expo(愛知県国際展示場)ホールA",
  songs: [
["アダマントリング","浦島坂田船","アダマントリング"],
["アイドルっぽい曲を作った。","浦島坂田船","アイドルッポイキョクヲツクッタ"],
["僕のシンデレラ","浦島坂田船","ボクノシンデレラ"],
["世界で一番好きな名前","浦島坂田船","セカイデイチバンスキナナマエ"],
["SHOW MUST GO ON!!","浦島坂田船","ショウマストゴーオン"],
["Save Me","浦島坂田船","セーブミー"],
["ホワイトプリンス","浦島坂田船","ホワイトプリンス"],
["Mermaid","浦島坂田船","マーメイド"],
["フレテ","浦島坂田船","フレテ"],
["シックスセンス・ベル","浦島坂田船","シックスセンスベル"],
["幸せのレシピ","浦島坂田船","シアワセノレシピ"],
["メリメリ","うらたぬき","メリメリ"],
["マグネティック","となりの坂田。","マグネティック"],
["妄想注意報","うらさか","モウソウチュウイホウ"],
["Killer Killer My Love","志麻","キラーキラーマイラブ"],
["FlashBack","センラ","フラッシュバック"],
["Treat You Better","志麻セン","トリートユーベター"],
["シャララ","浦島坂田船","シャララ"],
["むしろ Why?","浦島坂田船","ムシロホワイ"],
["生き証人","浦島坂田船","イキショウニン"],
["フレンドシップ","浦島坂田船","フレンドシップ"],
["祭唄","浦島坂田船","マツリウタ"],
["＋","浦島坂田船","プラス"],
["ハイサイ守護礼","浦島坂田船","ハイサイシュゴレイ"],
["ヘウレーカ","浦島坂田船","ヘウレーカ"],
  ]
},
{
  date: "9月15日",
  place: "愛知・Aichi Sky Expo(愛知県国際展示場)ホールA",
  songs: [
["アダマントリング","浦島坂田船","アダマントリング"],
["アイドルっぽい曲を作った。","浦島坂田船","アイドルッポイキョクヲツクッタ"],
["僕のシンデレラ","浦島坂田船","ボクノシンデレラ"],
["世界で一番好きな名前","浦島坂田船","セカイデイチバンスキナナマエ"],
["SHOW MUST GO ON!!","浦島坂田船","ショウマストゴーオン"],
["Save Me","浦島坂田船","セーブミー"],
["ホワイトプリンス","浦島坂田船","ホワイトプリンス"],
["君まであと何メーター","浦島坂田船","キミマデアトナンメーター"],
["フレテ","浦島坂田船","フレテ"],
["シックスセンス・ベル","浦島坂田船","シックスセンスベル"],
["幸せのレシピ","浦島坂田船","シアワセノレシピ"],
["メリメリ","うらたぬき","メリメリ"],
["マグネティック","となりの坂田。","マグネティック"],
["妄想注意報","うらさか","モウソウチュウイホウ"],
["Killer Killer My Love","志麻","キラーキラーマイラブ"],
["FlashBack","センラ","フラッシュバック"],
["Treat You Better","志麻セン","トリートユーベター"],
["シャララ","浦島坂田船","シャララ"],
["むしろ Why?","浦島坂田船","ムシロホワイ"],
["レッドホットクレイジーナイト","浦島坂田船","レッドホットクレイジーナイト"],
["フレンドシップ","浦島坂田船","フレンドシップ"],
["明日へのBye Bye","浦島坂田船","アシタヘノバイバイ"],
["＋","浦島坂田船","プラス"],
["ハイサイ守護礼","浦島坂田船","ハイサイシュゴレイ"],
["SAILING!!!!!","浦島坂田船","セイリング"],
]
    }
  ]
);




addLiveTour(
  "浦島坂田船",
  "2024",
  "Happy Halloweeeen 浦島坂田幽霊船 さぁ手をとってshall we dance? 舞踏会はもう明日！？まだはえーよ！マスカレード！ ぬっはー！仮面の下はｶﾒｪﾝｸﾞｽｩﾝ ｽｩﾝ…ｽｩﾝ…ｽｩﾝ…",
  [
{
  date: "10月12日",
  place: "神奈川・ぴあアリーナMM",
  songs: [

  ]
},
{
  date: "10月13日",
  place: "神奈川・ぴあアリーナMM",
  songs: [

  ]
},
{
  date: "10月14日",
  place: "神奈川・ぴあアリーナMM",
  songs: [
["アイシナヨ","浦島坂田船","アイシナヨ"],
["溺愛","浦島坂田船","デキアイ"],
["微笑、香り、君と僕を繋ぐ","浦島坂田船","ホホエミカオリキミトボクヲツナグ"],
["Boohoo","浦島坂田船","ブーフー"],
["月夜","浦島坂田船","ツキヨ"],
["ヒドイヒドラ","浦島坂田船","ヒドイヒドラ"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["Secret Answer","浦島坂田船","シークレットアンサー"],
["GENTLEMEN'S NIGHT","浦島坂田船","ジェントルメンズナイト"],
["グリムメイカー","浦島坂田船","グリムメイカー"],
["No.17","志麻","ナンバージュウナナ"],
["イイナリレーション","うらたぬき","イイナリレーション"],
["独断","となりの坂田。","ドクダン"],
["スペシャルパフェ","センラ","スペシャルパフェ"],
["ワガママOnly Mine","浦島坂田船","ワガママオンリーマイン"],
["ハングリー・ゴースト","浦島坂田船","ハングリーゴースト"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["SPOOKY MAGICAL NIGHT","浦島坂田船","スプーキーマジカルナイト"],
["パイレーツオブ宇宙！","浦島坂田船","パイレーツオブウチュウ"],
["獣王無尽","浦島坂田船","ジュウオウムジン"],
["ハロウ！ゴーストシップ","浦島坂田船","ハロウゴーストシップ"],
["おーるでい・おーるにゃいと","浦島坂田船","オールデイオールニャイト"],
["シックスセンス・ベル","浦島坂田船","シックスセンスベル"],
["Piece Piece Piece","浦島坂田船","ピースピースピース"],
["アダマントリング","浦島坂田船","アダマントリング"],
  ]
    }
  ]
);


addLiveTour(
  "浦島坂田船",
  "2024",
  "浦島坂田船の大忘年会",
  [
{
  date: "12月27日",
  place: "兵庫・神戸ワールド記念ホール",
  songs: [
["Pathfinders","浦島坂田船","パスファインダーズ"],
["ワガママOnly Mine","浦島坂田船","ワガママオンリーマイン"],
["シアワセは台本の外から","しまさかせん","シアワセハダイホンノソトカラ"],
["SWEET TASTE PRESENT","浦島坂田船","スイートテイストプレゼント"],
["Snow melody","浦島坂田船","スノーメロディー"],
["カレンダーリマインダー", "浦島坂田船", "カレンダーリマインダー"],
["Shoutër", "浦島坂田船", "シャウター"],

  ]
},
{
  date: "12月28日",
  place: "兵庫・神戸ワールド記念ホール",
  songs: [

["Starry Cruise", "浦島坂田船", "スターリークルーズ"],
["ワガママOnly Mine","浦島坂田船","ワガママオンリーマイン"],
["CRAZY BUNNY!!","うらさかせん","クレイジーバニー"],
["SWEET TASTE PRESENT","浦島坂田船","スイートテイストプレゼント"],
["Snow melody","浦島坂田船","スノーメロディー"],
["カレンダーリマインダー", "浦島坂田船", "カレンダーリマインダー"],
["Dreamer","浦島坂田船","ドリーマー"],
  ]
},
{
  date: "12月31日 昼の部",
  place: "千葉・LaLa arena TOKYO-BAY",
  songs: [

["Sailor's High","浦島坂田船","セイラーズハイ"],
["ワガママOnly Mine","浦島坂田船","ワガママオンリーマイン"],
["脳内シェイカー","うらしまさか","ノウナイシェイカー"],
["SWEET TASTE PRESENT","浦島坂田船","スイートテイストプレゼント"],
["Snow melody","浦島坂田船","スノーメロディー"],
["カレンダーリマインダー", "浦島坂田船", "カレンダーリマインダー"],
["Rainbow", "浦島坂田船", "レインボー"],
  ]
},
{
  date: "12月31日 夜の部",
  place: "千葉・LaLa arena TOKYO-BAY",
  songs: [
["Carry Forward", "浦島坂田船", "キャリーフォワード"],
["ワガママOnly Mine","浦島坂田船","ワガママオンリーマイン"],
["スーパーヒーロー","うらしません。","スーパーヒーロー"],
["SWEET TASTE PRESENT","浦島坂田船","スイートテイストプレゼント"],
["Snow melody","浦島坂田船","スノーメロディー"],
["カレンダーリマインダー", "浦島坂田船", "カレンダーリマインダー"],
["アダマントリング","浦島坂田船","アダマントリング"],
  ]
    }
  ]
);




addLiveTour(
  "浦島坂田船",
  "2025",
  "浦島坂田船～歌ってみた祭り！～",
  [

{
  date: "2月14日",
  place: "千葉・LaLa arena TOKYO-BAY",
  songs: [
["太陽系デスコ","浦島坂田船","タイヨウケイデスコ"],
["ロミオとシンデレラ","うらたぬき","ロミオトシンデレラ"],
["magnet","しまさか","マグネット"],
["エンヴィキャットウォーク","センラ","エンヴィキャットウォーク"],
["林檎売りの泡沫少女","となりの坂田。","リンゴウリノウタカタショウジョ"],
["独りんぼエンヴィー","志麻","ヒトリンボエンヴィー"],
["アイのシナリオ","浦島坂田船","アイノシナリオ"],
["ベノム","浦島坂田船","ベノム"],
["Calc.","浦島坂田船","カルク"],
["サリシノハラ","となりの坂田。","サリシノハラ"],
["心做し","うらたぬき","ココロナシ"],
["夕立のりぼん","センラ","ユウダチノリボン"],
["命に嫌われている。","志麻","イノチニキラワレテイル"],
["ウミユリ海底譚","さかせん","ウミユリカイテイタン"],
["天ノ弱","うらしま","アマノジャク"],
["メルト","浦島坂田船","メルト"],
["チャンカパーナ","浦島坂田船","チャンカパーナ"],
["シャルル","志麻","シャルル"],
["恋愛裁判","センラ","レンアイサイバン"],
["SNOBBISM","となりの坂田。","スノビズム"],
["ローリンガール","うらたぬき","ローリンガール"],
["リンカーネイション","浦島坂田船","リンカーネイション"],
["極楽浄土","志麻セン","ゴクラクジョウド"],
["脳漿炸裂ガール","うらさか","ノウショウサクレツガール"],
["ヤキモチの答え","浦島坂田船","ヤキモチノコタエ"],
["厨病激発ボーイ","浦島坂田船","チュウビョウゲキハツボーイ"],
["Fire◎Flower","浦島坂田船","ファイアフラワー"],
["Blessing","浦島坂田船","ブレッシング"],
  ]
},
{
  date: "2月15日",
  place: "千葉・LaLa arena TOKYO-BAY",
  songs: [
["太陽系デスコ","浦島坂田船","タイヨウケイデスコ"],
["ロミオとシンデレラ","うらたぬき","ロミオトシンデレラ"],
["magnet","しまさか","マグネット"],
["恋愛裁判","センラ","レンアイサイバン"],
["Just Be Friends(WANKO ver)","となりの坂田。","ジャストビーフレンズワンコバージョン"],
["独りんぼエンヴィー","志麻","ヒトリンボエンヴィー"],
["アイのシナリオ","浦島坂田船","アイノシナリオ"],
["ベノム","浦島坂田船","ベノム"],
["しわ","浦島坂田船","シワ"],
["サリシノハラ","となりの坂田。","サリシノハラ"],
["ピエロ","うらたぬき","ピエロ"],
["夕立のりぼん","センラ","ユウダチノリボン"],
["HEAVEN","志麻","ヘブン"],
["ウミユリ海底譚","さかせん","ウミユリカイテイタン"],
["天ノ弱","うらしま","アマノジャク"],
["カゲロウデイズ","浦島坂田船","カゲロウデイズ"],
["チャンカパーナ","浦島坂田船","チャンカパーナ"],
["シャルル","志麻","シャルル"],
["初めての恋が終わる時","センラ","ハジメテノコイガオワルトキ"],
["SNOBBISM","となりの坂田。","スノビズム"],
["ローリンガール","うらたぬき","ローリンガール"],
["リンカーネイション","裏千家","リンカーネイション"],
["極楽浄土","志麻セン","ゴクラクジョウド"],
["脳漿炸裂ガール","うらさか","ノウショウサクレツガール"],
["ロキ","浦島坂田船","ロキ"],
["厨病激発ボーイ","浦島坂田船","チュウビョウゲキハツボーイ"],
["地球最後の告白を","浦島坂田船","チキュウサイゴノコクハクヲ"],
["Blessing","浦島坂田船","ブレッシング"],
  ]
    }
  ]
);





addLiveTour(
  "浦島坂田船",
  "2025",
  "浦島坂田船 Spring Tour 2025 ～月～",
  [
     {
  date: "2月21日",
  place: "東京・東京ガーデンシアター",
  songs: [
["月華","浦島坂田船","ユエファ"],
["花鳥風月","浦島坂田船","カチョウフウゲツ"],
["百花繚乱","浦島坂田船","ヒャッカリョウラン"],
["花吹雪","浦島坂田船","ハナフブキ"],
["絶景","浦島坂田船","ゼッケイ"],
["花や、花","浦島坂田船","ハナヤハナ"],
["月夜","浦島坂田船","ツキヨ"],
["年に一夜の恋模様","浦島坂田船","トシニヒトヨノコイモヨウ"],
["Starry Heaven","浦島坂田船","スターリーヘブン"],
["祭唄","浦島坂田船","マツリウタ"],
["十五夜オツキサマ","うらたぬき","ジュウゴヤオツキサマ"],
["さよならグッバイ","志麻","サヨナラグッバイ"],
["Pudding","センラ","プディング"],
["無駄≠無駄","となりの坂田。","ムダムダ"],
["インビジブル","裏千家","インビジブル"],
["ダンサブリミア","しまさか","ダンサブリミア"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["超毒的LOVE","浦島坂田船","チョウドクテキラブ"],
["Recipe","浦島坂田船","レシピ"],
["4 REAL IN ACTION!!!!","浦島坂田船","フォーリアルインアクション"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["わたしの一番かわいいところ","浦島坂田船","ワタシノイチバンカワイイトコロ"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["アイシナヨ","浦島坂田船","アイシナヨ"],
["熱々ワッショイダンス","浦島坂田船","アツアツワッショイダンス"],
  ]
},
{
  date: "2月22日",
  place: "東京・東京ガーデンシアター",
  songs: [
["月華","浦島坂田船","ユエファ"],
["花鳥風月","浦島坂田船","カチョウフウゲツ"],
["百花繚乱","浦島坂田船","ヒャッカリョウラン"],
["アワ・ダンサー","浦島坂田船","アワダンサー"],
["返り咲","浦島坂田船","カエリザキ"],
["花や、花","浦島坂田船","ハナヤハナ"],
["月夜","浦島坂田船","ツキヨ"],
["年に一夜の恋模様","浦島坂田船","トシニヒトヨノコイモヨウ"],
["Starry Heaven","浦島坂田船","スターリーヘブン"],
["祭唄","浦島坂田船","マツリウタ"],
["透明","センラ","トウメイ"],
["I'm Your Tamer","となりの坂田。","アイムユアテイマー"],
["ド屑","うらたぬき","ドクズ"],
["イエスタデイはトゥモローを歌わない","志麻","イエスタデイハトゥモローヲウタワナイ"],
["モエチャッカファイア","うらしま","モエチャッカファイア"],
["ビビデバ","さかせん","ビビデバ"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["超毒的LOVE","浦島坂田船","チョウドクテキラブ"],
["Recipe","浦島坂田船","レシピ"],
["合戦","浦島坂田船","カッセン"],
["わいふぁい暴想ボーイ","浦島坂田船","ワイファイボウソウボーイ"],
["わたしの一番かわいいところ","浦島坂田船","ワタシノイチバンカワイイトコロ"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["ワガママOnly Mine","浦島坂田船","ワガママオンリーマイン"],
["熱々ワッショイダンス","浦島坂田船","アツアツワッショイダンス"],
  ]
},
{
  date: "3月1日",
  place: "群馬・ベイシア文化ホール",
  songs: [
["月華","浦島坂田船","ユエファ"],
["花鳥風月","浦島坂田船","カチョウフウゲツ"],
["百花繚乱","浦島坂田船","ヒャッカリョウラン"],
["花吹雪","浦島坂田船","ハナフブキ"],
["絶景","浦島坂田船","ゼッケイ"],
["花や、花","浦島坂田船","ハナヤハナ"],
["月夜","浦島坂田船","ツキヨ"],
["年に一夜の恋模様","浦島坂田船","トシニヒトヨノコイモヨウ"],
["Starry Heaven","浦島坂田船","スターリーヘブン"],
["祭唄","浦島坂田船","マツリウタ"],
["十五夜オツキサマ","うらたぬき","ジュウゴヤオツキサマ"],
["さよならグッバイ","志麻","サヨナラグッバイ"],
["Pudding","センラ","プディング"],
["無駄≠無駄","となりの坂田。","ムダムダ"],
["インビジブル","裏千家","インビジブル"],
["ダンサブリミア","しまさか","ダンサブリミア"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["超毒的LOVE","浦島坂田船","チョウドクテキラブ"],
["Recipe","浦島坂田船","レシピ"],
["4 REAL IN ACTION!!!!","浦島坂田船","フォーリアルインアクション"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["わたしの一番かわいいところ","浦島坂田船","ワタシノイチバンカワイイトコロ"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["アイシナヨ","浦島坂田船","アイシナヨ"],
["熱々ワッショイダンス","浦島坂田船","アツアツワッショイダンス"],
  ]
},
{
  date: "3月2日",
  place: "栃木・栃木県総合文化センター",
  songs: [
["月華","浦島坂田船","ユエファ"],
["花鳥風月","浦島坂田船","カチョウフウゲツ"],
["百花繚乱","浦島坂田船","ヒャッカリョウラン"],
["アワ・ダンサー","浦島坂田船","アワダンサー"],
["返り咲","浦島坂田船","カエリザキ"],
["花や、花","浦島坂田船","ハナヤハナ"],
["月夜","浦島坂田船","ツキヨ"],
["年に一夜の恋模様","浦島坂田船","トシニヒトヨノコイモヨウ"],
["Starry Heaven","浦島坂田船","スターリーヘブン"],
["祭唄","浦島坂田船","マツリウタ"],
["透明","センラ","トウメイ"],
["I'm Your Tamer","となりの坂田。","アイムユアテイマー"],
["ド屑","うらたぬき","ドクズ"],
["イエスタデイはトゥモローを歌わない","志麻","イエスタデイハトゥモローヲウタワナイ"],
["モエチャッカファイア","うらしま","モエチャッカファイア"],
["ビビデバ","さかせん","ビビデバ"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["超毒的LOVE","浦島坂田船","チョウドクテキラブ"],
["Recipe","浦島坂田船","レシピ"],
["合戦","浦島坂田船","カッセン"],
["わいふぁい暴想ボーイ","浦島坂田船","ワイファイボウソウボーイ"],
["わたしの一番かわいいところ","浦島坂田船","ワタシノイチバンカワイイトコロ"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["ワガママOnly Mine","浦島坂田船","ワガママオンリーマイン"],
["熱々ワッショイダンス","浦島坂田船","アツアツワッショイダンス"],
  ]
},
{
  date: "3月8日",
  place: "山形・やまぎん県民ホール（山形県総合文化芸術館）",
  songs: [
["月華","浦島坂田船","ユエファ"],
["花鳥風月","浦島坂田船","カチョウフウゲツ"],
["百花繚乱","浦島坂田船","ヒャッカリョウラン"],
["花吹雪","浦島坂田船","ハナフブキ"],
["返り咲","浦島坂田船","カエリザキ"],
["花や、花","浦島坂田船","ハナヤハナ"],
["月夜","浦島坂田船","ツキヨ"],
["年に一夜の恋模様","浦島坂田船","トシニヒトヨノコイモヨウ"],
["Starry Heaven","浦島坂田船","スターリーヘブン"],
["祭唄","浦島坂田船","マツリウタ"],
["十六夜ナイトフィーバー","志麻","イザヨイナイトフィーバー"],
["記憶の水槽","となりの坂田。","キオクノスイソウ"],
["さよならウィステリア","センラ","サヨナラウィステリア"],
["たぬきのぽんぽこ祭り","うらたぬき","タヌキノポンポコマツリ"],
["ギャラクシー","志麻セン","ギャラクシー"],
["百花繚乱デンジャービーツ","うらさか","ヒャッカリョウランデンジャービーツ"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["超毒的LOVE","浦島坂田船","チョウドクテキラブ"],
["Recipe","浦島坂田船","レシピ"],
["合戦","浦島坂田船","カッセン"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["わたしの一番かわいいところ","浦島坂田船","ワタシノイチバンカワイイトコロ"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["いーあるふぁんくらぶ","浦島坂田船","イーアルファンクラブ"],
["熱々ワッショイダンス","浦島坂田船","アツアツワッショイダンス"],
  ]
},
{
  date: "3月9日",
  place: "福島・けんしん郡山文化センター（郡山市民文化センター）大ホール",
  songs: [
["月華","浦島坂田船","ユエファ"],
["花鳥風月","浦島坂田船","カチョウフウゲツ"],
["百花繚乱","浦島坂田船","ヒャッカリョウラン"],
["花吹雪","浦島坂田船","ハナフブキ"],
["絶景","浦島坂田船","ゼッケイ"],
["花や、花","浦島坂田船","ハナヤハナ"],
["月夜","浦島坂田船","ツキヨ"],
["年に一夜の恋模様","浦島坂田船","トシニヒトヨノコイモヨウ"],
["Starry Heaven","浦島坂田船","スターリーヘブン"],
["祭唄","浦島坂田船","マツリウタ"],
["十五夜オツキサマ","うらたぬき","ジュウゴヤオツキサマ"],
["さよならグッバイ","志麻","サヨナラグッバイ"],
["Pudding","センラ","プディング"],
["無駄≠無駄","となりの坂田。","ムダムダ"],
["インビジブル","裏千家","インビジブル"],
["ダンサブリミア","しまさか","ダンサブリミア"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["超毒的LOVE","浦島坂田船","チョウドクテキラブ"],
["Recipe","浦島坂田船","レシピ"],
["4 REAL IN ACTION!!!!","浦島坂田船","フォーリアルインアクション"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["わたしの一番かわいいところ","浦島坂田船","ワタシノイチバンカワイイトコロ"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["いーあるふぁんくらぶ","浦島坂田船","イーアルファンクラブ"],
["熱々ワッショイダンス","浦島坂田船","アツアツワッショイダンス"],
  ]
},
{
  date: "3月14日",
  place: "石川・本多の森 北電ホール",
  songs: [
["月華","浦島坂田船","ユエファ"],
["花鳥風月","浦島坂田船","カチョウフウゲツ"],
["百花繚乱","浦島坂田船","ヒャッカリョウラン"],
["アワ・ダンサー","浦島坂田船","アワダンサー"],
["返り咲","浦島坂田船","カエリザキ"],
["花や、花","浦島坂田船","ハナヤハナ"],
["月夜","浦島坂田船","ツキヨ"],
["年に一夜の恋模様","浦島坂田船","トシニヒトヨノコイモヨウ"],
["Starry Heaven","浦島坂田船","スターリーヘブン"],
["祭唄","浦島坂田船","マツリウタ"],
["透明","センラ","トウメイ"],
["I'm Your Tamer","となりの坂田。","アイムユアテイマー"],
["ド屑","うらたぬき","ドクズ"],
["イエスタデイはトゥモローを歌わない","志麻","イエスタデイハトゥモローヲウタワナイ"],
["モエチャッカファイア","うらしま","モエチャッカファイア"],
["ビビデバ","さかせん","ビビデバ"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["超毒的LOVE","浦島坂田船","チョウドクテキラブ"],
["Recipe","浦島坂田船","レシピ"],
["合戦","浦島坂田船","カッセン"],
["わいふぁい暴想ボーイ","浦島坂田船","ワイファイボウソウボーイ"],
["わたしの一番かわいいところ","浦島坂田船","ワタシノイチバンカワイイトコロ"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["ワガママOnly Mine","浦島坂田船","ワガママオンリーマイン"],
["熱々ワッショイダンス","浦島坂田船","アツアツワッショイダンス"],
  ]
},
{
  date: "3月15日",
  place: "富山・富山オーバード・ホール 大ホール",
  songs: [
["月華","浦島坂田船","ユエファ"],
["花鳥風月","浦島坂田船","カチョウフウゲツ"],
["百花繚乱","浦島坂田船","ヒャッカリョウラン"],
["花吹雪","浦島坂田船","ハナフブキ"],
["返り咲","浦島坂田船","カエリザキ"],
["花や、花","浦島坂田船","ハナヤハナ"],
["月夜","浦島坂田船","ツキヨ"],
["年に一夜の恋模様","浦島坂田船","トシニヒトヨノコイモヨウ"],
["Starry Heaven","浦島坂田船","スターリーヘブン"],
["祭唄","浦島坂田船","マツリウタ"],
["十六夜ナイトフィーバー","志麻","イザヨイナイトフィーバー"],
["記憶の水槽","となりの坂田。","キオクノスイソウ"],
["さよならウィステリア","センラ","サヨナラウィステリア"],
["たぬきのぽんぽこ祭り","うらたぬき","タヌキノポンポコマツリ"],
["ギャラクシー","志麻セン","ギャラクシー"],
["百花繚乱デンジャービーツ","うらさか","ヒャッカリョウランデンジャービーツ"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["超毒的LOVE","浦島坂田船","チョウドクテキラブ"],
["Recipe","浦島坂田船","レシピ"],
["合戦","浦島坂田船","カッセン"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["わたしの一番かわいいところ","浦島坂田船","ワタシノイチバンカワイイトコロ"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["いーあるふぁんくらぶ","浦島坂田船","イーアルファンクラブ"],
["熱々ワッショイダンス","浦島坂田船","アツアツワッショイダンス"],
  ]
},
{
  date: "3月19日",
  place: "三重・四日市市文化会館 第1ホール",
  songs: [
["月華","浦島坂田船","ユエファ"],
["花鳥風月","浦島坂田船","カチョウフウゲツ"],
["百花繚乱","浦島坂田船","ヒャッカリョウラン"],
["花吹雪","浦島坂田船","ハナフブキ"],
["絶景","浦島坂田船","ゼッケイ"],
["花や、花","浦島坂田船","ハナヤハナ"],
["月夜","浦島坂田船","ツキヨ"],
["年に一夜の恋模様","浦島坂田船","トシニヒトヨノコイモヨウ"],
["Starry Heaven","浦島坂田船","スターリーヘブン"],
["祭唄","浦島坂田船","マツリウタ"],
["十五夜オツキサマ","うらたぬき","ジュウゴヤオツキサマ"],
["さよならグッバイ","志麻","サヨナラグッバイ"],
["Pudding","センラ","プディング"],
["無駄≠無駄","となりの坂田。","ムダムダ"],
["インビジブル","裏千家","インビジブル"],
["ダンサブリミア","しまさか","ダンサブリミア"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["超毒的LOVE","浦島坂田船","チョウドクテキラブ"],
["Recipe","浦島坂田船","レシピ"],
["4 REAL IN ACTION!!!!","浦島坂田船","フォーリアルインアクション"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["わたしの一番かわいいところ","浦島坂田船","ワタシノイチバンカワイイトコロ"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["いーあるふぁんくらぶ","浦島坂田船","イーアルファンクラブ"],
["熱々ワッショイダンス","浦島坂田船","アツアツワッショイダンス"],
  ]
},
{
  date: "3月21日",
  place: "兵庫・アクリエひめじ 大ホール",
  songs: [
["月華","浦島坂田船","ユエファ"],
["花鳥風月","浦島坂田船","カチョウフウゲツ"],
["百花繚乱","浦島坂田船","ヒャッカリョウラン"],
["アワ・ダンサー","浦島坂田船","アワダンサー"],
["返り咲","浦島坂田船","カエリザキ"],
["花や、花","浦島坂田船","ハナヤハナ"],
["月夜","浦島坂田船","ツキヨ"],
["年に一夜の恋模様","浦島坂田船","トシニヒトヨノコイモヨウ"],
["Starry Heaven","浦島坂田船","スターリーヘブン"],
["祭唄","浦島坂田船","マツリウタ"],
["曼珠沙華","センラ","マンジュシャゲ"],
["I'm Your Tamer","となりの坂田。","アイムユアテイマー"],
["ド屑","うらたぬき","ドクズ"],
["イエスタデイはトゥモローを歌わない","志麻","イエスタデイハトゥモローヲウタワナイ"],
["モエチャッカファイア","うらしま","モエチャッカファイア"],
["ビビデバ","さかせん","ビビデバ"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["超毒的LOVE","浦島坂田船","チョウドクテキラブ"],
["Recipe","浦島坂田船","レシピ"],
["合戦","浦島坂田船","カッセン"],
["わいふぁい暴想ボーイ","浦島坂田船","ワイファイボウソウボーイ"],
["わたしの一番かわいいところ","浦島坂田船","ワタシノイチバンカワイイトコロ"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["ワガママOnly Mine","浦島坂田船","ワガママオンリーマイン"],
["熱々ワッショイダンス","浦島坂田船","アツアツワッショイダンス"],
  ]
},
{
  date: "3月22日",
  place: "岡山・倉敷市民会館",
  songs: [
["月華","浦島坂田船","ユエファ"],
["花鳥風月","浦島坂田船","カチョウフウゲツ"],
["百花繚乱","浦島坂田船","ヒャッカリョウラン"],
["花吹雪","浦島坂田船","ハナフブキ"],
["返り咲","浦島坂田船","カエリザキ"],
["花や、花","浦島坂田船","ハナヤハナ"],
["月夜","浦島坂田船","ツキヨ"],
["年に一夜の恋模様","浦島坂田船","トシニヒトヨノコイモヨウ"],
["Starry Heaven","浦島坂田船","スターリーヘブン"],
["祭唄","浦島坂田船","マツリウタ"],
["十六夜ナイトフィーバー","志麻","イザヨイナイトフィーバー"],
["記憶の水槽","となりの坂田。","キオクノスイソウ"],
["さよならウィステリア","センラ","サヨナラウィステリア"],
["たぬきのぽんぽこ祭り","うらたぬき","タヌキノポンポコマツリ"],
["ギャラクシー","志麻セン","ギャラクシー"],
["百花繚乱デンジャービーツ","うらさか","ヒャッカリョウランデンジャービーツ"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["超毒的LOVE","浦島坂田船","チョウドクテキラブ"],
["Recipe","浦島坂田船","レシピ"],
["合戦","浦島坂田船","カッセン"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["わたしの一番かわいいところ","浦島坂田船","ワタシノイチバンカワイイトコロ"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["いーあるふぁんくらぶ","浦島坂田船","イーアルファンクラブ"],
["熱々ワッショイダンス","浦島坂田船","アツアツワッショイダンス"],
  ]
},
{
  date: "3月28日",
  place: "香川・サンポートホール高松 大ホール",
  songs: [
["月華","浦島坂田船","ユエファ"],
["花鳥風月","浦島坂田船","カチョウフウゲツ"],
["百花繚乱","浦島坂田船","ヒャッカリョウラン"],
["花吹雪","浦島坂田船","ハナフブキ"],
["絶景","浦島坂田船","ゼッケイ"],
["花や、花","浦島坂田船","ハナヤハナ"],
["月夜","浦島坂田船","ツキヨ"],
["年に一夜の恋模様","浦島坂田船","トシニヒトヨノコイモヨウ"],
["Starry Heaven","浦島坂田船","スターリーヘブン"],
["祭唄","浦島坂田船","マツリウタ"],
["十五夜オツキサマ","うらたぬき","ジュウゴヤオツキサマ"],
["さよならグッバイ","志麻","サヨナラグッバイ"],
["Pudding","センラ","プディング"],
["無駄≠無駄","となりの坂田。","ムダムダ"],
["インビジブル","裏千家","インビジブル"],
["ダンサブリミア","しまさか","ダンサブリミア"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["超毒的LOVE","浦島坂田船","チョウドクテキラブ"],
["Recipe","浦島坂田船","レシピ"],
["4 REAL IN ACTION!!!!","浦島坂田船","フォーリアルインアクション"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["わたしの一番かわいいところ","浦島坂田船","ワタシノイチバンカワイイトコロ"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["いーあるふぁんくらぶ","浦島坂田船","イーアルファンクラブ"],
["熱々ワッショイダンス","浦島坂田船","アツアツワッショイダンス"],
  ]
},
{
  date: "3月30日",
  place: "愛媛・松山市民会館 大ホール",
  songs: [
["月華","浦島坂田船","ユエファ"],
["花鳥風月","浦島坂田船","カチョウフウゲツ"],
["百花繚乱","浦島坂田船","ヒャッカリョウラン"],
["アワ・ダンサー","浦島坂田船","アワダンサー"],
["返り咲","浦島坂田船","カエリザキ"],
["花や、花","浦島坂田船","ハナヤハナ"],
["月夜","浦島坂田船","ツキヨ"],
["年に一夜の恋模様","浦島坂田船","トシニヒトヨノコイモヨウ"],
["Starry Heaven","浦島坂田船","スターリーヘブン"],
["祭唄","浦島坂田船","マツリウタ"],
["十五夜オツキサマ","うらたぬき","ジュウゴヤオツキサマ"],
["I'm Your Tamer","となりの坂田。","アイムユアテイマー"],
["曼珠沙華","センラ","マンジュシャゲ"],
["イエスタデイはトゥモローを歌わない","志麻","イエスタデイハトゥモローヲウタワナイ"],
["モエチャッカファイア","うらしま","モエチャッカファイア"],
["ビビデバ","さかせん","ビビデバ"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["超毒的LOVE","浦島坂田船","チョウドクテキラブ"],
["Recipe","浦島坂田船","レシピ"],
["合戦","浦島坂田船","カッセン"],
["わいふぁい暴想ボーイ","浦島坂田船","ワイファイボウソウボーイ"],
["わたしの一番かわいいところ","浦島坂田船","ワタシノイチバンカワイイトコロ"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["ワガママOnly Mine","浦島坂田船","ワガママオンリーマイン"],
["熱々ワッショイダンス","浦島坂田船","アツアツワッショイダンス"],
  ]
},
{
  date: "4月2日",
  place: "京都・ロームシアター京都 メインホール",
  songs: [
["月華","浦島坂田船","ユエファ"],
["花鳥風月","浦島坂田船","カチョウフウゲツ"],
["百花繚乱","浦島坂田船","ヒャッカリョウラン"],
["花吹雪","浦島坂田船","ハナフブキ"],
["返り咲","浦島坂田船","カエリザキ"],
["花や、花","浦島坂田船","ハナヤハナ"],
["月夜","浦島坂田船","ツキヨ"],
["年に一夜の恋模様","浦島坂田船","トシニヒトヨノコイモヨウ"],
["Starry Heaven","浦島坂田船","スターリーヘブン"],
["祭唄","浦島坂田船","マツリウタ"],
["十六夜ナイトフィーバー","志麻","イザヨイナイトフィーバー"],
["記憶の水槽","となりの坂田。","キオクノスイソウ"],
["さよならウィステリア","センラ","サヨナラウィステリア"],
["たぬきのぽんぽこ祭り","うらたぬき","タヌキノポンポコマツリ"],
["ギャラクシー","志麻セン","ギャラクシー"],
["百花繚乱デンジャービーツ","うらさか","ヒャッカリョウランデンジャービーツ"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["超毒的LOVE","浦島坂田船","チョウドクテキラブ"],
["Recipe","浦島坂田船","レシピ"],
["合戦","浦島坂田船","カッセン"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["わたしの一番かわいいところ","浦島坂田船","ワタシノイチバンカワイイトコロ"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["いーあるふぁんくらぶ","浦島坂田船","イーアルファンクラブ"],
["熱々ワッショイダンス","浦島坂田船","アツアツワッショイダンス"],
  ]
},
{
  date: "4月4日",
  place: "静岡・静岡市清水文化会館マリナート 大ホール",
  songs: [
["月華","浦島坂田船","ユエファ"],
["花鳥風月","浦島坂田船","カチョウフウゲツ"],
["百花繚乱","浦島坂田船","ヒャッカリョウラン"],
["花吹雪","浦島坂田船","ハナフブキ"],
["絶景","浦島坂田船","ゼッケイ"],
["花や、花","浦島坂田船","ハナヤハナ"],
["月夜","浦島坂田船","ツキヨ"],
["年に一夜の恋模様","浦島坂田船","トシニヒトヨノコイモヨウ"],
["Starry Heaven","浦島坂田船","スターリーヘブン"],
["祭唄","浦島坂田船","マツリウタ"],
["十五夜オツキサマ","うらたぬき","ジュウゴヤオツキサマ"],
["さよならグッバイ","志麻","サヨナラグッバイ"],
["Pudding","センラ","プディング"],
["無駄≠無駄","となりの坂田。","ムダムダ"],
["インビジブル","裏千家","インビジブル"],
["ダンサブリミア","しまさか","ダンサブリミア"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["超毒的LOVE","浦島坂田船","チョウドクテキラブ"],
["Recipe","浦島坂田船","レシピ"],
["4 REAL IN ACTION!!!!","浦島坂田船","フォーリアルインアクション"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["わたしの一番かわいいところ","浦島坂田船","ワタシノイチバンカワイイトコロ"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["いーあるふぁんくらぶ","浦島坂田船","イーアルファンクラブ"],
["熱々ワッショイダンス","浦島坂田船","アツアツワッショイダンス"],
  ]
},
{
  date: "4月5日",
  place: "山梨・YCC県民文化ホール",
  songs: [
["月華","浦島坂田船","ユエファ"],
["花鳥風月","浦島坂田船","カチョウフウゲツ"],
["百花繚乱","浦島坂田船","ヒャッカリョウラン"],
["アワ・ダンサー","浦島坂田船","アワダンサー"],
["返り咲","浦島坂田船","カエリザキ"],
["花や、花","浦島坂田船","ハナヤハナ"],
["月夜","浦島坂田船","ツキヨ"],
["年に一夜の恋模様","浦島坂田船","トシニヒトヨノコイモヨウ"],
["Starry Heaven","浦島坂田船","スターリーヘブン"],
["祭唄","浦島坂田船","マツリウタ"],
["十五夜オツキサマ","うらたぬき","ジュウゴヤオツキサマ"],
["I'm Your Tamer","となりの坂田。","アイムユアテイマー"],
["曼珠沙華","センラ","マンジュシャゲ"],
["イエスタデイはトゥモローを歌わない","志麻","イエスタデイハトゥモローヲウタワナイ"],
["モエチャッカファイア","うらしま","モエチャッカファイア"],
["ビビデバ","さかせん","ビビデバ"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["超毒的LOVE","浦島坂田船","チョウドクテキラブ"],
["Recipe","浦島坂田船","レシピ"],
["合戦","浦島坂田船","カッセン"],
["わいふぁい暴想ボーイ","浦島坂田船","ワイファイボウソウボーイ"],
["わたしの一番かわいいところ","浦島坂田船","ワタシノイチバンカワイイトコロ"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["ワガママOnly Mine","浦島坂田船","ワガママオンリーマイン"],
["熱々ワッショイダンス","浦島坂田船","アツアツワッショイダンス"],

  ]
},
{
  date: "4月12日",
  place: "長崎・ベネックス長崎ブリックホール 大ホール",
  songs: [
["月華","浦島坂田船","ユエファ"],
["花鳥風月","浦島坂田船","カチョウフウゲツ"],
["百花繚乱","浦島坂田船","ヒャッカリョウラン"],
["花吹雪","浦島坂田船","ハナフブキ"],
["返り咲","浦島坂田船","カエリザキ"],
["花や、花","浦島坂田船","ハナヤハナ"],
["月夜","浦島坂田船","ツキヨ"],
["年に一夜の恋模様","浦島坂田船","トシニヒトヨノコイモヨウ"],
["Starry Heaven","浦島坂田船","スターリーヘブン"],
["祭唄","浦島坂田船","マツリウタ"],
["十六夜ナイトフィーバー","志麻","イザヨイナイトフィーバー"],
["記憶の水槽","となりの坂田。","キオクノスイソウ"],
["さよならウィステリア","センラ","サヨナラウィステリア"],
["たぬきのぽんぽこ祭り","うらたぬき","タヌキノポンポコマツリ"],
["ギャラクシー","志麻セン","ギャラクシー"],
["百花繚乱デンジャービーツ","うらさか","ヒャッカリョウランデンジャービーツ"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["超毒的LOVE","浦島坂田船","チョウドクテキラブ"],
["Recipe","浦島坂田船","レシピ"],
["合戦","浦島坂田船","カッセン"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["わたしの一番かわいいところ","浦島坂田船","ワタシノイチバンカワイイトコロ"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["いーあるふぁんくらぶ","浦島坂田船","イーアルファンクラブ"],
["熱々ワッショイダンス","浦島坂田船","アツアツワッショイダンス"],
  ]
},
{
  date: "4月13日",
  place: "佐賀・佐賀市文化会館",
  songs: [
["月華","浦島坂田船","ユエファ"],
["花鳥風月","浦島坂田船","カチョウフウゲツ"],
["百花繚乱","浦島坂田船","ヒャッカリョウラン"],
["花吹雪","浦島坂田船","ハナフブキ"],
["絶景","浦島坂田船","ゼッケイ"],
["花や、花","浦島坂田船","ハナヤハナ"],
["月夜","浦島坂田船","ツキヨ"],
["年に一夜の恋模様","浦島坂田船","トシニヒトヨノコイモヨウ"],
["Starry Heaven","浦島坂田船","スターリーヘブン"],
["祭唄","浦島坂田船","マツリウタ"],
["十五夜オツキサマ","うらたぬき","ジュウゴヤオツキサマ"],
["さよならグッバイ","志麻","サヨナラグッバイ"],
["Pudding","センラ","プディング"],
["無駄≠無駄","となりの坂田。","ムダムダ"],
["インビジブル","裏千家","インビジブル"],
["ダンサブリミア","しまさか","ダンサブリミア"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["超毒的LOVE","浦島坂田船","チョウドクテキラブ"],
["Recipe","浦島坂田船","レシピ"],
["4 REAL IN ACTION!!!!","浦島坂田船","フォーリアルインアクション"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["わたしの一番かわいいところ","浦島坂田船","ワタシノイチバンカワイイトコロ"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["いーあるふぁんくらぶ","浦島坂田船","イーアルファンクラブ"],
["熱々ワッショイダンス","浦島坂田船","アツアツワッショイダンス"],
  ]
},
{
  date: "4月18日",
  place: "滋賀・滋賀県立芸術劇場 びわ湖ホール 大ホール",
  songs: [
["月華","浦島坂田船","ユエファ"],
["花鳥風月","浦島坂田船","カチョウフウゲツ"],
["百花繚乱","浦島坂田船","ヒャッカリョウラン"],
["アワ・ダンサー","浦島坂田船","アワダンサー"],
["返り咲","浦島坂田船","カエリザキ"],
["花や、花","浦島坂田船","ハナヤハナ"],
["月夜","浦島坂田船","ツキヨ"],
["年に一夜の恋模様","浦島坂田船","トシニヒトヨノコイモヨウ"],
["Starry Heaven","浦島坂田船","スターリーヘブン"],
["祭唄","浦島坂田船","マツリウタ"],
["十五夜オツキサマ","うらたぬき","ジュウゴヤオツキサマ"],
["I'm Your Tamer","となりの坂田。","アイムユアテイマー"],
["曼珠沙華","センラ","マンジュシャゲ"],
["イエスタデイはトゥモローを歌わない","志麻","イエスタデイハトゥモローヲウタワナイ"],
["モエチャッカファイア","うらしま","モエチャッカファイア"],
["ビビデバ","さかせん","ビビデバ"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["超毒的LOVE","浦島坂田船","チョウドクテキラブ"],
["Recipe","浦島坂田船","レシピ"],
["合戦","浦島坂田船","カッセン"],
["わいふぁい暴想ボーイ","浦島坂田船","ワイファイボウソウボーイ"],
["わたしの一番かわいいところ","浦島坂田船","ワタシノイチバンカワイイトコロ"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["ワガママOnly Mine","浦島坂田船","ワガママオンリーマイン"],
["熱々ワッショイダンス","浦島坂田船","アツアツワッショイダンス"],
  ]
},
    
{
  date: "4月20日",
  place: "山口・KDDI維新ホール",
  songs: [
["月華","浦島坂田船","ユエファ"],
["花鳥風月","浦島坂田船","カチョウフウゲツ"],
["百花繚乱","浦島坂田船","ヒャッカリョウラン"],
["花吹雪","浦島坂田船","ハナフブキ"],
["返り咲","浦島坂田船","カエリザキ"],
["花や、花","浦島坂田船","ハナヤハナ"],
["月夜","浦島坂田船","ツキヨ"],
["年に一夜の恋模様","浦島坂田船","トシニヒトヨノコイモヨウ"],
["Starry Heaven","浦島坂田船","スターリーヘブン"],
["祭唄","浦島坂田船","マツリウタ"],
["十六夜ナイトフィーバー","志麻","イザヨイナイトフィーバー"],
["記憶の水槽","となりの坂田。","キオクノスイソウ"],
["さよならウィステリア","センラ","サヨナラウィステリア"],
["たぬきのぽんぽこ祭り","うらたぬき","タヌキノポンポコマツリ"],
["ギャラクシー","志麻セン","ギャラクシー"],
["百花繚乱デンジャービーツ","うらさか","ヒャッカリョウランデンジャービーツ"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["超毒的LOVE","浦島坂田船","チョウドクテキラブ"],
["Recipe","浦島坂田船","レシピ"],
["合戦","浦島坂田船","カッセン"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["わたしの一番かわいいところ","浦島坂田船","ワタシノイチバンカワイイトコロ"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["いーあるふぁんくらぶ","浦島坂田船","イーアルファンクラブ"],
["熱々ワッショイダンス","浦島坂田船","アツアツワッショイダンス"],
  ]
},
    
{
  date: "4月26日",
  place: "沖縄・沖縄コンベンションセンター劇場棟",
  songs: [
["月華","浦島坂田船","ユエファ"],
["花鳥風月","浦島坂田船","カチョウフウゲツ"],
["百花繚乱","浦島坂田船","ヒャッカリョウラン"],
["花吹雪","浦島坂田船","ハナフブキ"],
["絶景","浦島坂田船","ゼッケイ"],
["花や、花","浦島坂田船","ハナヤハナ"],
["月夜","浦島坂田船","ツキヨ"],
["年に一夜の恋模様","浦島坂田船","トシニヒトヨノコイモヨウ"],
["Starry Heaven","浦島坂田船","スターリーヘブン"],
["祭唄","浦島坂田船","マツリウタ"],
["十五夜オツキサマ","うらたぬき","ジュウゴヤオツキサマ"],
["さよならグッバイ","志麻","サヨナラグッバイ"],
["Pudding","センラ","プディング"],
["無駄≠無駄","となりの坂田。","ムダムダ"],
["インビジブル","裏千家","インビジブル"],
["ダンサブリミア","しまさか","ダンサブリミア"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["超毒的LOVE","浦島坂田船","チョウドクテキラブ"],
["Recipe","浦島坂田船","レシピ"],
["4 REAL IN ACTION!!!!","浦島坂田船","フォーリアルインアクション"],
["花魁俺嵐コンフュージョン","浦島坂田船","オイランオレランコンフュージョン"],
["わたしの一番かわいいところ","浦島坂田船","ワタシノイチバンカワイイトコロ"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["いーあるふぁんくらぶ","浦島坂田船","イーアルファンクラブ"],
["熱々ワッショイダンス","浦島坂田船","アツアツワッショイダンス"],
["ハイサイ守護礼","浦島坂田船","ハイサイシュゴレイ"],
  ]
},
    
{
  date: "4月27日",
  place: "沖縄・沖縄コンベンションセンター劇場棟",
  songs: [
["月華","浦島坂田船","ユエファ"],
["花鳥風月","浦島坂田船","カチョウフウゲツ"],
["百花繚乱","浦島坂田船","ヒャッカリョウラン"],
["アワ・ダンサー","浦島坂田船","アワダンサー"],
["返り咲","浦島坂田船","カエリザキ"],
["花や、花","浦島坂田船","ハナヤハナ"],
["月夜","浦島坂田船","ツキヨ"],
["年に一夜の恋模様","浦島坂田船","トシニヒトヨノコイモヨウ"],
["Starry Heaven","浦島坂田船","スターリーヘブン"],
["祭唄","浦島坂田船","マツリウタ"],
["ド屑","うらたぬき","ドクズ"],
["I'm Your Tamer","となりの坂田。","アイムユアテイマー"],
["イエスタデイはトゥモローを歌わない","志麻","イエスタデイハトゥモローヲウタワナイ"],
["モエチャッカファイア","うらしま","モエチャッカファイア"],
["ビビデバ","さかせん","ビビデバ"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["超毒的LOVE","浦島坂田船","チョウドクテキラブ"],
["Recipe","浦島坂田船","レシピ"],
["合戦","浦島坂田船","カッセン"],
["わいふぁい暴想ボーイ","浦島坂田船","ワイファイボウソウボーイ"],
["わたしの一番かわいいところ","浦島坂田船","ワタシノイチバンカワイイトコロ"],
["そらに、ひらり","浦島坂田船","ソラニヒラリ"],
["ワガママOnly Mine","浦島坂田船","ワガママオンリーマイン"],
["熱々ワッショイダンス","浦島坂田船","アツアツワッショイダンス"],
["ハイサイ守護礼","浦島坂田船","ハイサイシュゴレイ"],
]
    }
  ]
);




addLiveTour(
  "浦島坂田船",
  "2025",
  "浦島坂田船 SUMMER TOUR 2025 WARN12G",
  [
    {
      date: "7月5日",
      place: "大阪・大阪城ホール",
      songs: [      
["MINE MINE","浦島坂田船","マインマイン"],
["YELLOW FINEST","浦島坂田船","イエローファイネスト"],
["GENTLEMEN’S NIGHT","浦島坂田船","ジェントルメンズナイト"],
["ヒバナ","浦島坂田船","ヒバナ"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["Trashy","浦島坂田船","トラシー"],
["シャララ","浦島坂田船","シャララ"],
["アンコール","浦島坂田船","アンコール"],
["宵座興","浦島坂田船","ヨイザキョウ"],
["祝辞","となりの坂田。","シュクジ"],
["Secret KISS","センラ","シークレットキス"],
["大人A-S-O-V","うらさか","オトナアソブ"],
["獣王無尽","浦島坂田船","ジュウオウムジン"],
["U.S.S.S HOLIC","浦島坂田船","ユーエスエスエスホリック"],
["鈍色Wheels","浦島坂田船","ニビイロホイールズ"],
["言霊","志麻","コトダマ"],
["P!P!P!P!","うらたぬき","ピーピーピーピー"],
["Rat-a-tat","志麻セン","ラッタッタ"],
["被害妄想携帯女子（笑）","浦島坂田船","ヒガイモウソウケイタイジョシ"],
["You miss me, I know!","浦島坂田船","ユーミスミーアイノウ"],
["Fortune!!","浦島坂田船","フォーチュン"],
["シンプルLOVE","浦島坂田船","シンプルラブ"],
["Happiness","浦島坂田船","ハピネス"],
["ホワイトプリンス","浦島坂田船","ホワイトプリンス"],
["あざといんふるえんさー","浦島坂田船","アザトインフルエンサー"],
["I’m home again","浦島坂田船","アイムホームアゲイン"],
["月華","浦島坂田船","ゲッカ"],
["恋色花火","浦島坂田船","コイイロハナビ"],
      ]
    },


  {
  date: "7月6日",
  place: "大阪・大阪城ホール",
  songs: [
["MINE MINE","浦島坂田船","マインマイン"],
["YELLOW FINEST","浦島坂田船","イエローファイネスト"],
["ワナビークインビー","浦島坂田船","ワナビークインビー"],
["拝啓ドッペルゲンガー","浦島坂田船","ハイケイドッペルゲンガー"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["Trashy","浦島坂田船","トラシー"],
["レッドホットクレイジーナイト","浦島坂田船","レッドホットクレイジーナイト"],
["アンコール","浦島坂田船","アンコール"],
["宵座興","浦島坂田船","ヨイザキョウ"],
["祝辞","となりの坂田。","シュクジ"],
["Secret KISS","センラ","シークレットキス"],
["大人A-S-O-V","うらさか","オトナアソブ"],
["獣王無尽","浦島坂田船","ジュウオウムジン"],
["U.S.S.S HOLIC","浦島坂田船","ユーエスエスエスホリック"],
["鈍色Wheels","浦島坂田船","ニビイロホイールズ"],
["言霊","志麻","コトダマ"],
["P!P!P!P!","うらたぬき","ピーピーピーピー"],
["Rat-a-tat","志麻セン","ラッタッタ"],
["被害妄想携帯女子（笑）","浦島坂田船","ヒガイモウソウケイタイジョシ"],
["You miss me, I know!","浦島坂田船","ユーミスミーアイノウ"],
["最強Drive!!","浦島坂田船","サイキョウドライブ"],
["シンプルLOVE","浦島坂田船","シンプルラブ"],
["Happiness","浦島坂田船","ハピネス"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["あざといんふるえんさー","浦島坂田船","アザトインフルエンサー"],
["I’m home again","浦島坂田船","アイムホームアゲイン"],
["月華","浦島坂田船","ゲッカ"],
["恋色花火","浦島坂田船","コイイロハナビ"],
  ]
},


{
  date: "7月26日",
  place: "兵庫・GLION ARENA KOBE",
  songs: [
["MINE MINE","浦島坂田船","マインマイン"],
["YELLOW FINEST","浦島坂田船","イエローファイネスト"],
["GENTLEMEN’S NIGHT","浦島坂田船","ジェントルメンズナイト"],
["ヒバナ","浦島坂田船","ヒバナ"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["Trashy","浦島坂田船","トラシー"],
["シャララ","浦島坂田船","シャララ"],
["アンコール","浦島坂田船","アンコール"],
["宵座興","浦島坂田船","ヨイザキョウ"],
["祝辞","となりの坂田。","シュクジ"],
["Secret KISS","センラ","シークレットキス"],
["大人A-S-O-V","うらさか","オトナアソブ"],
["獣王無尽","浦島坂田船","ジュウオウムジン"],
["U.S.S.S HOLIC","浦島坂田船","ユーエスエスエスホリック"],
["鈍色Wheels","浦島坂田船","ニビイロホイールズ"],
["言霊","志麻","コトダマ"],
["P!P!P!P!","うらたぬき","ピーピーピーピー"],
["Rat-a-tat","志麻セン","ラッタッタ"],
["被害妄想携帯女子（笑）","浦島坂田船","ヒガイモウソウケイタイジョシ"],
["You miss me, I know!","浦島坂田船","ユーミスミーアイノウ"],
["Fortune!!","浦島坂田船","フォーチュン"],
["シンプルLOVE","浦島坂田船","シンプルラブ"],
["Happiness","浦島坂田船","ハピネス"],
["ホワイトプリンス","浦島坂田船","ホワイトプリンス"],
["あざといんふるえんさー","浦島坂田船","アザトインフルエンサー"],
["I’m home again","浦島坂田船","アイムホームアゲイン"],
["月華","浦島坂田船","ゲッカ"],
["恋色花火","浦島坂田船","コイイロハナビ"],
  ]
},


{
  date: "8月2日",
  place: "静岡・エコパアリーナ",
  songs: [
["MINE MINE","浦島坂田船","マインマイン"],
["YELLOW FINEST","浦島坂田船","イエローファイネスト"],
["ワナビークインビー","浦島坂田船","ワナビークインビー"],
["拝啓ドッペルゲンガー","浦島坂田船","ハイケイドッペルゲンガー"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["Trashy","浦島坂田船","トラシー"],
["レッドホットクレイジーナイト","浦島坂田船","レッドホットクレイジーナイト"],
["アンコール","浦島坂田船","アンコール"],
["宵座興","浦島坂田船","ヨイザキョウ"],
["祝辞","となりの坂田。","シュクジ"],
["Secret KISS","センラ","シークレットキス"],
["大人A-S-O-V","うらさか","オトナアソブ"],
["獣王無尽","浦島坂田船","ジュウオウムジン"],
["U.S.S.S HOLIC","浦島坂田船","ユーエスエスエスホリック"],
["鈍色Wheels","浦島坂田船","ニビイロホイールズ"],
["言霊","志麻","コトダマ"],
["P!P!P!P!","うらたぬき","ピーピーピーピー"],
["Rat-a-tat","志麻セン","ラッタッタ"],
["被害妄想携帯女子（笑）","浦島坂田船","ヒガイモウソウケイタイジョシ"],
["You miss me, I know!","浦島坂田船","ユーミスミーアイノウ"],
["最強Drive!!","浦島坂田船","サイキョウドライブ"],
["シンプルLOVE","浦島坂田船","シンプルラブ"],
["Happiness","浦島坂田船","ハピネス"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["あざといんふるえんさー","浦島坂田船","アザトインフルエンサー"],
["I’m home again","浦島坂田船","アイムホームアゲイン"],
["月華","浦島坂田船","ゲッカ"],
["恋色花火","浦島坂田船","コイイロハナビ"],
  ]
},


{
  date: "8月10日",
  place: "東京・国立代々木競技場第一体育館",
  songs: [
["MINE MINE","浦島坂田船","マインマイン"],
["YELLOW FINEST","浦島坂田船","イエローファイネスト"],
["ワナビークインビー","浦島坂田船","ワナビークインビー"],
["拝啓ドッペルゲンガー","浦島坂田船","ハイケイドッペルゲンガー"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["Trashy","浦島坂田船","トラシー"],
["レッドホットクレイジーナイト","浦島坂田船","レッドホットクレイジーナイト"],
["アンコール","浦島坂田船","アンコール"],
["宵座興","浦島坂田船","ヨイザキョウ"],
["祝辞","となりの坂田。","シュクジ"],
["Secret KISS","センラ","シークレットキス"],
["大人A-S-O-V","うらさか","オトナアソブ"],
["獣王無尽","浦島坂田船","ジュウオウムジン"],
["U.S.S.S HOLIC","浦島坂田船","ユーエスエスエスホリック"],
["鈍色Wheels","浦島坂田船","ニビイロホイールズ"],
["言霊","志麻","コトダマ"],
["P!P!P!P!","うらたぬき","ピーピーピーピー"],
["Rat-a-tat","志麻セン","ラッタッタ"],
["被害妄想携帯女子（笑）","浦島坂田船","ヒガイモウソウケイタイジョシ"],
["You miss me, I know!","浦島坂田船","ユーミスミーアイノウ"],
["最強Drive!!","浦島坂田船","サイキョウドライブ"],
["シンプルLOVE","浦島坂田船","シンプルラブ"],
["Happiness","浦島坂田船","ハピネス"],
["ホワイトプリンス","浦島坂田船","ホワイトプリンス"],
["あざといんふるえんさー","浦島坂田船","アザトインフルエンサー"],
["I’m home again","浦島坂田船","アイムホームアゲイン"],
["月華","浦島坂田船","ゲッカ"],
["恋色花火","浦島坂田船","コイイロハナビ"],
  ]
},
{
  date: "8月11日",
  place: "東京・国立代々木競技場第一体育館",
  songs: [
["MINE MINE","浦島坂田船","マインマイン"],
["YELLOW FINEST","浦島坂田船","イエローファイネスト"],
["GENTLEMEN’S NIGHT","浦島坂田船","ジェントルメンズナイト"],
["ヒバナ","浦島坂田船","ヒバナ"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["Trashy","浦島坂田船","トラシー"],
["シャララ","浦島坂田船","シャララ"],
["アンコール","浦島坂田船","アンコール"],
["宵座興","浦島坂田船","ヨイザキョウ"],
["祝辞","となりの坂田。","シュクジ"],
["Secret KISS","センラ","シークレットキス"],
["大人A-S-O-V","うらさか","オトナアソブ"],
["獣王無尽","浦島坂田船","ジュウオウムジン"],
["U.S.S.S HOLIC","浦島坂田船","ユーエスエスエスホリック"],
["鈍色Wheels","浦島坂田船","ニビイロホイールズ"],
["言霊","志麻","コトダマ"],
["P!P!P!P!","うらたぬき","ピーピーピーピー"],
["Rat-a-tat","志麻セン","ラッタッタ"],
["被害妄想携帯女子（笑）","浦島坂田船","ヒガイモウソウケイタイジョシ"],
["You miss me, I know!","浦島坂田船","ユーミスミーアイノウ"],
["Fortune!!","浦島坂田船","フォーチュン"],
["シンプルLOVE","浦島坂田船","シンプルラブ"],
["Happiness","浦島坂田船","ハピネス"],
["Peacock Epoch","浦島坂田船","ピーコックエポック"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["あざといんふるえんさー","浦島坂田船","アザトインフルエンサー"],
["I’m home again","浦島坂田船","アイムホームアゲイン"],
["月華","浦島坂田船","ゲッカ"],
["恋色花火","浦島坂田船","コイイロハナビ"],
  ]
},

{
  date: "8月30日",
  place: "広島・広島サンプラザホール",
  songs: [
["MINE MINE","浦島坂田船","マインマイン"],
["YELLOW FINEST","浦島坂田船","イエローファイネスト"],
["ワナビークインビー","浦島坂田船","ワナビークインビー"],
["拝啓ドッペルゲンガー","浦島坂田船","ハイケイドッペルゲンガー"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["Trashy","浦島坂田船","トラシー"],
["レッドホットクレイジーナイト","浦島坂田船","レッドホットクレイジーナイト"],
["アンコール","浦島坂田船","アンコール"],
["宵座興","浦島坂田船","ヨイザキョウ"],
["祝辞","となりの坂田。","シュクジ"],
["Secret KISS","センラ","シークレットキス"],
["大人A-S-O-V","うらさか","オトナアソブ"],
["獣王無尽","浦島坂田船","ジュウオウムジン"],
["U.S.S.S HOLIC","浦島坂田船","ユーエスエスエスホリック"],
["鈍色Wheels","浦島坂田船","ニビイロホイールズ"],
["言霊","志麻","コトダマ"],
["P!P!P!P!","うらたぬき","ピーピーピーピー"],
["Rat-a-tat","志麻セン","ラッタッタ"],
["被害妄想携帯女子（笑）","浦島坂田船","ヒガイモウソウケイタイジョシ"],
["You miss me, I know!","浦島坂田船","ユーミスミーアイノウ"],
["最強Drive!!","浦島坂田船","サイキョウドライブ"],
["シンプルLOVE","浦島坂田船","シンプルラブ"],
["Happiness","浦島坂田船","ハピネス"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["あざといんふるえんさー","浦島坂田船","アザトインフルエンサー"],
["I’m home again","浦島坂田船","アイムホームアゲイン"],
["月華","浦島坂田船","ゲッカ"],
["恋色花火","浦島坂田船","コイイロハナビ"],
  ]
},

{
  date: "8月31日",
  place: "広島・広島サンプラザホール",
  songs: [
["MINE MINE","浦島坂田船","マインマイン"],
["YELLOW FINEST","浦島坂田船","イエローファイネスト"],
["GENTLEMEN’S NIGHT","浦島坂田船","ジェントルメンズナイト"],
["ヒバナ","浦島坂田船","ヒバナ"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["Trashy","浦島坂田船","トラシー"],
["シャララ","浦島坂田船","シャララ"],
["アンコール","浦島坂田船","アンコール"],
["宵座興","浦島坂田船","ヨイザキョウ"],
["祝辞","となりの坂田。","シュクジ"],
["Secret KISS","センラ","シークレットキス"],
["大人A-S-O-V","うらさか","オトナアソブ"],
["獣王無尽","浦島坂田船","ジュウオウムジン"],
["U.S.S.S HOLIC","浦島坂田船","ユーエスエスエスホリック"],
["鈍色Wheels","浦島坂田船","ニビイロホイールズ"],
["言霊","志麻","コトダマ"],
["P!P!P!P!","うらたぬき","ピーピーピーピー"],
["Rat-a-tat","志麻セン","ラッタッタ"],
["被害妄想携帯女子（笑）","浦島坂田船","ヒガイモウソウケイタイジョシ"],
["You miss me, I know!","浦島坂田船","ユーミスミーアイノウ"],
["Fortune!!","浦島坂田船","フォーチュン"],
["シンプルLOVE","浦島坂田船","シンプルラブ"],
["Happiness","浦島坂田船","ハピネス"],
["ホワイトプリンス","浦島坂田船","ホワイトプリンス"],
["あざといんふるえんさー","浦島坂田船","アザトインフルエンサー"],
["I’m home again","浦島坂田船","アイムホームアゲイン"],
["月華","浦島坂田船","ゲッカ"],
["恋色花火","浦島坂田船","コイイロハナビ"],
  ]
},
{
  date: "9月13日",
  place: "宮城・ゼビオアリーナ仙台",
  songs: [
["MINE MINE","浦島坂田船","マインマイン"],
["YELLOW FINEST","浦島坂田船","イエローファイネスト"],
["GENTLEMEN’S NIGHT","浦島坂田船","ジェントルメンズナイト"],
["ヒバナ","浦島坂田船","ヒバナ"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["Trashy","浦島坂田船","トラシー"],
["シャララ","浦島坂田船","シャララ"],
["アンコール","浦島坂田船","アンコール"],
["宵座興","浦島坂田船","ヨイザキョウ"],
["祝辞","となりの坂田。","シュクジ"],
["Secret KISS","センラ","シークレットキス"],
["大人A-S-O-V","うらさか","オトナアソブ"],
["獣王無尽","浦島坂田船","ジュウオウムジン"],
["U.S.S.S HOLIC","浦島坂田船","ユーエスエスエスホリック"],
["鈍色Wheels","浦島坂田船","ニビイロホイールズ"],
["言霊","志麻","コトダマ"],
["P!P!P!P!","うらたぬき","ピーピーピーピー"],
["Rat-a-tat","志麻セン","ラッタッタ"],
["被害妄想携帯女子（笑）","浦島坂田船","ヒガイモウソウケイタイジョシ"],
["You miss me, I know!","浦島坂田船","ユーミスミーアイノウ"],
["Fortune!!","浦島坂田船","フォーチュン"],
["シンプルLOVE","浦島坂田船","シンプルラブ"],
["Happiness","浦島坂田船","ハピネス"],
["ホワイトプリンス","浦島坂田船","ホワイトプリンス"],
["あざといんふるえんさー","浦島坂田船","アザトインフルエンサー"],
["I’m home again","浦島坂田船","アイムホームアゲイン"],
["月華","浦島坂田船","ゲッカ"],
["恋色花火","浦島坂田船","コイイロハナビ"],
  ]
},


{
  date: "9月14日",
  place: "宮城・ゼビオアリーナ仙台",
  songs: [
["MINE MINE","浦島坂田船","マインマイン"],
["YELLOW FINEST","浦島坂田船","イエローファイネスト"],
["ワナビークインビー","浦島坂田船","ワナビークインビー"],
["拝啓ドッペルゲンガー","浦島坂田船","ハイケイドッペルゲンガー"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["Trashy","浦島坂田船","トラシー"],
["レッドホットクレイジーナイト","浦島坂田船","レッドホットクレイジーナイト"],
["アンコール","浦島坂田船","アンコール"],
["宵座興","浦島坂田船","ヨイザキョウ"],
["祝辞","となりの坂田。","シュクジ"],
["Secret KISS","センラ","シークレットキス"],
["大人A-S-O-V","うらさか","オトナアソブ"],
["獣王無尽","浦島坂田船","ジュウオウムジン"],
["U.S.S.S HOLIC","浦島坂田船","ユーエスエスエスホリック"],
["鈍色Wheels","浦島坂田船","ニビイロホイールズ"],
["言霊","志麻","コトダマ"],
["P!P!P!P!","うらたぬき","ピーピーピーピー"],
["Rat-a-tat","志麻セン","ラッタッタ"],
["被害妄想携帯女子（笑）","浦島坂田船","ヒガイモウソウケイタイジョシ"],
["You miss me, I know!","浦島坂田船","ユーミスミーアイノウ"],
["最強Drive!!","浦島坂田船","サイキョウドライブ"],
["シンプルLOVE","浦島坂田船","シンプルラブ"],
["Happiness","浦島坂田船","ハピネス"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["あざといんふるえんさー","浦島坂田船","アザトインフルエンサー"],
["I’m home again","浦島坂田船","アイムホームアゲイン"],
["月華","浦島坂田船","ゲッカ"],
["恋色花火","浦島坂田船","コイイロハナビ"],
  ]
},


{
  date: "9月20日",
  place: "福岡・福岡国際センター",
  songs: [
["MINE MINE","浦島坂田船","マインマイン"],
["YELLOW FINEST","浦島坂田船","イエローファイネスト"],
["ワナビークインビー","浦島坂田船","ワナビークインビー"],
["拝啓ドッペルゲンガー","浦島坂田船","ハイケイドッペルゲンガー"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["Trashy","浦島坂田船","トラシー"],
["レッドホットクレイジーナイト","浦島坂田船","レッドホットクレイジーナイト"],
["アンコール","浦島坂田船","アンコール"],
["宵座興","浦島坂田船","ヨイザキョウ"],
["祝辞","となりの坂田。","シュクジ"],
["Secret KISS","センラ","シークレットキス"],
["大人A-S-O-V","うらさか","オトナアソブ"],
["獣王無尽","浦島坂田船","ジュウオウムジン"],
["U.S.S.S HOLIC","浦島坂田船","ユーエスエスエスホリック"],
["鈍色Wheels","浦島坂田船","ニビイロホイールズ"],
["言霊","志麻","コトダマ"],
["P!P!P!P!","うらたぬき","ピーピーピーピー"],
["Rat-a-tat","志麻セン","ラッタッタ"],
["被害妄想携帯女子（笑）","浦島坂田船","ヒガイモウソウケイタイジョシ"],
["You miss me, I know!","浦島坂田船","ユーミスミーアイノウ"],
["最強Drive!!","浦島坂田船","サイキョウドライブ"],
["シンプルLOVE","浦島坂田船","シンプルラブ"],
["Happiness","浦島坂田船","ハピネス"],
["ハッピーエンドは笑うように","浦島坂田船","ハッピーエンドハワラウヨウニ"],
["あざといんふるえんさー","浦島坂田船","アザトインフルエンサー"],
["I’m home again","浦島坂田船","アイムホームアゲイン"],
["月華","浦島坂田船","ゲッカ"],
["恋色花火","浦島坂田船","コイイロハナビ"],
  ]
},
{
  date: "9月21日",
  place: "福岡・福岡国際センター",
  songs: [
["MINE MINE","浦島坂田船","マインマイン"],
["YELLOW FINEST","浦島坂田船","イエローファイネスト"],
["GENTLEMEN’S NIGHT","浦島坂田船","ジェントルメンズナイト"],
["ヒバナ","浦島坂田船","ヒバナ"],
["Beetle Battle","浦島坂田船","ビートルバトル"],
["Trashy","浦島坂田船","トラシー"],
["シャララ","浦島坂田船","シャララ"],
["アンコール","浦島坂田船","アンコール"],
["宵座興","浦島坂田船","ヨイザキョウ"],
["祝辞","となりの坂田。","シュクジ"],
["Secret KISS","センラ","シークレットキス"],
["大人A-S-O-V","うらさか","オトナアソブ"],
["獣王無尽","浦島坂田船","ジュウオウムジン"],
["U.S.S.S HOLIC","浦島坂田船","ユーエスエスエスホリック"],
["鈍色Wheels","浦島坂田船","ニビイロホイールズ"],
["言霊","志麻","コトダマ"],
["P!P!P!P!","うらたぬき","ピーピーピーピー"],
["Rat-a-tat","志麻セン","ラッタッタ"],
["被害妄想携帯女子（笑）","浦島坂田船","ヒガイモウソウケイタイジョシ"],
["You miss me, I know!","浦島坂田船","ユーミスミーアイノウ"],
["Fortune!!","浦島坂田船","フォーチュン"],
["シンプルLOVE","浦島坂田船","シンプルラブ"],
["Happiness","浦島坂田船","ハピネス"],
["ホワイトプリンス","浦島坂田船","ホワイトプリンス"],
["あざといんふるえんさー","浦島坂田船","アザトインフルエンサー"],
["I’m home again","浦島坂田船","アイムホームアゲイン"],
["月華","浦島坂田船","ゲッカ"],
["恋色花火","浦島坂田船","コイイロハナビ"],
["Shoutër","浦島坂田船","シャウター"],

]
    }
  ]
);

addLiveTour(

"浦島坂田船",
  "2025",
  "Happy Halloweeeen 浦島坂田幽霊船 ～え！？くぅｯｯ///そっ♡(腰に手をぽふっ)shh...STRONG...俺の弾丸をﾊﾞｷｭうーﾝ♡ﾎｯ､もう地獄はサッタンDEATHね～", [

{
  date: "10月18日",
  place: "東京・有明アリーナ",
  songs: [

["KISS THE BULLET","浦島坂田船","キスザバレット"],
["HORRORISM","浦島坂田船","ホラリズム"],
["Bad Monster","浦島坂田船","バッドモンスター"],
["駆け上がるボルテージ","浦島坂田船","カケアガルボルテージ"],
["グリムメイカー","浦島坂田船","グリムメイカー"],
["ゴーストルール","浦島坂田船","ゴーストルール"],
["シックスセンス・ベル","浦島坂田船","シックスセンスベル"],
["悪魔の踊り方","浦島坂田船","アクマノオドリカタ"],
["Exorcise","浦島坂田船","エクソサイズ"],
["明日へのByeBye","浦島坂田船","アシタヘノバイバイ"],
["ARK","浦島坂田船","アーク"],
["おーるでい・おーるにゃいと","浦島坂田船","オールデイオールニャイト"],
["MASK","となりの坂田。","マスク"],
["プロポーズ","うらたぬき","プロポーズ"],
["モニタリング","志麻","モニタリング"],
["秘密リミッター","センラ","ヒミツリミッター"],
["MINE MINE","浦島坂田船","マインマイン"],
["君色々移り -トリビュートver.-","浦島坂田船","キミイロイロウツリトリビュートバージョン"],
["ばく","浦島坂田船","バク"],
["Q for U","浦島坂田船","キューフォーユー"],
["フライングゲット","浦島坂田船","フライングゲット"],
["ハロウ！ゴーストシップ","浦島坂田船","ハロウゴーストシップ"],
["今日から俺たちゴーストバスターズ","浦島坂田船","キョウカラオレタチゴーストバスターズ"],
["フレテ","浦島坂田船","フレテ"],


]
},
{
  date: "10月19日",
  place: "東京・有明アリーナ",
  songs: [

["KISS THE BULLET","浦島坂田船","キスザバレット"],
["HORRORISM","浦島坂田船","ホラリズム"],
["Bad Monster","浦島坂田船","バッドモンスター"],
["駆け上がるボルテージ","浦島坂田船","カケアガルボルテージ"],
["グリムメイカー","浦島坂田船","グリムメイカー"],
["ストリーミングハート","浦島坂田船","ストリーミングハート"],
["シックスセンス・ベル","浦島坂田船","シックスセンスベル"],
["悪魔の踊り方","浦島坂田船","アクマノオドリカタ"],
["Exorcise","浦島坂田船","エクソサイズ"],
["最強ライバル","浦島坂田船","サイキョウライバル"],
["おーるでい・おーるにゃいと","浦島坂田船","オールデイオールニャイト"],
["Lie or Truth","センラ","ライオアトゥルース"],
["DA DA DICE","志麻","ダダダイス"],
["プロポーズ","うらたぬき","プロポーズ"],
["MASK","となりの坂田。","マスク"],
["MINE MINE","浦島坂田船","マインマイン"],
["君色々移り -トリビュートver.-","浦島坂田船","キミイロイロウツリトリビュートバージョン"],
["ばく","浦島坂田船","バク"],
["シンデレラステップ","浦島坂田船","シンデレラステップ"],
["明日へのByeBye","浦島坂田船","アシタヘノバイバイ"],
["Q for U","浦島坂田船","キューフォーユー"],
["フライングゲット","浦島坂田船","フライングゲット"],
["ハロウ！ゴーストシップ","浦島坂田船","ハロウゴーストシップ"],
["今日から俺たちゴーストバスターズ","浦島坂田船","キョウカラオレタチゴーストバスターズ"],
["ドラマティックノエル","浦島坂田船","ドラマティックノエル"],
["フレテ","浦島坂田船","フレテ"],


]
},
{
  date: "10月25日",
  place: "兵庫・神戸ワールド記念ホール",
  songs: [

["KISS THE BULLET","浦島坂田船","キスザバレット"],
["HORRORISM","浦島坂田船","ホラリズム"],
["Bad Monster","浦島坂田船","バッドモンスター"],
["駆け上がるボルテージ","浦島坂田船","カケアガルボルテージ"],
["グリムメイカー","浦島坂田船","グリムメイカー"],
["ゴーストルール","浦島坂田船","ゴーストルール"],
["シックスセンス・ベル","浦島坂田船","シックスセンスベル"],
["悪魔の踊り方","浦島坂田船","アクマノオドリカタ"],
["Exorcise","浦島坂田船","エクソサイズ"],
["明日へのByeBye","浦島坂田船","アシタヘノバイバイ"],
["ARK","浦島坂田船","アーク"],
["おーるでい・おーるにゃいと","浦島坂田船","オールデイオールニャイト"],
["MASK","となりの坂田。","マスク"],
["プロポーズ","うらたぬき","プロポーズ"],
["モニタリング","志麻","モニタリング"],
["秘密リミッター","センラ","ヒミツリミッター"],
["MINE MINE","浦島坂田船","マインマイン"],
["君色々移り -トリビュートver.-","浦島坂田船","キミイロイロウツリトリビュートバージョン"],
["ばく","浦島坂田船","バク"],
["Q for U","浦島坂田船","キューフォーユー"],
["フライングゲット","浦島坂田船","フライングゲット"],
["ハロウ！ゴーストシップ","浦島坂田船","ハロウゴーストシップ"],
["今日から俺たちゴーストバスターズ","浦島坂田船","キョウカラオレタチゴーストバスターズ"],
["フレテ","浦島坂田船","フレテ"],
]
},
{
  date: "10月26日",
  place: "兵庫・神戸ワールド記念ホール",
  songs: [

["KISS THE BULLET","浦島坂田船","キスザバレット"],
["HORRORISM","浦島坂田船","ホラリズム"],
["Bad Monster","浦島坂田船","バッドモンスター"],
["駆け上がるボルテージ","浦島坂田船","カケアガルボルテージ"],
["グリムメイカー","浦島坂田船","グリムメイカー"],
["ストリーミングハート","浦島坂田船","ストリーミングハート"],
["シックスセンス・ベル","浦島坂田船","シックスセンスベル"],
["悪魔の踊り方","浦島坂田船","アクマノオドリカタ"],
["Exorcise","浦島坂田船","エクソサイズ"],
["最強ライバル","浦島坂田船","サイキョウライバル"],
["おーるでい・おーるにゃいと","浦島坂田船","オールデイオールニャイト"],
["Lie or Truth","センラ","ライオアトゥルース"],
["DA DA DICE","志麻","ダダダイス"],
["プロポーズ","うらたぬき","プロポーズ"],
["MASK","となりの坂田。","マスク"],
["MINE MINE","浦島坂田船","マインマイン"],
["君色々移り -トリビュートver.-","浦島坂田船","キミイロイロウツリトリビュートバージョン"],
["ばく","浦島坂田船","バク"],
["シンデレラステップ","浦島坂田船","シンデレラステップ"],
["明日へのByeBye","浦島坂田船","アシタヘノバイバイ"],
["Q for U","浦島坂田船","キューフォーユー"],
["フライングゲット","浦島坂田船","フライングゲット"],
["ハロウ！ゴーストシップ","浦島坂田船","ハロウゴーストシップ"],
["今日から俺たちゴーストバスターズ","浦島坂田船","キョウカラオレタチゴーストバスターズ"],
["フレテ","浦島坂田船","フレテ"],
]
    }
  ]
);



addLiveTour(
  "浦島坂田船",
  "2026",
  "浦島坂田船 Spring Tour 2026 ～夜叉～",
  [
    {
      date: "3月5日",
      place: "北海道・札幌文化芸術劇場 hitaru",
      songs: [      
["輪々春廻", "浦島坂田船", "リンリンシュンカイ"],
["返り咲", "浦島坂田船", "カエリザキ"],
["Trashy", "浦島坂田船", "トラシー"],
["吉原ラメント", "浦島坂田船", "ヨシワララメント"],
["天樂 -guitar rock arrangement ver-", "浦島坂田船", "テンガクギターロックアレンジメントバージョン"],
["宵", "浦島坂田船", "ヨイ"],
["Ring", "浦島坂田船", "リング"],
["KISS THE BULLET", "浦島坂田船", "キスザバレット"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["薄紅", "浦島坂田船", "ウスベニ"],
["ダブルフェイス", "浦島坂田船", "ダブルフェイス"],
["金曜日のおはよう", "浦島坂田船", "キンヨウビノオハヨウ"],
["好き！雪！本気マジック", "浦島坂田船", "スキユキホンキマジック"],
["ニビイロドロウレ", "となりの坂田。", "ニビイロドロウレ"],
["リコレクションエンドロウル", "裏千家", "リコレクションエンドロウル"],
["カメリア・コンプレックス", "志麻", "カメリアコンプレックス"],
["愛して？ ～love me do～", "センラ", "アイシテラブミードゥー"],
["夢中Chu☆パンダ", "うらたぬき", "ムチュウチュウパンダ"],
["ガチ恋者達に捧ぐバラッド〜キミが笑えば地球も回る〜", "しまさか", "ガチコイシャタチニササグバラッドキミガワラエバチキュウモマワル"],
["SHOW MUST GO ON!!", "浦島坂田船", "ショウマストゴーオン"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["アワダンサー", "浦島坂田船", "アワダンサー"],
["truth", "浦島坂田船", "トゥルース"],
["ラメグラデーション", "浦島坂田船", "ラメグラデーション"],
["花や、花", "浦島坂田船", "ハナヤハナ"],
["Shoutër", "浦島坂田船", "シャウター"],
      ]
    },


    {
       date: "3月7日",
      place: "秋田・あきた芸術劇場ミルハス 大ホール",
      songs: [       
["輪々春廻", "浦島坂田船", "リンリンシュンカイ"],
["返り咲", "浦島坂田船", "カエリザキ"],
["Trashy", "浦島坂田船", "トラシー"],
["吉原ラメント", "浦島坂田船", "ヨシワララメント"],
["シザーナイフ", "浦島坂田船", "シザーナイフ"],
["宵", "浦島坂田船", "ヨイ"],
["Ring", "浦島坂田船", "リング"],
["KISS THE BULLET", "浦島坂田船", "キスザバレット"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["薄紅", "浦島坂田船", "ウスベニ"],
["ダブルフェイス", "浦島坂田船", "ダブルフェイス"],
["金曜日のおはよう", "浦島坂田船", "キンヨウビノオハヨウ"],
["好き！雪！本気マジック", "浦島坂田船", "スキユキホンキマジック"],
["このふざけた素晴らしき世界は、僕の為にある", "うらたぬき", "コノフザケタスバラシキセカイハボクノタメニアル"],
["恋々遊々", "志麻", "レンレンユウユウ"],
["ジェヘナ（Gehenna）", "さかせん", "ジェヘナ"],
["アリアドネ", "センラ", "アリアドネ"],
["ねぇ、どろどろさん", "となりの坂田。", "ネェドロドロサン"],
["テオ", "うらしま", "テオ"],
["SHINY", "浦島坂田船", "シャイニー"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["ポーカーフェイク", "浦島坂田船", "ポーカーフェイク"],
["truth", "浦島坂田船", "トゥルース"],
["ラメグラデーション", "浦島坂田船", "ラメグラデーション"],
["絶景", "浦島坂田船", "ゼッケイ"],
["Pathfinders", "浦島坂田船", "パスファインダーズ"],
      ]
    },

    {
      date: "3月8日",
      place: "岩手・トーサイクラシックホール岩手(岩手県民会館)大ホール",
      songs: [
["輪々春廻", "浦島坂田船", "リンリンシュンカイ"],
["返り咲", "浦島坂田船", "カエリザキ"],
["Trashy", "浦島坂田船", "トラシー"],
["吉原ラメント", "浦島坂田船", "ヨシワララメント"],
["天樂 -guitar rock arrangement ver-", "浦島坂田船", "テンガクギターロックアレンジメントバージョン"],
["宵", "浦島坂田船", "ヨイ"],
["Ring", "浦島坂田船", "リング"],
["KISS THE BULLET", "浦島坂田船", "キスザバレット"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["薄紅", "浦島坂田船", "ウスベニ"],
["ダブルフェイス", "浦島坂田船", "ダブルフェイス"],
["金曜日のおはよう", "浦島坂田船", "キンヨウビノオハヨウ"],
["好き！雪！本気マジック", "浦島坂田船", "スキユキホンキマジック"],
["恋々遊々", "志麻", "レンレンユウユウ"],
["おどりゃんせ", "うらさか", "オドリャンセ"],
["夢中Chu☆パンダ", "うらたぬき", "ムチュウチュウパンダ"],
["ねぇ、どろどろさん", "となりの坂田。", "ネェドロドロサン"],
["アリアドネ", "センラ", "アリアドネ"],
["右肩の蝶", "志麻セン", "ミギカタノチョウ"],
["SHOW MUST GO ON!!", "浦島坂田船", "ショウマストゴーオン"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["アワダンサー", "浦島坂田船", "アワダンサー"],
["truth", "浦島坂田船", "トゥルース"],
["ラメグラデーション", "浦島坂田船", "ラメグラデーション"],
["花や、花", "浦島坂田船", "ハナヤハナ"],
["Shoutër", "浦島坂田船", "シャウター"],
      ]
    },

    {
      date: "3月15日",
      place: "茨城・水戸市民会館 グロービスホール",
      songs: [
["輪々春廻", "浦島坂田船", "リンリンシュンカイ"],
["返り咲", "浦島坂田船", "カエリザキ"],
["Trashy", "浦島坂田船", "トラシー"],
["吉原ラメント", "浦島坂田船", "ヨシワララメント"],
["天樂 -guitar rock arrangement ver-", "浦島坂田船", "テンガクギターロックアレンジメントバージョン"],
["宵", "浦島坂田船", "ヨイ"],
["Ring", "浦島坂田船", "リング"],
["KISS THE BULLET", "浦島坂田船", "キスザバレット"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["薄紅", "浦島坂田船", "ウスベニ"],
["ダブルフェイス", "浦島坂田船", "ダブルフェイス"],
["金曜日のおはよう", "浦島坂田船", "キンヨウビノオハヨウ"],
["好き！雪！本気マジック", "浦島坂田船", "スキユキホンキマジック"],
["ニビイロドロウレ", "となりの坂田。", "ニビイロドロウレ"],
["リコレクションエンドロウル", "裏千家", "リコレクションエンドロウル"],
["カメリア・コンプレックス", "志麻", "カメリアコンプレックス"],
["愛して？ ～love me do～", "センラ", "アイシテラブミードゥー"],
["夢中Chu☆パンダ", "うらたぬき", "ムチュウチュウパンダ"],
["ガチ恋者達に捧ぐバラッド〜キミが笑えば地球も回る〜", "しまさか", "ガチコイシャタチニササグバラッドキミガワラエバチキュウモマワル"],
["SHOW MUST GO ON!!", "浦島坂田船", "ショウマストゴーオン"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["アワダンサー", "浦島坂田船", "アワダンサー"],
["truth", "浦島坂田船", "トゥルース"],
["ラメグラデーション", "浦島坂田船", "ラメグラデーション"],
["花や、花", "浦島坂田船", "ハナヤハナ"],
["Shoutër", "浦島坂田船", "シャウター"],
      ]
    },

    {
      date: "3月21日",
      place: "高知・高知県立県民文化ホール オレンジホール",
      songs: [
["輪々春廻", "浦島坂田船", "リンリンシュンカイ"],
["返り咲", "浦島坂田船", "カエリザキ"],
["Trashy", "浦島坂田船", "トラシー"],
["吉原ラメント", "浦島坂田船", "ヨシワララメント"],
["シザーナイフ", "浦島坂田船", "シザーナイフ"],
["宵", "浦島坂田船", "ヨイ"],
["Ring", "浦島坂田船", "リング"],
["KISS THE BULLET", "浦島坂田船", "キスザバレット"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["薄紅", "浦島坂田船", "ウスベニ"],
["ダブルフェイス", "浦島坂田船", "ダブルフェイス"],
["金曜日のおはよう", "浦島坂田船", "キンヨウビノオハヨウ"],
["好き！雪！本気マジック", "浦島坂田船", "スキユキホンキマジック"],
["このふざけた素晴らしき世界は、僕の為にある", "うらたぬき", "コノフザケタスバラシキセカイハボクノタメニアル"],
["恋々遊々", "志麻", "レンレンユウユウ"],
["ジェヘナ（Gehenna）", "さかせん", "ジェヘナ"],
["アリアドネ", "センラ", "アリアドネ"],
["ねぇ、どろどろさん", "となりの坂田。", "ネェドロドロサン"],
["テオ", "うらしま", "テオ"],
["SHINY", "浦島坂田船", "シャイニー"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["ポーカーフェイク", "浦島坂田船", "ポーカーフェイク"],
["truth", "浦島坂田船", "トゥルース"],
["ラメグラデーション", "浦島坂田船", "ラメグラデーション"],
["絶景", "浦島坂田船", "ゼッケイ"],
["Pathfinders", "浦島坂田船", "パスファインダーズ"],
      ]
    },

    {
      date: "3月22日",
      place: "香川・サンポートホール高松 大ホール",
      songs: [
["輪々春廻", "浦島坂田船", "リンリンシュンカイ"],
["返り咲", "浦島坂田船", "カエリザキ"],
["Trashy", "浦島坂田船", "トラシー"],
["吉原ラメント", "浦島坂田船", "ヨシワララメント"],
["天樂 -guitar rock arrangement ver-", "浦島坂田船", "テンガクギターロックアレンジメントバージョン"],
["宵", "浦島坂田船", "ヨイ"],
["Ring", "浦島坂田船", "リング"],
["KISS THE BULLET", "浦島坂田船", "キスザバレット"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["薄紅", "浦島坂田船", "ウスベニ"],
["ダブルフェイス", "浦島坂田船", "ダブルフェイス"],
["金曜日のおはよう", "浦島坂田船", "キンヨウビノオハヨウ"],
["好き！雪！本気マジック", "浦島坂田船", "スキユキホンキマジック"],
["恋々遊々", "志麻", "レンレンユウユウ"],
["おどりゃんせ", "うらさか", "オドリャンセ"],
["夢中Chu☆パンダ", "うらたぬき", "ムチュウチュウパンダ"],
["ねぇ、どろどろさん", "となりの坂田。", "ネェドロドロサン"],
["アリアドネ", "センラ", "アリアドネ"],
["右肩の蝶", "志麻セン", "ミギカタノチョウ"],
["SHOW MUST GO ON!!", "浦島坂田船", "ショウマストゴーオン"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["アワダンサー", "浦島坂田船", "アワダンサー"],
["truth", "浦島坂田船", "トゥルース"],
["ラメグラデーション", "浦島坂田船", "ラメグラデーション"],
["花や、花", "浦島坂田船", "ハナヤハナ"],
["Shoutër", "浦島坂田船", "シャウター"],
      ]
    },

    {
      date: "3月28日",
      place: "石川・金沢歌劇座",
      songs: [
["輪々春廻", "浦島坂田船", "リンリンシュンカイ"],
["返り咲", "浦島坂田船", "カエリザキ"],
["Trashy", "浦島坂田船", "トラシー"],
["吉原ラメント", "浦島坂田船", "ヨシワララメント"],
["天樂 -guitar rock arrangement ver-", "浦島坂田船", "テンガクギターロックアレンジメントバージョン"],
["宵", "浦島坂田船", "ヨイ"],
["Ring", "浦島坂田船", "リング"],
["KISS THE BULLET", "浦島坂田船", "キスザバレット"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["薄紅", "浦島坂田船", "ウスベニ"],
["ダブルフェイス", "浦島坂田船", "ダブルフェイス"],
["金曜日のおはよう", "浦島坂田船", "キンヨウビノオハヨウ"],
["好き！雪！本気マジック", "浦島坂田船", "スキユキホンキマジック"],
["ニビイロドロウレ", "となりの坂田。", "ニビイロドロウレ"],
["リコレクションエンドロウル", "裏千家", "リコレクションエンドロウル"],
["カメリア・コンプレックス", "志麻", "カメリアコンプレックス"],
["愛して？ ～love me do～", "センラ", "アイシテラブミードゥー"],
["夢中Chu☆パンダ", "うらたぬき", "ムチュウチュウパンダ"],
["ガチ恋者達に捧ぐバラッド〜キミが笑えば地球も回る〜", "しまさか", "ガチコイシャタチニササグバラッドキミガワラエバチキュウモマワル"],
["SHOW MUST GO ON!!", "浦島坂田船", "ショウマストゴーオン"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["アワダンサー", "浦島坂田船", "アワダンサー"],
["truth", "浦島坂田船", "トゥルース"],
["ラメグラデーション", "浦島坂田船", "ラメグラデーション"],
["花や、花", "浦島坂田船", "ハナヤハナ"],
["Shoutër", "浦島坂田船", "シャウター"],
      ]
    },

    {
      date: "3月29日",
      place: "福井・フェニックス・プラザ エルピス大ホール",
      songs: [
["輪々春廻", "浦島坂田船", "リンリンシュンカイ"],
["返り咲", "浦島坂田船", "カエリザキ"],
["Trashy", "浦島坂田船", "トラシー"],
["吉原ラメント", "浦島坂田船", "ヨシワララメント"],
["シザーナイフ", "浦島坂田船", "シザーナイフ"],
["宵", "浦島坂田船", "ヨイ"],
["Ring", "浦島坂田船", "リング"],
["KISS THE BULLET", "浦島坂田船", "キスザバレット"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["薄紅", "浦島坂田船", "ウスベニ"],
["ダブルフェイス", "浦島坂田船", "ダブルフェイス"],
["金曜日のおはよう", "浦島坂田船", "キンヨウビノオハヨウ"],
["好き！雪！本気マジック", "浦島坂田船", "スキユキホンキマジック"],
["このふざけた素晴らしき世界は、僕の為にある", "うらたぬき", "コノフザケタスバラシキセカイハボクノタメニアル"],
["恋々遊々", "志麻", "レンレンユウユウ"],
["ジェヘナ（Gehenna）", "さかせん", "ジェヘナ"],
["アリアドネ", "センラ", "アリアドネ"],
["ねぇ、どろどろさん", "となりの坂田。", "ネェドロドロサン"],
["テオ", "うらしま", "テオ"],
["SHINY", "浦島坂田船", "シャイニー"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["ポーカーフェイク", "浦島坂田船", "ポーカーフェイク"],
["truth", "浦島坂田船", "トゥルース"],
["ラメグラデーション", "浦島坂田船", "ラメグラデーション"],
["絶景", "浦島坂田船", "ゼッケイ"],
["Pathfinders", "浦島坂田船", "パスファインダーズ"],
      ]
    },

    {
      date: "4月2日",
      place: "岡山・岡山芸術創造劇場ハレノワ 大劇場",
      songs: [
["輪々春廻", "浦島坂田船", "リンリンシュンカイ"],
["返り咲", "浦島坂田船", "カエリザキ"],
["Trashy", "浦島坂田船", "トラシー"],
["吉原ラメント", "浦島坂田船", "ヨシワララメント"],
["天樂 -guitar rock arrangement ver-", "浦島坂田船", "テンガクギターロックアレンジメントバージョン"],
["宵", "浦島坂田船", "ヨイ"],
["Ring", "浦島坂田船", "リング"],
["KISS THE BULLET", "浦島坂田船", "キスザバレット"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["薄紅", "浦島坂田船", "ウスベニ"],
["ダブルフェイス", "浦島坂田船", "ダブルフェイス"],
["金曜日のおはよう", "浦島坂田船", "キンヨウビノオハヨウ"],
["好き！雪！本気マジック", "浦島坂田船", "スキユキホンキマジック"],
["恋々遊々", "志麻", "レンレンユウユウ"],
["おどりゃんせ", "うらさか", "オドリャンセ"],
["夢中Chu☆パンダ", "うらたぬき", "ムチュウチュウパンダ"],
["ねぇ、どろどろさん", "となりの坂田。", "ネェドロドロサン"],
["アリアドネ", "センラ", "アリアドネ"],
["右肩の蝶", "志麻セン", "ミギカタノチョウ"],
["SHOW MUST GO ON!!", "浦島坂田船", "ショウマストゴーオン"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["アワダンサー", "浦島坂田船", "アワダンサー"],
["truth", "浦島坂田船", "トゥルース"],
["ラメグラデーション", "浦島坂田船", "ラメグラデーション"],
["花や、花", "浦島坂田船", "ハナヤハナ"],
["Pathfinders", "浦島坂田船", "パスファインダーズ"],
      ]
    },

    {
      date: "4月4日",
      place: "滋賀・滋賀県立芸術劇場びわ湖ホール 大ホール",
      songs: [
["輪々春廻", "浦島坂田船", "リンリンシュンカイ"],
["返り咲", "浦島坂田船", "カエリザキ"],
["Trashy", "浦島坂田船", "トラシー"],
["吉原ラメント", "浦島坂田船", "ヨシワララメント"],
["天樂 -guitar rock arrangement ver-", "浦島坂田船", "テンガクギターロックアレンジメントバージョン"],
["宵", "浦島坂田船", "ヨイ"],
["Ring", "浦島坂田船", "リング"],
["KISS THE BULLET", "浦島坂田船", "キスザバレット"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["薄紅", "浦島坂田船", "ウスベニ"],
["ダブルフェイス", "浦島坂田船", "ダブルフェイス"],
["金曜日のおはよう", "浦島坂田船", "キンヨウビノオハヨウ"],
["好き！雪！本気マジック", "浦島坂田船", "スキユキホンキマジック"],
["ニビイロドロウレ", "となりの坂田。", "ニビイロドロウレ"],
["リコレクションエンドロウル", "裏千家", "リコレクションエンドロウル"],
["カメリア・コンプレックス", "志麻", "カメリアコンプレックス"],
["愛して？ ～love me do～", "センラ", "アイシテラブミードゥー"],
["夢中Chu☆パンダ", "うらたぬき", "ムチュウチュウパンダ"],
["ガチ恋者達に捧ぐバラッド〜キミが笑えば地球も回る〜", "しまさか", "ガチコイシャタチニササグバラッドキミガワラエバチキュウモマワル"],
["SHOW MUST GO ON!!", "浦島坂田船", "ショウマストゴーオン"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["アワダンサー", "浦島坂田船", "アワダンサー"],
["truth", "浦島坂田船", "トゥルース"],
["ラメグラデーション", "浦島坂田船", "ラメグラデーション"],
["花や、花", "浦島坂田船", "ハナヤハナ"],
["Pathfinders", "浦島坂田船", "パスファインダーズ"],
      ]
    },

    {
      date: "4月5日",
      place: "奈良・なら100年会館 大ホール",
      songs: [
["輪々春廻", "浦島坂田船", "リンリンシュンカイ"],
["返り咲", "浦島坂田船", "カエリザキ"],
["Trashy", "浦島坂田船", "トラシー"],
["吉原ラメント", "浦島坂田船", "ヨシワララメント"],
["シザーナイフ", "浦島坂田船", "シザーナイフ"],
["宵", "浦島坂田船", "ヨイ"],
["Ring", "浦島坂田船", "リング"],
["KISS THE BULLET", "浦島坂田船", "キスザバレット"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["薄紅", "浦島坂田船", "ウスベニ"],
["ダブルフェイス", "浦島坂田船", "ダブルフェイス"],
["金曜日のおはよう", "浦島坂田船", "キンヨウビノオハヨウ"],
["好き！雪！本気マジック", "浦島坂田船", "スキユキホンキマジック"],
["このふざけた素晴らしき世界は、僕の為にある", "うらたぬき", "コノフザケタスバラシキセカイハボクノタメニアル"],
["恋々遊々", "志麻", "レンレンユウユウ"],
["ジェヘナ（Gehenna）", "さかせん", "ジェヘナ"],
["アリアドネ", "センラ", "アリアドネ"],
["ねぇ、どろどろさん", "となりの坂田。", "ネェドロドロサン"],
["テオ", "うらしま", "テオ"],
["SHINY", "浦島坂田船", "シャイニー"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["アワダンサー", "浦島坂田船", "アワダンサー"],
["truth", "浦島坂田船", "トゥルース"],
["ラメグラデーション", "浦島坂田船", "ラメグラデーション"],
["絶景", "浦島坂田船", "ゼッケイ"],
["Shoutër", "浦島坂田船", "シャウター"],
      ]
    },

    {
      date: "4月7日",
      place: "岐阜・長良川国際会議場 メインホール",
      songs: [
["輪々春廻", "浦島坂田船", "リンリンシュンカイ"],
["返り咲", "浦島坂田船", "カエリザキ"],
["Trashy", "浦島坂田船", "トラシー"],
["吉原ラメント", "浦島坂田船", "ヨシワララメント"],
["天樂 -guitar rock arrangement ver-", "浦島坂田船", "テンガクギターロックアレンジメントバージョン"],
["宵", "浦島坂田船", "ヨイ"],
["Ring", "浦島坂田船", "リング"],
["KISS THE BULLET", "浦島坂田船", "キスザバレット"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["薄紅", "浦島坂田船", "ウスベニ"],
["ダブルフェイス", "浦島坂田船", "ダブルフェイス"],
["金曜日のおはよう", "浦島坂田船", "キンヨウビノオハヨウ"],
["好き！雪！本気マジック", "浦島坂田船", "スキユキホンキマジック"],
["恋々遊々", "志麻", "レンレンユウユウ"],
["おどりゃんせ", "うらさか", "オドリャンセ"],
["夢中Chu☆パンダ", "うらたぬき", "ムチュウチュウパンダ"],
["ねぇ、どろどろさん", "となりの坂田。", "ネェドロドロサン"],
["アリアドネ", "センラ", "アリアドネ"],
["右肩の蝶", "志麻セン", "ミギカタノチョウ"],
["SHOW MUST GO ON!!", "浦島坂田船", "ショウマストゴーオン"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["ポーカーフェイク", "浦島坂田船", "ポーカーフェイク"],
["truth", "浦島坂田船", "トゥルース"],
["ラメグラデーション", "浦島坂田船", "ラメグラデーション"],
["花や、花", "浦島坂田船", "ハナヤハナ"],
["Pathfinders", "浦島坂田船", "パスファインダーズ"],
      ]
    },

    {
      date: "4月9日",
      place: "静岡・アクトシティ浜松 大ホール",
      songs: [
["輪々春廻", "浦島坂田船", "リンリンシュンカイ"],
["返り咲", "浦島坂田船", "カエリザキ"],
["Trashy", "浦島坂田船", "トラシー"],
["吉原ラメント", "浦島坂田船", "ヨシワララメント"],
["天樂 -guitar rock arrangement ver-", "浦島坂田船", "テンガクギターロックアレンジメントバージョン"],
["宵", "浦島坂田船", "ヨイ"],
["Ring", "浦島坂田船", "リング"],
["KISS THE BULLET", "浦島坂田船", "キスザバレット"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["薄紅", "浦島坂田船", "ウスベニ"],
["ダブルフェイス", "浦島坂田船", "ダブルフェイス"],
["金曜日のおはよう", "浦島坂田船", "キンヨウビノオハヨウ"],
["好き！雪！本気マジック", "浦島坂田船", "スキユキホンキマジック"],
["ニビイロドロウレ", "となりの坂田。", "ニビイロドロウレ"],
["リコレクションエンドロウル", "裏千家", "リコレクションエンドロウル"],
["カメリア・コンプレックス", "志麻", "カメリアコンプレックス"],
["愛して？ ～love me do～", "センラ", "アイシテラブミードゥー"],
["夢中Chu☆パンダ", "うらたぬき", "ムチュウチュウパンダ"],
["ガチ恋者達に捧ぐバラッド〜キミが笑えば地球も回る〜", "しまさか", "ガチコイシャタチニササグバラッドキミガワラエバチキュウモマワル"],
["SHOW MUST GO ON!!", "浦島坂田船", "ショウマストゴーオン"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["ポーカーフェイク", "浦島坂田船", "ポーカーフェイク"],
["truth", "浦島坂田船", "トゥルース"],
["ラメグラデーション", "浦島坂田船", "ラメグラデーション"],
["花や、花", "浦島坂田船", "ハナヤハナ"],
["Pathfinders", "浦島坂田船", "パスファインダーズ"],
      ]
    },

    {
      date: "4月12日",
      place: "群馬・高崎芸術劇場 大劇場",
      songs: [
["輪々春廻", "浦島坂田船", "リンリンシュンカイ"],
["返り咲", "浦島坂田船", "カエリザキ"],
["Trashy", "浦島坂田船", "トラシー"],
["吉原ラメント", "浦島坂田船", "ヨシワララメント"],
["シザーナイフ", "浦島坂田船", "シザーナイフ"],
["宵", "浦島坂田船", "ヨイ"],
["Ring", "浦島坂田船", "リング"],
["KISS THE BULLET", "浦島坂田船", "キスザバレット"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["薄紅", "浦島坂田船", "ウスベニ"],
["ダブルフェイス", "浦島坂田船", "ダブルフェイス"],
["金曜日のおはよう", "浦島坂田船", "キンヨウビノオハヨウ"],
["好き！雪！本気マジック", "浦島坂田船", "スキユキホンキマジック"],
["このふざけた素晴らしき世界は、僕の為にある", "うらたぬき", "コノフザケタスバラシキセカイハボクノタメニアル"],
["恋々遊々", "志麻", "レンレンユウユウ"],
["ジェヘナ（Gehenna）", "さかせん", "ジェヘナ"],
["アリアドネ", "センラ", "アリアドネ"],
["ねぇ、どろどろさん", "となりの坂田。", "ネェドロドロサン"],
["テオ", "うらしま", "テオ"],
["SHINY", "浦島坂田船", "シャイニー"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["アワダンサー", "浦島坂田船", "アワダンサー"],
["truth", "浦島坂田船", "トゥルース"],
["ラメグラデーション", "浦島坂田船", "ラメグラデーション"],
["絶景", "浦島坂田船", "ゼッケイ"],
["Shoutër", "浦島坂田船", "シャウター"],
      ]
    },

    {
      date: "4月18日",
      place: "大分・iichiko グランシアタ",
      songs: [
["輪々春廻", "浦島坂田船", "リンリンシュンカイ"],
["返り咲", "浦島坂田船", "カエリザキ"],
["Trashy", "浦島坂田船", "トラシー"],
["吉原ラメント", "浦島坂田船", "ヨシワララメント"],
["天樂 -guitar rock arrangement ver-", "浦島坂田船", "テンガクギターロックアレンジメントバージョン"],
["宵", "浦島坂田船", "ヨイ"],
["Ring", "浦島坂田船", "リング"],
["KISS THE BULLET", "浦島坂田船", "キスザバレット"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["薄紅", "浦島坂田船", "ウスベニ"],
["ダブルフェイス", "浦島坂田船", "ダブルフェイス"],
["金曜日のおはよう", "浦島坂田船", "キンヨウビノオハヨウ"],
["好き！雪！本気マジック", "浦島坂田船", "スキユキホンキマジック"],
["恋々遊々", "志麻", "レンレンユウユウ"],
["おどりゃんせ", "うらさか", "オドリャンセ"],
["夢中Chu☆パンダ", "うらたぬき", "ムチュウチュウパンダ"],
["ねぇ、どろどろさん", "となりの坂田。", "ネェドロドロサン"],
["アリアドネ", "センラ", "アリアドネ"],
["右肩の蝶", "志麻セン", "ミギカタノチョウ"],
["SHOW MUST GO ON!!", "浦島坂田船", "ショウマストゴーオン"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["ポーカーフェイク", "浦島坂田船", "ポーカーフェイク"],
["truth", "浦島坂田船", "トゥルース"],
["ラメグラデーション", "浦島坂田船", "ラメグラデーション"],
["花や、花", "浦島坂田船", "ハナヤハナ"],
["Pathfinders", "浦島坂田船", "パスファインダーズ"],
      ]
    },

    {
      date: "4月19日",
      place: "熊本・熊本城ホール メインホール",
      songs: [
["輪々春廻", "浦島坂田船", "リンリンシュンカイ"],
["返り咲", "浦島坂田船", "カエリザキ"],
["Trashy", "浦島坂田船", "トラシー"],
["吉原ラメント", "浦島坂田船", "ヨシワララメント"],
["シザーナイフ", "浦島坂田船", "シザーナイフ"],
["宵", "浦島坂田船", "ヨイ"],
["Ring", "浦島坂田船", "リング"],
["KISS THE BULLET", "浦島坂田船", "キスザバレット"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["薄紅", "浦島坂田船", "ウスベニ"],
["ダブルフェイス", "浦島坂田船", "ダブルフェイス"],
["金曜日のおはよう", "浦島坂田船", "キンヨウビノオハヨウ"],
["好き！雪！本気マジック", "浦島坂田船", "スキユキホンキマジック"],
["このふざけた素晴らしき世界は、僕の為にある", "うらたぬき", "コノフザケタスバラシキセカイハボクノタメニアル"],
["恋々遊々", "志麻", "レンレンユウユウ"],
["ジェヘナ（Gehenna）", "さかせん", "ジェヘナ"],
["アリアドネ", "センラ", "アリアドネ"],
["ねぇ、どろどろさん", "となりの坂田。", "ネェドロドロサン"],
["テオ", "うらしま", "テオ"],
["SHINY", "浦島坂田船", "シャイニー"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["アワダンサー", "浦島坂田船", "アワダンサー"],
["truth", "浦島坂田船", "トゥルース"],
["ラメグラデーション", "浦島坂田船", "ラメグラデーション"],
["絶景", "浦島坂田船", "ゼッケイ"],
["Shoutër", "浦島坂田船", "シャウター"],
      ]
    },

    {
      date: "4月25日",
      place: "東京・有明アリーナ",
      songs: [
["輪々春廻", "浦島坂田船", "リンリンシュンカイ"],
["返り咲", "浦島坂田船", "カエリザキ"],
["Trashy", "浦島坂田船", "トラシー"],
["吉原ラメント", "浦島坂田船", "ヨシワララメント"],
["天樂 -guitar rock arrangement ver-", "浦島坂田船", "テンガクギターロックアレンジメントバージョン"],
["宵", "浦島坂田船", "ヨイ"],
["Ring", "浦島坂田船", "リング"],
["KISS THE BULLET", "浦島坂田船", "キスザバレット"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["薄紅", "浦島坂田船", "ウスベニ"],
["ダブルフェイス", "浦島坂田船", "ダブルフェイス"],
["金曜日のおはよう", "浦島坂田船", "キンヨウビノオハヨウ"],
["好き！雪！本気マジック", "浦島坂田船", "スキユキホンキマジック"],
         ["ばく", "浦島坂田船", "バク"],
["このふざけた素晴らしき世界は、僕の為にある", "うらたぬき", "コノフザケタスバラシキセカイハボクノタメニアル"],
["恋々遊々", "志麻", "レンレンユウユウ"],
["ジェヘナ（Gehenna）", "さかせん", "ジェヘナ"],
["愛して？ ～love me do～", "センラ", "アイシテラブミードゥー"],
["ねぇ、どろどろさん", "となりの坂田。", "ネェドロドロサン"],
["テオ", "うらしま", "テオ"],
["SHINY", "浦島坂田船", "シャイニー"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["アワダンサー", "浦島坂田船", "アワダンサー"],
          ["神のまにまに", "浦島坂田船", "カミノマニマニ"],
["truth", "浦島坂田船", "トゥルース"],
["ラメグラデーション", "浦島坂田船", "ラメグラデーション"],
["花や、花", "浦島坂田船", "ハナヤハナ"],
["Shoutër", "浦島坂田船", "シャウター"],
["Mermaid", "浦島坂田船", "マーメイド"],
         ]
    },

    {
      date: "4月26日",
      place: "東京・有明アリーナ",
      songs: [
["輪々春廻", "浦島坂田船", "リンリンシュンカイ"],
["返り咲", "浦島坂田船", "カエリザキ"],
["Trashy", "浦島坂田船", "トラシー"],
["吉原ラメント", "浦島坂田船", "ヨシワララメント"],
["シザーナイフ", "浦島坂田船", "シザーナイフ"],
["宵", "浦島坂田船", "ヨイ"],
["Ring", "浦島坂田船", "リング"],
["KISS THE BULLET", "浦島坂田船", "キスザバレット"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレランコンフュージョン"],
["薄紅", "浦島坂田船", "ウスベニ"],
["ダブルフェイス", "浦島坂田船", "ダブルフェイス"],
["金曜日のおはよう", "浦島坂田船", "キンヨウビノオハヨウ"],
["好き！雪！本気マジック", "浦島坂田船", "スキユキホンキマジック"],
        ["ばく", "浦島坂田船", "バク"],
["ニビイロドロウレ", "となりの坂田。", "ニビイロドロウレ"],
["リコレクションエンドロウル", "裏千家", "リコレクションエンドロウル"],
["カメリア・コンプレックス", "志麻", "カメリアコンプレックス"],
["アリアドネ", "センラ", "アリアドネ"],
["夢中Chu☆パンダ", "うらたぬき", "ムチュウチュウパンダ"],
["ガチ恋者達に捧ぐバラッド〜キミが笑えば地球も回る〜", "しまさか", "ガチコイシャタチニササグバラッドキミガワラエバチキュウモマワル"],
["SHOW MUST GO ON!!", "浦島坂田船", "ショウマストゴーオン"],
["ミダリニハルイロ", "浦島坂田船", "ミダリニハルイロ"],
["ポーカーフェイク", "浦島坂田船", "ポーカーフェイク"],
            ["神のまにまに", "浦島坂田船", "カミノマニマニ"],
["truth", "浦島坂田船", "トゥルース"],
["ラメグラデーション", "浦島坂田船", "ラメグラデーション"],
["絶景", "浦島坂田船", "ゼッケイ"],
["Pathfinders", "浦島坂田船", "パスファインダーズ"],
["TENTH", "浦島坂田船", "テンス"],
  ]
    }
  ]
);

addLiveTour(
  "浦島坂田船",
  "2026",
  "浦島坂田船 SUMMER TOUR 2026 TA13OO",
  [
{
  date: "7月18日",
  place: "兵庫・神戸ワールド記念ホール",
  songs: [

["THE TABOO", "浦島坂田船", "ザタブー"],
["青く塗り替えろ！", "浦島坂田船", "アオクヌリカエロ"],
["USSS HOLIC", "浦島坂田船", "ユーエスエスエスホリック"],
["アイシナヨ", "浦島坂田船", "アイシナヨ"],
["マスカレード", "浦島坂田船", "マスカレード"],
["ココマドモアゼル", "浦島坂田船", "ココマドモアゼル"],
["シャドウ", "浦島坂田船", "シャドウ"],
["秘密のプレイルーム", "浦島坂田船", "ヒミツノプレイルーム"],
["Hate me↑↑Love Me↑↑", "浦島坂田船", "ヘイトミーラブミー"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["火炎", "浦島坂田船", "カエン"],
["Tokyo Highway Driving", "センラ", "トーキョーハイウェイドライビング"],
["Addiction", "うらたぬき", "アディクション"],
["アナタサエ", "うらさか", "アナタサエ"],
["Wolf Gang", "志麻", "ウルフギャング"],
["ヒットチューン", " となりの坂田。", "ヒットチューン"],
["独占フルスロットル", "志麻セン", "ドクセンフルスロットル"],
["Secret Answer", "浦島坂田船", "シークレットアンサー"],
["カレンダーリマインダー", "浦島坂田船", "カレンダーリマインダー"],
["Game Changer", "浦島坂田船", "ゲームチェンジャー"],
["USSS GPT", "浦島坂田船", "ユーエスエスエスジーピーティー"],
["Why？感情発表祭", "浦島坂田船", "ホワイカンジョウハッピョウサイ"],
["合戦", "浦島坂田船", "カッセン"],
["好きすぎて滅！", "浦島坂田船", "スキスギテメツ"],
["アダマントリング", "浦島坂田船", "アダマントリング"],
["エンドレステイル", "浦島坂田船", "エンドレステイル"],
["TENTH", "浦島坂田船", "テンス"]
]
},
{
  date: "7月19日",
  place: "兵庫・神戸ワールド記念ホール",
  songs: [

["THE TABOO", "浦島坂田船", "ザタブー"],
["青く塗り替えろ！", "浦島坂田船", "アオクヌリカエロ"],
["USSS HOLIC", "浦島坂田船", "ユーエスエスエスホリック"],
["むしろ Why?", "浦島坂田船", "ムシロホワイ"],
["マスカレード", "浦島坂田船", "マスカレード"],
["ココマドモアゼル", "浦島坂田船", "ココマドモアゼル"],
["溺愛", "浦島坂田船", "デキアイ"],
["秘密のプレイルーム", "浦島坂田船", "ヒミツノプレイルーム"],
["Hate me↑↑Love Me↑↑", "浦島坂田船", "ヘイトミーラブミー"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["火炎", "浦島坂田船", "カエン"],
["Tokyo Highway Driving", "センラ", "トーキョーハイウェイドライビング"],
["Addiction", "うらたぬき", "アディクション"],
["アナタサエ", "うらさか", "アナタサエ"],
["Wolf Gang", "志麻", "ウルフギャング"],
["ヒットチューン", " となりの坂田。", "ヒットチューン"],
["独占フルスロットル", "志麻セン", "ドクセンフルスロットル"],
["Secret Answer", "浦島坂田船", "シークレットアンサー"],
["カレンダーリマインダー", "浦島坂田船", "カレンダーリマインダー"],
["Sailor's High", "浦島坂田船", "セイラーズハイ"],
["USSS GPT", "浦島坂田船", "ユーエスエスエスジーピーティー"],
["Why？感情発表祭", "浦島坂田船", "ホワイカンジョウハッピョウサイ"],
["花吹雪", "浦島坂田船", "ハナフブキ"],
["好きすぎて滅！", "浦島坂田船", "スキスギテメツ"],
["アダマントリング", "浦島坂田船", "アダマントリング"],
["エンドレステイル", "浦島坂田船", "エンドレステイル"],
["TENTH", "浦島坂田船", "テンス"],

]
},
{
  date: "7月25日",
  place: "福岡・マリンメッセ福岡 B館",
  songs: [

["THE TABOO", "浦島坂田船", "ザタブー"],
["青く塗り替えろ！", "浦島坂田船", "アオクヌリカエロ"],
["USSS HOLIC", "浦島坂田船", "ユーエスエスエスホリック"],
["アイシナヨ", "浦島坂田船", "アイシナヨ"],
["マスカレード", "浦島坂田船", "マスカレード"],
["ココマドモアゼル", "浦島坂田船", "ココマドモアゼル"],
["シャドウ", "浦島坂田船", "シャドウ"],
["秘密のプレイルーム", "浦島坂田船", "ヒミツノプレイルーム"],
["Hate me↑↑Love Me↑↑", "浦島坂田船", "ヘイトミーラブミー"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["火炎", "浦島坂田船", "カエン"],
["Tokyo Highway Driving", "センラ", "トーキョーハイウェイドライビング"],
["Addiction", "うらたぬき", "アディクション"],
["アナタサエ", "うらさか", "アナタサエ"],
["Wolf Gang", "志麻", "ウルフギャング"],
["ヒットチューン", " となりの坂田。", "ヒットチューン"],
["独占フルスロットル", "志麻セン", "ドクセンフルスロットル"],
["Secret Answer", "浦島坂田船", "シークレットアンサー"],
["カレンダーリマインダー", "浦島坂田船", "カレンダーリマインダー"],
["Game Changer", "浦島坂田船", "ゲームチェンジャー"],
["USSS GPT", "浦島坂田船", "ユーエスエスエスジーピーティー"],
["Why？感情発表祭", "浦島坂田船", "ホワイカンジョウハッピョウサイ"],
["合戦", "浦島坂田船", "カッセン"],
["好きすぎて滅！", "浦島坂田船", "スキスギテメツ"],
["アダマントリング", "浦島坂田船", "アダマントリング"],
["エンドレステイル", "浦島坂田船", "エンドレステイル"],
["TENTH", "浦島坂田船", "テンス"]
]
},
{
  date: "7月26日",
  place: "福岡・マリンメッセ福岡 B館",
  songs: [

["THE TABOO", "浦島坂田船", "ザタブー"],
["青く塗り替えろ！", "浦島坂田船", "アオクヌリカエロ"],
["USSS HOLIC", "浦島坂田船", "ユーエスエスエスホリック"],
["むしろ Why?", "浦島坂田船", "ムシロホワイ"],
["マスカレード", "浦島坂田船", "マスカレード"],
["ココマドモアゼル", "浦島坂田船", "ココマドモアゼル"],
["溺愛", "浦島坂田船", "デキアイ"],
["秘密のプレイルーム", "浦島坂田船", "ヒミツノプレイルーム"],
["Hate me↑↑Love Me↑↑", "浦島坂田船", "ヘイトミーラブミー"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["火炎", "浦島坂田船", "カエン"],
["Tokyo Highway Driving", "センラ", "トーキョーハイウェイドライビング"],
["Addiction", "うらたぬき", "アディクション"],
["アナタサエ", "うらさか", "アナタサエ"],
["Wolf Gang", "志麻", "ウルフギャング"],
["ヒットチューン", " となりの坂田。", "ヒットチューン"],
["独占フルスロットル", "志麻セン", "ドクセンフルスロットル"],
["Secret Answer", "浦島坂田船", "シークレットアンサー"],
["カレンダーリマインダー", "浦島坂田船", "カレンダーリマインダー"],
["Sailor's High", "浦島坂田船", "セイラーズハイ"],
["USSS GPT", "浦島坂田船", "ユーエスエスエスジーピーティー"],
["Why？感情発表祭", "浦島坂田船", "ホワイカンジョウハッピョウサイ"],
["花吹雪", "浦島坂田船", "ハナフブキ"],
["好きすぎて滅！", "浦島坂田船", "スキスギテメツ"],
["アダマントリング", "浦島坂田船", "アダマントリング"],
["エンドレステイル", "浦島坂田船", "エンドレステイル"],
["TENTH", "浦島坂田船", "テンス"],
]
},
{
  date: "8月1日",
  place: "宮城・ゼビオアリーナ仙台",
  songs: [

["THE TABOO", "浦島坂田船", "ザタブー"],
["青く塗り替えろ！", "浦島坂田船", "アオクヌリカエロ"],
["USSS HOLIC", "浦島坂田船", "ユーエスエスエスホリック"],
["アイシナヨ", "浦島坂田船", "アイシナヨ"],
["マスカレード", "浦島坂田船", "マスカレード"],
["ココマドモアゼル", "浦島坂田船", "ココマドモアゼル"],
["シャドウ", "浦島坂田船", "シャドウ"],
["秘密のプレイルーム", "浦島坂田船", "ヒミツノプレイルーム"],
["Hate me↑↑Love Me↑↑", "浦島坂田船", "ヘイトミーラブミー"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["火炎", "浦島坂田船", "カエン"],
["Tokyo Highway Driving", "センラ", "トーキョーハイウェイドライビング"],
["Addiction", "うらたぬき", "アディクション"],
["アナタサエ", "うらさか", "アナタサエ"],
["Wolf Gang", "志麻", "ウルフギャング"],
["ヒットチューン", " となりの坂田。", "ヒットチューン"],
["独占フルスロットル", "志麻セン", "ドクセンフルスロットル"],
["Secret Answer", "浦島坂田船", "シークレットアンサー"],
["カレンダーリマインダー", "浦島坂田船", "カレンダーリマインダー"],
["Game Changer", "浦島坂田船", "ゲームチェンジャー"],
["USSS GPT", "浦島坂田船", "ユーエスエスエスジーピーティー"],
["Why？感情発表祭", "浦島坂田船", "ホワイカンジョウハッピョウサイ"],
["合戦", "浦島坂田船", "カッセン"],
["好きすぎて滅！", "浦島坂田船", "スキスギテメツ"],
["アダマントリング", "浦島坂田船", "アダマントリング"],
["エンドレステイル", "浦島坂田船", "エンドレステイル"],
["TENTH", "浦島坂田船", "テンス"]
]
},
{
  date: "8月2日",
  place: "宮城・ゼビオアリーナ仙台",
  songs: [

["THE TABOO", "浦島坂田船", "ザタブー"],
["青く塗り替えろ！", "浦島坂田船", "アオクヌリカエロ"],
["USSS HOLIC", "浦島坂田船", "ユーエスエスエスホリック"],
["むしろ Why?", "浦島坂田船", "ムシロホワイ"],
["マスカレード", "浦島坂田船", "マスカレード"],
["ココマドモアゼル", "浦島坂田船", "ココマドモアゼル"],
["溺愛", "浦島坂田船", "デキアイ"],
["秘密のプレイルーム", "浦島坂田船", "ヒミツノプレイルーム"],
["Hate me↑↑Love Me↑↑", "浦島坂田船", "ヘイトミーラブミー"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["火炎", "浦島坂田船", "カエン"],
["Tokyo Highway Driving", "センラ", "トーキョーハイウェイドライビング"],
["Addiction", "うらたぬき", "アディクション"],
["アナタサエ", "うらさか", "アナタサエ"],
["Wolf Gang", "志麻", "ウルフギャング"],
["ヒットチューン", " となりの坂田。", "ヒットチューン"],
["独占フルスロットル", "志麻セン", "ドクセンフルスロットル"],
["Secret Answer", "浦島坂田船", "シークレットアンサー"],
["カレンダーリマインダー", "浦島坂田船", "カレンダーリマインダー"],
["Sailor's High", "浦島坂田船", "セイラーズハイ"],
["USSS GPT", "浦島坂田船", "ユーエスエスエスジーピーティー"],
["Why？感情発表祭", "浦島坂田船", "ホワイカンジョウハッピョウサイ"],
["花吹雪", "浦島坂田船", "ハナフブキ"],
["好きすぎて滅！", "浦島坂田船", "スキスギテメツ"],
["アダマントリング", "浦島坂田船", "アダマントリング"],
["エンドレステイル", "浦島坂田船", "エンドレステイル"],
["TENTH", "浦島坂田船", "テンス"],
]
},
{
  date: "8月7日",
  place: "千葉・LaLa arena TOKYO-BAY",
  songs: [

["THE TABOO", "浦島坂田船", "ザタブー"],
["青く塗り替えろ！", "浦島坂田船", "アオクヌリカエロ"],
["USSS HOLIC", "浦島坂田船", "ユーエスエスエスホリック"],
["アイシナヨ", "浦島坂田船", "アイシナヨ"],
["マスカレード", "浦島坂田船", "マスカレード"],
["ココマドモアゼル", "浦島坂田船", "ココマドモアゼル"],
["シャドウ", "浦島坂田船", "シャドウ"],
["秘密のプレイルーム", "浦島坂田船", "ヒミツノプレイルーム"],
["Hate me↑↑Love Me↑↑", "浦島坂田船", "ヘイトミーラブミー"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["火炎", "浦島坂田船", "カエン"],
["Tokyo Highway Driving", "センラ", "トーキョーハイウェイドライビング"],
["Addiction", "うらたぬき", "アディクション"],
["アナタサエ", "うらさか", "アナタサエ"],
["Wolf Gang", "志麻", "ウルフギャング"],
["ヒットチューン", " となりの坂田。", "ヒットチューン"],
["独占フルスロットル", "志麻セン", "ドクセンフルスロットル"],
["Secret Answer", "浦島坂田船", "シークレットアンサー"],
["カレンダーリマインダー", "浦島坂田船", "カレンダーリマインダー"],
["Game Changer", "浦島坂田船", "ゲームチェンジャー"],
["USSS GPT", "浦島坂田船", "ユーエスエスエスジーピーティー"],
["Why？感情発表祭", "浦島坂田船", "ホワイカンジョウハッピョウサイ"],
["合戦", "浦島坂田船", "カッセン"],
["好きすぎて滅！", "浦島坂田船", "スキスギテメツ"],
["アダマントリング", "浦島坂田船", "アダマントリング"],
["エンドレステイル", "浦島坂田船", "エンドレステイル"],
["TENTH", "浦島坂田船", "テンス"]
]
},
{
  date: "8月8日",
  place: "千葉・LaLa arena TOKYO-BAY",
  songs: [

["THE TABOO", "浦島坂田船", "ザタブー"],
["青く塗り替えろ！", "浦島坂田船", "アオクヌリカエロ"],
["USSS HOLIC", "浦島坂田船", "ユーエスエスエスホリック"],
["むしろ Why?", "浦島坂田船", "ムシロホワイ"],
["マスカレード", "浦島坂田船", "マスカレード"],
["ココマドモアゼル", "浦島坂田船", "ココマドモアゼル"],
["溺愛", "浦島坂田船", "デキアイ"],
["秘密のプレイルーム", "浦島坂田船", "ヒミツノプレイルーム"],
["Hate me↑↑Love Me↑↑", "浦島坂田船", "ヘイトミーラブミー"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["火炎", "浦島坂田船", "カエン"],
["Tokyo Highway Driving", "センラ", "トーキョーハイウェイドライビング"],
["Addiction", "うらたぬき", "アディクション"],
["アナタサエ", "うらさか", "アナタサエ"],
["Wolf Gang", "志麻", "ウルフギャング"],
["ヒットチューン", " となりの坂田。", "ヒットチューン"],
["独占フルスロットル", "志麻セン", "ドクセンフルスロットル"],
["Secret Answer", "浦島坂田船", "シークレットアンサー"],
["カレンダーリマインダー", "浦島坂田船", "カレンダーリマインダー"],
["Sailor's High", "浦島坂田船", "セイラーズハイ"],
["USSS GPT", "浦島坂田船", "ユーエスエスエスジーピーティー"],
["Why？感情発表祭", "浦島坂田船", "ホワイカンジョウハッピョウサイ"],
["花吹雪", "浦島坂田船", "ハナフブキ"],
["好きすぎて滅！", "浦島坂田船", "スキスギテメツ"],
["アダマントリング", "浦島坂田船", "アダマントリング"],
["エンドレステイル", "浦島坂田船", "エンドレステイル"],
["TENTH", "浦島坂田船", "テンス"],
]
},
{
  date: "8月22日",
  place: "大阪・大阪城ホール",
  songs: [
    
["THE TABOO", "浦島坂田船", "ザタブー"],
["青く塗り替えろ！", "浦島坂田船", "アオクヌリカエロ"],
["USSS HOLIC", "浦島坂田船", "ユーエスエスエスホリック"],
["アイシナヨ", "浦島坂田船", "アイシナヨ"],
["マスカレード", "浦島坂田船", "マスカレード"],
["ココマドモアゼル", "浦島坂田船", "ココマドモアゼル"],
["シャドウ", "浦島坂田船", "シャドウ"],
["秘密のプレイルーム", "浦島坂田船", "ヒミツノプレイルーム"],
["Hate me↑↑Love Me↑↑", "浦島坂田船", "ヘイトミーラブミー"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["火炎", "浦島坂田船", "カエン"],
["Tokyo Highway Driving", "センラ", "トーキョーハイウェイドライビング"],
["Addiction", "うらたぬき", "アディクション"],
["アナタサエ", "うらさか", "アナタサエ"],
["Wolf Gang", "志麻", "ウルフギャング"],
["ヒットチューン", " となりの坂田。", "ヒットチューン"],
["独占フルスロットル", "志麻セン", "ドクセンフルスロットル"],
["Secret Answer", "浦島坂田船", "シークレットアンサー"],
["カレンダーリマインダー", "浦島坂田船", "カレンダーリマインダー"],
["Game Changer", "浦島坂田船", "ゲームチェンジャー"],
["USSS GPT", "浦島坂田船", "ユーエスエスエスジーピーティー"],
["Why？感情発表祭", "浦島坂田船", "ホワイカンジョウハッピョウサイ"],
["合戦", "浦島坂田船", "カッセン"],
["好きすぎて滅！", "浦島坂田船", "スキスギテメツ"],
["アダマントリング", "浦島坂田船", "アダマントリング"],
["エンドレステイル", "浦島坂田船", "エンドレステイル"],
["TENTH", "浦島坂田船", "テンス"]
 ["世界で一番好きな名前","浦島坂田船","セカイデイチバンスキナナマエ"],
  ]
},
{
  date: "8月23日",
  place: "大阪・大阪城ホール",
  songs: [
    
["THE TABOO", "浦島坂田船", "ザタブー"],
["青く塗り替えろ！", "浦島坂田船", "アオクヌリカエロ"],
["USSS HOLIC", "浦島坂田船", "ユーエスエスエスホリック"],
["むしろ Why?", "浦島坂田船", "ムシロホワイ"],
["マスカレード", "浦島坂田船", "マスカレード"],
["ココマドモアゼル", "浦島坂田船", "ココマドモアゼル"],
["溺愛", "浦島坂田船", "デキアイ"],
["秘密のプレイルーム", "浦島坂田船", "ヒミツノプレイルーム"],
["Hate me↑↑Love Me↑↑", "浦島坂田船", "ヘイトミーラブミー"],
["ホエールホール", "浦島坂田船", "ホエールホール"],
["火炎", "浦島坂田船", "カエン"],
["Tokyo Highway Driving", "センラ", "トーキョーハイウェイドライビング"],
["Addiction", "うらたぬき", "アディクション"],
["アナタサエ", "うらさか", "アナタサエ"],
["Wolf Gang", "志麻", "ウルフギャング"],
["ヒットチューン", " となりの坂田。", "ヒットチューン"],
["独占フルスロットル", "志麻セン", "ドクセンフルスロットル"],
["Secret Answer", "浦島坂田船", "シークレットアンサー"],
["カレンダーリマインダー", "浦島坂田船", "カレンダーリマインダー"],
["Sailor's High", "浦島坂田船", "セイラーズハイ"],
["USSS GPT", "浦島坂田船", "ユーエスエスエスジーピーティー"],
["Why？感情発表祭", "浦島坂田船", "ホワイカンジョウハッピョウサイ"],
["花吹雪", "浦島坂田船", "ハナフブキ"],
["好きすぎて滅！", "浦島坂田船", "スキスギテメツ"],
["アダマントリング", "浦島坂田船", "アダマントリング"],
["エンドレステイル", "浦島坂田船", "エンドレステイル"],
["TENTH", "浦島坂田船", "テンス"],
      ["＋","浦島坂田船","プラス"],
  ]
    }
  ]
);


addLiveTour(
  "浦島坂田船",
  "2026",
  "Happy Halloweeeen 浦島坂田幽霊船 ～ぼくたち魔法少年うしさせいんと☆みるきぃず 超特大しゅうぱぁまっくすだいだいだいしゅきぱわぁ chuuuuuuuuuu…にゅ？い、いかん！魔力が足りぬ！ 「えむピくれぴ♡んぅう満ちち☆彡」～",
  [
{
  date: "10月10日",
  place: "東京・有明アリーナ",
  songs: [

  ]
},
{
  date: "10月11日",
  place: "東京・有明アリーナ",
  songs: [

  ]
},
{
  date: "10月24日",
  place: "兵庫・神戸ワールド記念ホール",
  songs: [

  ]
},
{
  date: "10月25日",
  place: "兵庫・神戸ワールド記念ホール",
  songs: [

  ]
    }
  ]
);
