addLiveTour(
  "浦島坂田船",
  "2018",
  "浦島坂田船 Spring Tour 2018 ～桜吹雪で乱de舞！～",
  [
    {
      date: "4月5日",
      place: "東京・Zepp Tokyo ",
      songs: [
["百花繚乱", "浦島坂田船", "ヒャッカリョウラン"],
["千本桜 -guitar rock arrangement-", "浦島坂田船", "センボンザクラギターロックアレンジメント"],
["チュルリラ・チュルリラ・ダッダッダ！", "浦島坂田船", "チュルリラチュルリラダッダッダ"],
["太陽系デスコ", "浦島坂田船", "タイヨウケイデスコ"],
["ターミナル", "センラ", "ターミナル"],
["♯嘲笑ポラロイド", "志麻セン", "チョウショウポラロイド"],
["カメリア・コンプレックス", "志麻", "カメリアコンプレックス"],
["お気に召すまま", "となりの坂田。", "オキニメスママ"],
["ノンファンタジー", "うらさか", "ノンファンタジー"],
["テオ", "うらたぬき", "テオ"],
["海賊船～心の奪い手～", "浦島坂田船", "カイゾクセンココロノウバイテ"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["Carry Forward", "浦島坂田船", "キャリーフォワード"],
["彗星ハネムーン", "浦島坂田船", "スイセイハネムーン"],
["ハロウ！ゴーストシップ", "浦島坂田船", "ハロウゴーストシップ"],
["Shouter", "浦島坂田船", "シャウター"],
["SHOW MUST GO ON!!", "浦島坂田船", "ショーマストゴーオン"],
["年に一夜の恋模様", "浦島坂田船", "ネンニイチヤノコイモヨウ"],
["Mermaid", "浦島坂田船", "マーメイド"],
["そらに、ひらり", "浦島坂田船", "ソラニヒラリ"],
       ]
    }
  ]
);


addLiveTour(
  "浦島坂田船",
  "2018",
  "浦島坂田船 SUMMER TOUR 2018～THE FINAL～",
  [
    {
      date: "10月27日",
      place: "千葉・幕張イベントホール ",
      songs: [
["Starry Cruise", "浦島坂田船", "スターリークルーズ"],
["明星ギャラクティカ", "浦島坂田船", "ミョウジョウギャラクティカ"],
["わいふぁい暴想ボーイ", "浦島坂田船", "ワイファイボウソウボーイ"],
["ロキ", "浦島坂田船", "ロキ"],
["太陽系デスコ", "浦島坂田船", "タイヨウケイデスコ"],
["スクールボーイ", "となりの坂田。", "スクールボーイ"],
["ユメミドリ", "うらさか", "ユメミドリ"],
["Life goes on", "うらたぬき", "ライフゴーズオン"],
["spill", "志麻", "スピル"],
["Make a pass", "センラ", "メイクアパス"],
["ギャラクシー", "志麻セン", "ギャラクシー"],
["Peacock Epoch", "浦島坂田船", "ピーコックエポック"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["ロメオ", "浦島坂田船", "ロメオ"],
["Sailor's High", "浦島坂田船", "セイラーズハイ"],
["SHOW MUST GO ON!!", "浦島坂田船", "ショーマストゴーオン"],
["secret base ～君がくれたもの～", "浦島坂田船", "シークレットベースキミガクレタモノ"],
["年に一夜の恋模様", "浦島坂田船", "ネンニイチヤノコイモヨウ"],
["千本桜 -guitar rock arrangement-", "浦島坂田船", "センボンザクラギターロックアレンジメント"],
["Shouter", "浦島坂田船", "シャウター"],
["SAILING!!!!!", "浦島坂田船", "セイリング"],
       ]
    }
  ]
);






addLiveTour(
  "浦島坂田船",
  "2019",
  "浦島坂田船 Spring Tour 2019 ―斬（ZAN）―",
  [
    {
      date: "4月4日",
      place: "東京・両国国技館 ",
      songs: [
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["千本桜 -guitar rock arrangement-", "浦島坂田船", "センボンザクラギターロックアレンジメント"],
["虎視眈々", "浦島坂田船", "コシタンタン"],
["百花繚乱", "浦島坂田船", "ヒャッカリョウラン"],
["吉原ラメント", "浦島坂田船", "ヨシワララメント"],
["やっぱ最強！", "うらさか", "ヤッパサイキョウ"],
["ジグソーパズル", "志麻セン", "ジグソーパズル"],
["誠 -Live for Justice-", "浦島坂田船", "マコトライブフォージャスティス"],
["スパイラル", "センラ", "スパイラル"],
["セクトの誅罰", "うらたぬき", "セクトノチュウバツ"],
["ボードゲームライフ", "志麻", "ボードゲームライフ"],
["ねぇ、どろどろさん", "となりの坂田。", "ネェドロドロサン"],
["神のまにまに", "浦島坂田船", "カミノマニマニ"],
["小さなライオン", "浦島坂田船", "チイサナライオン"],
["Sailor's High", "浦島坂田船", "セイラーズハイ"],
["わいふぁい暴想ボーイ", "浦島坂田船", "ワイファイボウソウボーイ"],
["Peacock Epoch", "浦島坂田船", "ピーコックエポック"],
["合戦", "浦島坂田船", "カッセン"],
["そらに、ひらり", "浦島坂田船", "ソラニヒラリ"],
["Shouter", "浦島坂田船", "シャウター"],
["SAILING!!!!!", "浦島坂田船", "セイリング"],
       ]
    }
  ]
);






addLiveTour(
  "浦島坂田船",
  "2022",
  "浦島坂田船 Spring Tour 2022 ～令和浪漫～",
  [
    {
      date: "4月9日",
      place: "神奈川・ぴあアリーナMM",
      songs: [
        ["燦然賛歌", "浦島坂田船", "サンゼンサンカ"],
["グッド・バイ", "浦島坂田船", "グッドバイ"],
["吉原ラメント", "浦島坂田船", "ヨシワララメント"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレアラシコンフュージョン"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["オルターエゴ", "志麻セン", "オルターエゴ"],
["爆笑", "うらさか", "バクショウ"],
["誠-Live for Justice-", "浦島坂田船", "マコトライブフォージャスティス"],
["極楽浄土", "浦島坂田船", "ゴクラクジョウド"],
["貴方と云ふ花", "浦島坂田船", "アナタトイウハナ"],
["ベビーデーズ", "さかせん", "ベビーデーズ"],
["アニマル", "裏千家", "アニマル"],
["チェック・ナイト", "となりの坂田。", "チェックナイト"],
["Burn it down", "うらしま", "バーンイットダウン"],
["レーヴ", "志麻", "レーヴ"],
["パンペルデュ", "センラ", "パンペルデュ"],
["二息歩行(Reloaded)", "しまさか", "ニソクホコウリローデッド"],
["恋のMAGIC", "うらたぬき", "コイノマジック"],
["シンデレラステップ", "浦島坂田船", "シンデレラステップ"],
["マジカル・ショコラティエ", "浦島坂田船", "マジカルショコラティエ"],
["生涯ライバル", "浦島坂田船", "ショウガイライバル"],
["ワナビークインビ―", "浦島坂田船", "ワナビークインビー"],
["アワ・ダンサー", "浦島坂田船", "アワダンサー"],
["realizer", "浦島坂田船", "リアライザー"],
["Peacock Epoch", "浦島坂田船", "ピーコックエポック"],
["花や、花", "浦島坂田船", "ハナヤハナ"],
      ]
    },


    {
       date: "4月10日",
      place: "神奈川・ぴあアリーナMM",
      songs: [
        ["燦然賛歌", "浦島坂田船", "サンゼンサンカ"],
["グッド・バイ", "浦島坂田船", "グッドバイ"],
["吉原ラメント", "浦島坂田船", "ヨシワララメント"],
["花魁俺嵐コンフュージョン", "浦島坂田船", "オイランオレアラシコンフュージョン"],
["花鳥風月", "浦島坂田船", "カチョウフウゲツ"],
["オルターエゴ", "志麻セン", "オルターエゴ"],
["爆笑", "うらさか", "バクショウ"],
["誠-Live for Justice-", "浦島坂田船", "マコトライブフォージャスティス"],
["極楽浄土", "浦島坂田船", "ゴクラクジョウド"],
["貴方と云ふ花", "浦島坂田船", "アナタトイウハナ"],
["ベビーデーズ", "さかせん", "ベビーデーズ"],
["アニマル", "裏千家", "アニマル"],
["チェック・ナイト", "となりの坂田。", "チェックナイト"],
["Burn it down", "うらしま", "バーンイットダウン"],
["レーヴ", "志麻", "レーヴ"],
["パンペルデュ", "センラ", "パンペルデュ"],
["二息歩行(Reloaded)", "しまさか", "ニソクホコウリローデッド"],
["恋のMAGIC", "うらたぬき", "コイノマジック"],
["シンデレラステップ", "浦島坂田船", "シンデレラステップ"],
["マジカル・ショコラティエ", "浦島坂田船", "マジカルショコラティエ"],
 ["わいふぁい暴想ボーイ","日替わり","ワイファイボウソウボーイ"],
["ワナビークインビ―", "浦島坂田船", "ワナビークインビー"],
["アワ・ダンサー", "浦島坂田船", "アワダンサー"],
["realizer", "浦島坂田船", "リアライザー"],
["Peacock Epoch", "浦島坂田船", "ピーコックエポック"],
["花や、花", "浦島坂田船", "ハナヤハナ"],
      ]
    }
  ]
);


