addLiveTour(
  "しまさか",
  "2025",
  "【速報】しまさかでバースデーイベントやるってよwww >>9 Last Phrase",
  [
{
  date: "12月1日",
  place: "兵庫・アクリエひめじ 大ホール",
  songs: [

  ]
},
{
  date: "12月5日",
  place: "埼玉・大宮ソニックシティ 大ホール",
  songs: [

  ]
},
{
  date: "12月7日",
  place: "石川・本多の森 北電ホール",
  songs: [

  ]
},
{
  date: "12月9日",
  place: "宮城・仙台サンプラザホール",
  songs: [

  ]
},
{
  date: "12月12日",
  place: "福岡・久留米シティプラザ ザ・グランドホール",
  songs: [

  ]
},
{
  date: "12月14日",
  place: "大阪・グランキューブ大阪",
  songs: [

  ]
},
{
  date: "12月16日",
  place: "愛知・Niterra日本特殊陶業市民会館フォレストホール",
  songs: [

  ]
},
{
  date: "12月21日",
  place: "東京・東京ガーデンシアター",
  songs: [
["ガチ恋者達に捧ぐバラッド ～キミが笑えば地球も回る～","しまさか","ガチコイシャタチニササグバラッドキミガワラエバチキュウモマワル"],
["シャララ","しまさか","シャララ"],
["溺愛","しまさか","デキアイ"],
["PAPER MOON","しまさか","ペーパームーン"],
["コールボーイ","しまさか","コールボーイ"],
["虎視眈々","しまさか","コシタンタン"],
["脳内シェイカー","しまさか","ノウナイシェイカー"],
["ワールズエンド・ダンスホール(rock arrange ver.)","しまさか","ワールズエンドダンスホールロックアレンジバージョン"],
["夜は眠れるかい？","しまさか","ヨルハネムレルカイ"],
["ムラサキ","志麻","ムラサキ"],
["ジロティナブル","しまさか","ジロティナブル"],
["Datency","となりの坂田。","デイテンシー"],
["乱×銃","しまさか","ランガン"],
["Pink","しまさか","ピンク"],
["ZEAL","しまさか","ジール"],
["独断","しまさか","ドクダン"],
["女々しくて","しまさか","メメシクテ"],
["CRAZY BUNNY!!","しまさか","クレイジーバニー"],
["ずっとずっと。","しまさか","ズットズット"],
["ラストフレーズ","しまさか","ラストフレーズ"],
["RED","しまさか","レッド"],
["愛してもいいかい？","しまさか","アイシテモイイカイ"],
["未完成ユートピア","しまさか","ミカンセイユートピア"],
  ]
    }
  ]
);






addLiveTour(
  "しまさか",
  "2024",
  "【速報】しまさかでバースデーイベントやるってよwww >>8 Missa",
  [
{
  date: "12月1日",
  place: "宮城・東京エレクトロンホール宮城",
  songs: [

  ]
},
{
  date: "12月4日",
  place: "愛知・名古屋国際会議場センチュリーホール",
  songs: [

  ]
},
{
  date: "12月5日",
  place: "大阪・フェニーチェ堺",
  songs: [

  ]
},
{
  date: "12月8日",
  place: "東京・東京ガーデンシアター",
  songs: [
["ジロティナブル","しまさか","ジロティナブル"],
["ヒバナ","しまさか","ヒバナ"],
["It's...Our Life?","しまさか","イッツアワーライフ"],
["神っぽいな","しまさか","カミッポイナ"],
["ウィキアリティ","しまさか","ウィキアリティ"],
["ワールズエンド・ダンスホール","しまさか","ワールズエンドダンスホール"],
["イドラのサーカス","しまさか","イドラノサーカス"],
["ラストフレーズ","しまさか","ラストフレーズ"],
["モエチャッカファイア","志麻","モエチャッカファイア"],
["プロポーズ","となりの坂田。","プロポーズ"],
["未完成ユートピア","しまさか","ミカンセイユートピア"],
["二息歩行（Reloaded）","しまさか","ニソクホコウリローデッド"],
["CRAZY BUNNY！！","しまさか","クレイジーバニー"],
["ダンサブリミア","しまさか","ダンサブリミア"],
["シャララ","しまさか","シャララ"],
["無駄≠無駄","しまさか","ムダムダ"],
["曇天","しまさか","ドンテン"],
["RED","しまさか","レッド"],
["My Sweet Prisoner","しまさか","マイスイートプリズナー"],
["Black Knight","しまさか","ブラックナイト"],
["乱×銃","しまさか","ランガン"],
  ]
},
{
  date: "12月11日",
  place: "兵庫・神戸国際会館こくさいホール",
  songs: [

  ]
},
{
  date: "12月13日",
  place: "福岡・北九州ソレイユホール",
  songs: [

  ]
    }
  ]
);













addLiveTour(
  "しまさか",
  "2023",
  "【速報】しまさかでバースデーイベントやるってよwww >>7 DeePrison",
  [
{
  date: "12月1日",
  place: "東京・東京国際フォーラム ホールA",
  songs: [
["My Sweet Prisoner","しまさか","マイスイートプリズナー"],
["罰ゲーム","しまさか","バツゲーム"],
["PLATONIC GIRL","しまさか","プラトニックガール"],
["レクイエム","しまさか","レクイエム"],
["え？あぁ、そう。","しまさか","エアソウ"],
["ワナビークインビー","しまさか","ワナビークインビー"],
["レッドホットクレイジーナイト","しまさか","レッドホットクレイジーナイト"],
["生き証人","しまさか","イキショウニン"],
["脱獄 -Rock Arrange ver.-","しまさか","ダツゴクロックアレンジバージョン"],
["酔いどれ知らず","しまさか","ヨイドレシラズ"],
["ダーリン","しまさか","ダーリン"],
["乱×銃","しまさか","ランジュウ"],
["Magiない♡カリグラフィック","しまさか","マジナイカリグラフィック"],
["スーパーヒーロー","しまさか","スーパーヒーロー"],
["チェック・ナイト","しまさか","チェックナイト"],
["CRAZY BUNNY!!","しまさか","クレイジーバニー"],
["4 REAL IN ACTION !!!!","しまさか","フォーリアルインアクション"],
["RED","しまさか","レッド"],
["未完成ユートピア","しまさか","ミカンセイユートピア"],
["ラストフレーズ","しまさか","ラストフレーズ"],
  ]
},
{
  date: "12月5日",
  place: "大阪・Zepp Namba(OSAKA)",
  songs: [

  ]
},
{
  date: "12月6日",
  place: "愛知・Zepp Nagoya",
  songs: [

  ]
},
{
  date: "12月8日",
  place: "福岡・北九州ソレイユホール",
  songs: [

  ]
},
{
  date: "12月16日",
  place: "宮城・仙台サンプラザホール",
  songs: [

  ]
    }
  ]
);






addLiveTour(
  "しまさか",
  "2022",
  "【速報】しまさかでバースデーイベントやるってよwww >>6 FAKEOUT",
  [
{
  date: "12月1日",
  place: "大阪・Zepp Namba(OSAKA)",
  songs: [
["RED","しまさか","レッド"],
["ロキ","しまさか","ロキ"],
["拝啓ドッペルゲンガー","しまさか","ハイケイドッペルゲンガー"],
["脱法ロック","しまさか","ダッポウロック"],
["シャンティ","しまさか","シャンティ"],
["ヒロイン","志麻","ヒロイン"],
["クリスマスソング","となりの坂田。","クリスマスソング"],
["レッドホットクレイジーナイト","しまさか","レッドホットクレイジーナイト"],
["PAPER MOON","しまさか","ペーパームーン"],
["未完成ユートピア","しまさか","ミカンセイユートピア"],
["エゴロック","しまさか","エゴロック"],
["CRAZY BUNNY！！","しまさか","クレイジーバニー"],
["二息歩行（Reloaded）","しまさか","ニソクホコウ"],
["鼓動","しまさか","コドウ"],
["FIREFIRE","しまさか","ファイアファイア"],
["乱×銃","しまさか","ランガン"],
["スーパーヒーロー","しまさか","スーパーヒーロー"],
["ラストフレーズ","しまさか","ラストフレーズ"],
  ]
},
{
  date: "12月2日",
  place: "福岡・Zepp Fukuoka",
  songs: [
["RED","しまさか","レッド"],
["ロキ","しまさか","ロキ"],
["拝啓ドッペルゲンガー","しまさか","ハイケイドッペルゲンガー"],
["脱法ロック","しまさか","ダッポウロック"],
["シャンティ","しまさか","シャンティ"],
["恋々遊々","志麻","コイコイユウユウ"],
["君が飛び降りるのならば","となりの坂田。","キミガトビオリルノナラバ"],
["レッドホットクレイジーナイト","しまさか","レッドホットクレイジーナイト"],
["PAPER MOON","しまさか","ペーパームーン"],
["未完成ユートピア","しまさか","ミカンセイユートピア"],
["エゴロック","しまさか","エゴロック"],
["CRAZY BUNNY！！","しまさか","クレイジーバニー"],
["二息歩行（Reloaded）","しまさか","ニソクホコウ"],
["鼓動","しまさか","コドウ"],
["FIREFIRE","しまさか","ファイアファイア"],
["乱×銃","しまさか","ランガン"],
["スーパーヒーロー","しまさか","スーパーヒーロー"],
["ラストフレーズ","しまさか","ラストフレーズ"],
  ]
},
{
  date: "12月5日",
  place: "東京・Zepp DiverCity(TOKYO)",
  songs: [
["RED","しまさか","レッド"],
["ロキ","しまさか","ロキ"],
["拝啓ドッペルゲンガー","しまさか","ハイケイドッペルゲンガー"],
["脱法ロック","しまさか","ダッポウロック"],
["シャンティ","しまさか","シャンティ"],
["ヒロイン","志麻","ヒロイン"],
["クリスマスソング","となりの坂田。","クリスマスソング"],
["レッドホットクレイジーナイト","しまさか","レッドホットクレイジーナイト"],
["PAPER MOON","しまさか","ペーパームーン"],
["未完成ユートピア","しまさか","ミカンセイユートピア"],
["エゴロック","しまさか","エゴロック"],
["CRAZY BUNNY！！","しまさか","クレイジーバニー"],
["二息歩行（Reloaded）","しまさか","ニソクホコウ"],
["鼓動","しまさか","コドウ"],
["FIREFIRE","しまさか","ファイアファイア"],
["乱×銃","しまさか","ランガン"],
["スーパーヒーロー","しまさか","スーパーヒーロー"],
["ラストフレーズ","しまさか","ラストフレーズ"],
  ]
},
{
  date: "12月8日",
  place: "愛知・Zepp Nagoya",
  songs: [

  ]
},
{
  date: "12月11日",
  place: "宮城・SENDAI GIGS",
  songs: [

  ]
    }
  ]
);







addLiveTour(
  "しまさか",
  "2021",
  "【速報】しまさかでバースデーイベントやるってよwww >>5 ～Bloody Holy Night～",
  [
{
  date: "12月1日",
  place: "神奈川・KT Zepp Yokohama",
  songs: [

  ]
},
{
  date: "12月3日",
  place: "愛知・Zepp Nagoya",
  songs: [

  ]
},
{
  date: "12月5日",
  place: "大阪・Zepp Namba(OSAKA)",
  songs: [

  ]
},
{
  date: "12月9日",
  place: "東京・Zepp Tokyo",
  songs: [

  ]
    }
  ]
);





addLiveTour(
  "しまさか",
  "2019",
  "【速報】しまさかでバースデーイベントやるってよwww >>4 ～百年戦争 Live or die～",
  [
{
  date: "12月1日",
  place: "大阪・Zepp Osaka Bayside",
  songs: [

  ]
},
{
  date: "12月5日",
  place: "東京・Zepp Tokyo",
  songs: [

  ]
},
{
  date: "12月7日",
  place: "宮城・SENDAI GIGS",
  songs: [

  ]
},
{
  date: "12月15日",
  place: "北海道・Zepp Sapporo",
  songs: [

  ]
    }
  ]
);



addLiveTour(
  "しまさか",
  "2018",
  "【速報】しまさかでバースデーイベントやるってよwww >>3 ～The Last Supper of HEISEI～",
  [
{
  date: "12月1日",
  place: "大阪・Zepp Osaka Bayside",
  songs: [

  ]
},
{
  date: "12月2日",
  place: "東京・ZeppTokyo",
  songs: [

  ]
},
{
  date: "12月8日",
  place: "東京・チームスマイル・豊洲PIT",
  songs: [

  ]
    }
  ]
);






addLiveTour(
  "しまさか",
  "2017",
  "【速報】しまさかでバースデーイベントやるってよwww >>2 ～今年は東京からの大阪らしい～",
  [
{
  date: "12月2日",
  place: "東京・Zepp DiverCity(TOKYOI)",
  songs: [

  ]
},
{
  date: "12月3日",
  place: "大阪・Zepp Osaka Bayside",
  songs: [

  ]
    }
  ]
);





addLiveTour(
  "しまさか",
  "2016",
  "しまさかでバースデーイベントやるってよwww",
  [
{
  date: "12月18日",
  place: "京都・京都FANJ",
  songs: [

  ]
    }
  ]
);
